[{"DisplayName":"Alexis Anderson","area1":"Experiential","area2":"Civil Litigation & Procedure","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/alexis-anderson.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Anderson_335x400.jpg","SortName":"Anderson, Alexis","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Alexis Anderson is an Associate Clinical Professor at the Law School's civil litigation clinic at the Legal Assistance Bureau (LAB) in Waltham, MA. She joined Boston College Law School in 1983 and has taught a range of clinical and legal history courses. She currently teaches the Civil Litigation Clinic and the Survey Professional Responsibility Course. Previously, she supervised BC Law's extern program and taught and coordinated the first year legal ethics and skills course. In addition, she has taught the survey American Legal History course and a seminar focusing on the development of free speech theory. From 2001-04, she served as Director of Advocacy and faculty advisor to BC Law's Board of Student Advisors. Prior to coming to Boston College Law School, Professor Anderson was a litigator in a large, civil practice law firm in Philadelphia. She received her law degree and her Masters in Legal History from the University of Virginia. In past summers, Professor Anderson served as the project director for the State Department's Fulbright Summer Institute for International Scholars, a six-week graduate level course for foreign university professors co-hosted by Boston College Law School and the School of Arts and Sciences. The program provided an opportunity for faculty to develop international contacts and share perspectives on the role of law in the development of the American character, political system, and culture. Professor Anderson remains active in regional and national clinical organizations and continues to publish in both the clinical, ethics and legal history fields."},
{"DisplayName":"Filippa Anzalone","area1":"Legal Research","area2":"Art Law","area3":"Intellectual Property & Technology Law; Business Law","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/filippa-anzalone.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Anzalone_335x400.jpg","SortName":"Anzalone, Filippa","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Filippa Marullo Anzalone has served as Professor of Law and Associate Dean for Library and Technology Services at Boston College Law School since August 2002. Professor Anzalone teaches an Art Law seminar and also teaches Advanced Legal Research. Besides Art Law, legal education, higher education management, and law library leadership are of particular interest to her. Before joining Boston College Law School, Filippa Marullo Anzalone was at Northeastern University School of Law School for almost eleven years. When she left Northeastern University School of Law School Library, Filippa was Professor of Law and Director of Information and Research Services. Professor Anzalone had served as Acting Dean of the Northeastern University Libraries for the 2000/2001 academic year. Prior to entering academic law librarianship, Filippa Marullo Anzalone was director of the law library at the Boston law firm of Bingham, Dana and Gould (now Bingham McCutcheon). She has also worked as a research librarian at Dike, Bronstein, Roberts, Cushman & Pfund, as a public library administrator at the Cambridge Public Library, and as the head children's librarian in the Medford Public Library. Before her academic career, Professor Anzalone spent time working summers in the Medford Public Library during her undergraduate years. Her other jobs have included working as a counter girl in an Italian bakery, as a nursing home aide, and as a babysitter. Her favorite job (pre-library) was, without a doubt, working in the bakery. Professor Anzalone has published many articles, book chapters, book reviews and opinion pieces. She is active in the both the Law School and University communities. Professor Anzalone has served as a panelist and chaired several programs at recent AALL and AALS conferences and she has participated in numerous ABA, AALS, and NEASC site evaluations of law schools. She has served as a consultant to a number of law school libraries and she has lectured both in the United States and abroad on leadership and management issues. Professor Anzalone received an A.B. from Smith College in 1975, a M.S.L.S. from Simmons College Graduate School of Library Science in 1977, and a J.D. from Suffolk University Law School in 1985."},
{"DisplayName":"Paulo Barrozo","area1":"Criminal Law & Procedure","area2":"Legal History & Jurisprudence","area3":"International & Comparative Law; Civil & Human Rights Law; ","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paulo-barrozo.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Barrozo_335x400.jpg","SortName":"Barrozo, Paulo","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Paulo Barrozo is a theorist whose work has offered new understandings of rights, punishment, cruelty, structural mercy, the political, and the origins and nature of modern law and institutions. His current work focuses on sovereignty and reason, constructive formalism, reflective evolution and futurism, normative imagination, and the transformation of legal education. Barrozo received an S.J.D. from Harvard Law School and a Ph.D. in Political Science from the Rio de Janeiro University Research Institute. Before joining Boston College Law School, he was a Lecturer in social thought at Harvard University, where he was the first recipient of the Stanley Hoffman Prize for Excellence in Teaching. Barrozo is an active advocate for the rights of the neurodiverse and the unparented."},
{"DisplayName":"Sharon Beckman","area1":"Experiential","area2":"Criminal Law & Procedure","area3":"Ethics & Professional Responsibility; Civil & Human Rights Law;","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/sharon-beckman.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Beckman_335x400.jpg","SortName":"Beckman, Sharon","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Sharon Beckman is Co-Director of the Boston College Criminal Justice Clinic and Director of the Boston College Innocence Project. She is an honors graduate of Harvard College and the University of Michigan Law School, where she was Editor-in-Chief of the Michigan Law Review and received the Henry M. Bates Memorial Scholarship, the Law School's top honor. She served as a law clerk to the Hon. Sandra Day O'Connor of the Supreme Court of the United States and to Hon. Frank Coffin of the United States Court of Appeals for the First Circuit. She serves on the SJC Standing Committee on Eyewitness Identification, the Board of the New England Innocence Program, and on the Criminal Justice Act Appellate Panel of the U.S. Court of Appeals for the First Circuit. A Boston College Law School faculty member since 1996, Professor Beckman is the recipient of numerous teaching awards, including the University Distinguished Teaching Award, the highest teaching honor bestowed by Boston College. She has received the Law School's Emil Slizewski Award for Faculty Excellence and the Ruth-Arlene Howe Black Law Students Association Faculty Member of the Year Award. In addition to her clinics, Professor Beckman has taught Criminal Law, Criminal Procedure, Constitutional Law, and seminars on the Supreme Court, White Collar Crime, and Punishment. Prior to joining the BC Law faculty, Professor Beckman practiced law for seven years with the Silverglate, Gertner firm in Boston and Jenner & Block in Chicago. Her practice included criminal and civil litigation in state and federal trial and appellate courts, administrative agency proceedings, and internal corporate investigations. By appointment as a member of the Equal Justice Act Panel, Professor Beckman continues to represent indigent appellants in the United States Court of Appeals for the First Circuit. The former Captain of the Harvard Women's Swimming and Water Polo teams, Beckman was the First New England woman to swim across the English Channel and was ranked first in the United States and third in the world among female marathon swimmers. She is a Nationally ranked U.S. Masters Swimmer and serves on the National Board of Review for USA Swimming."},
{"DisplayName":"Mary Sarah Bilder","area1":"Legal History & Jurisprudence","area2":"Property","area3":"Family & Estate Law; Constitutional Law;","acfacAreas":"Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mary-sarah-bilder.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Bilder_335x400.jpg","SortName":"Bilder, Mary Sarah","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Mary Sarah Bilder teaches in the areas of property, trusts and estates, and American legal and constitutional history at Boston College Law School. She received her B.A. with Honors (English) and the Dean’s Prize from the University of Wisconsin at Madison, her J.D. (magna cum laude) from Harvard Law School, and her A.M. (History) and Ph.D. from Harvard University in the History of American Civilization/American Studies. She was a law clerk to the Hon. Francis Murnaghan, Jr., U.S. Court of Appeals, Fourth Circuit. Her recent work has focused on the history of the Constitution, James Madison and the Founders, the history of judicial review, and colonial and founding era constitutionalism. Professor Bilder is a member of the American Law Institute, the Colonial Society of Massachusetts, the Massachusetts Historical Society, and a Fellow of the American Bar Foundation. She is member of the Massachusetts Bar Association (inactive status) and the State Bar of Wisconsin (inactive status). She was given the Emil Slizewski Faculty Teaching Award in 2007 and was named Michael and Helen Lee Distinguished Scholar in 2009. She was named the Founders Professor of Law in 2016. Her most recent book, Madison's Hand: Revising the Constitutional Convention, was awarded the 2016 Bancroft Prize in American History and Diplomacy, and was named a finalist for the George Washington Book Prize. Richard Beeman, author of Our Lives, Our Fortunes and Our Sacred Honor, called it 'an exceptionally important piece of work that will have a profound impact on all future work on the Constitutional Convention.' Read more reviews. She is the author of The Transatlantic Constitution: Colonial Legal Culture and the Empire (Harvard University Press, 2004), awarded the Littleton-Griswold Award from the American Historical Association. Her articles appear in several important collected volumes of essays and a wide variety of journals, including the Yale Law Journal, the Stanford Law Review, the Yale Journal of Law and the Humanities, the George Washington Law Review, Law and History Review, Law Library Journal, and the Journal of Policy History. She co-edited Blackstone in America: Selected Essays of Kathryn Preyer (Cambridge University Press, 2009). She has received a William Nelson Cromwell Foundation Grant, the Boston College Annual Prize for Scholarship, a Boston College Distinguished Research Award, a Mellon Fellowship in the Humanities, and was a Boston College Law School Fund Scholar. She currently serves on the Editorial Board of Law and History Review, and The Journal of Legal Education, the Board of The New England Quarterly, and is a member of the American Law Institute, the Colonial Society of Massachusetts, and the Massachusetts Historical Society. She was the Lucy G. Moses Visiting Professor at Columbia Law School in 2001 and was a visiting professor at Harvard Law School in the spring of 2008. Professor Bilder is the author of a renowned blog entry on how to teach the Rule Against Perpetuities in one class hour, has been interviewed by The Documentary Group and History Channel, and served as a legal history consultant to Steven Spielberg on Amistad."},
{"DisplayName":"Robert M. Bloom","area1":"Criminal Law & Procedure","area2":"Civil Litigation & Procedure","area3":"Civil & Human Rights Law","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/robert-bloom.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Bloom_335x400.jpg","SortName":"Bloom, Robert M.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Robert M. Bloom, Professor of Law, has had legal experience in legal services, civil rights law, and as a criminal attorney, both a defense lawyer and prosecutor. He also has been a court-appointed master on complicated civil cases. He is the author of numerous publications in the area of criminal procedure and civil procedure. Professor Bloom has received the Public Interest Law Foundation Faculty Member of the Year Award (2010); the Emil Slizewski Teacher of the Year Award (2009); and the Ruth Arlene Howe Faculty Member of the Year award from the Black Law Students Association (2003)."},
{"DisplayName":"E. Joan Blum","area1":"Experiential","area2":"Legal Research","area3":"Ethics & Professional Responsibility","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joan-blum.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Blum_335x400.jpg","SortName":"Blum, E. Joan","facultyStatus":"Full-Time Faculty","priority":1,"biography":"E. Joan Blum received her B.A. degree summa cum laude from Harvard University in 1975, where she was elected to Phi Beta Kappa. In 1978 she received her J.D. from Columbia Law School, where she was a Harlan Fiske Stone Scholar and a member of the Law Review. She was admitted to practice in Massachusetts in 1978, and in 1978-79 she was Law Clerk to Justice Robert Braucher on the Massachusetts Supreme Judicial Court. Between 1979 and 1984, she was an associate at Palmer & Dodge in Boston, where she practiced primarily in the area of tax-exempt financing. She joined the faculty of Boston College Law School in 1985, and currently is an Associate Professor of Legal Reasoning, Research & Writing. In addition to teaching in the first-year LRR&W course, Professor Blum for several years taught an upper-level seminar in Legal Drafting and has consulted with Boston law firms on legal writing issues."},
{"DisplayName":"Cheryl S. Bratt","area1":"","area2":"Family & Estate Law","area3":"Experiential; Ethics & Professional Responsibility","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/cheryl-bratt.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Bratt_335x400.jpg","SortName":"Bratt, Cheryl S.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Before joining the Boston College Law School faculty, Cheryl Bratt worked at Harvard Law School as a Lecturer on Law and the Assistant Director of Harvard's Child Advocacy Program. Previously, she was a fellow at the University of Michigan Law School’s Pediatric Advocacy Clinic, where she taught courses and supervised students litigating family, special education, and domestic violence cases.  Before entering academia, she was a litigation senior associate at WilmerHale LLP in Boston, Massachusetts where she represented parties at the trial, appellate, and U.S. Supreme Court level in securities actions and pro bono education and family law matters. She clerked for the Honorable Norman H. Stahl on the U.S. Court of Appeals for the First Circuit and for the Honorable Mary A. McLaughlin on the U.S. District Court for the Eastern District of Pennsylvania. She is admitted to practice in Massachusetts and Michigan. Professor Bratt graduated with high distinction from the University of Michigan in 2001 and magna cum laude from the University of Michigan Law School in 2008. Before law school, she taught eighth grade language arts in New Orleans, Louisiana, through Teach For America and later worked for the organization as a regional director.  She was also a paralegal for the Legal Advisor to the Government of Eritrea."},
{"DisplayName":"Mark S. Brodin","area1":"Civil Litigation & Procedure","area2":"Criminal Law & Procedure","area3":"Labor & Employment Law; Civil & Human Rights Law;","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mark-brodin.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Brodin_335x400.jpg","SortName":"Brodin, Mark S.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Mark S. Brodin is Professor of Law, Michael and Helen Lee Distinguished Scholar, and former Associate Dean for Academic Affairs at Boston College Law School. A graduate of Columbia College and Columbia Law School (where he served on the Law Review), Professor Brodin clerked for United States District Judge Joseph L. Tauro from 1972 to 1974. He was Staff Counsel with the Lawyers' Committee for Civil Rights Under Law of the Boston Bar Association from 1974 to 1980, representing plaintiffs in civil rights actions including DeGrace v. Rumsfeld, 614 F. 2d 796 (1st Cir. 1980); N.A.A.C.P. Boston Chapter v. Harris, 607 F. 2d 514 (1st Cir. 1979); Harris v. White, 479 F. Supp. 996 (D. Mass. 1979); Cooke v. Sarni Original Dry Cleaners, 2 M.D.L.R. 1012 (1980), aff'd 388 Mass. 611 (1983) (trial counsel). Professor Brodin has published extensively in the areas of employment discrimination, constitutional criminal procedure, evidence and litigation. He is the author of numerous law review articles and co-author of Handbook of Massachusetts Evidence (Sixth, Seventh, and Eighth Editions) with Hon. Paul J. Liacos and Michael Avery (Aspen, 2007), Criminal Procedure: Examples and Explanations (First, Second, Third, Fourth, Fifth and Sixth Editions) with Robert M. Bloom (Aspen, 2009) and Civil Procedure: Doctrine, Practice and Context (First, Second and Third Editions) (with Stephen Subrin, Martha Minow, and Thom Main) (Aspen 2008). Professor Brodin has served for brief periods as an appellate attorney with the Massachusetts Defenders Committee (now the Committee for Public Counsel) and as a special assistant district attorney with the Norfolk County District Attorney. His latest book, William P. Homans Jr.: A Life In Court, is a biography of the well-known Boston lawyer and activist. Professor Brodin was named BC Law's 2002-2003 Faculty Member of the Year by the Law Students Association. The Black Law Students Association awarded him the Ruth Arlene Howe Award in both 2005 and 2006, and the Anthony P. Farley Excellence in Training Award in 2008-2009."},
{"DisplayName":"George D. Brown","area1":"Constitutional Law","area2":"Ethics & Professional Responsibility","area3":"","acfacAreas":"Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/george-brown.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Brown_335x400.jpg","SortName":"Brown, George D.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"George Brown is the Robert Drinan, S.J., Professor of Law. Most recently he served as Interim Dean of the Law School, 2010-2011. He is a specialist in the field of federal-state relations and government ethics. In both areas he draws on his extensive experience in state government. He has served as Legislative Assistant to the Governor of Massachusetts and as Assistant Attorney General of Massachusetts. In 1994, Governor William Weld appointed him Chair of the Massachusetts State Ethics Commission. In the field of federal-state relations, Professor Brown is best known for his articles on the jurisdiction of federal courts and on the federal grant-in-aid system. He has also served as Chair of the Section on Federal Courts of the Association of American Law Schools. In the field of government ethics, Professor Brown has written several articles on recent judicial developments. His current research focuses on the role of the courts in the War on Terror."},
{"DisplayName":"R. Michael Cassidy","area1":"Criminal Law & Procedure","area2":"Civil Litigation & Procedure","area3":"Ethics & Professional Responsibility","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/michael-cassidy.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Cassidy_335x400.jpg","SortName":"Cassidy, R. Michael","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor R. Michael Cassidy teaches and writes in the areas of Criminal Law, Evidence, and Professional Responsibility. He is considered an expert on the subject of prosecutorial ethics, and provides training nationally to public sector attorneys on their responsibilities under the Rules of Professional Conduct. He is quoted frequently by the media on subjects relating to criminal law and ethics, including appearing in the New York Times, the Boston Globe, and the Boston Herald. He is the Faculty Director of the Rappaport Center for Law and Public Policy. During his extensive career as a government lawyer prior to joining the BC community, Professor Cassidy prosecuted hundreds of serious felony cases involving narcotics trafficking, organized and white collar crime, and public corruption. He has also briefed and argued numerous high-profile criminal matters before the Massachusetts Supreme Judicial Court. From 1993 to 1996, Professor Cassidy served as Chief of the Criminal Bureau in the Massachusetts Attorney General’s Office under then Attorney General Scott Harshbarger. Among his many professional and community activities, Professor Cassidy has served as a member of the Massachusetts State Ethics Commission, as Editor-in-Chief of the Massachusetts Law Review, as a member of the Governor's Commission on Corrections Reform, as a hearing officer for the Massachusetts Board of Bar Overseers, as a member of the Criminal Justice Section Council of the Boston Bar Association, as an Advisor to the National District Attorneys' Association, and as a member of the Massachusetts Judicial Nominating Commission. Professor Cassidy was recently appointed to serve a three year term on the Supreme Judicial Court's Standing Advisory Committee on the Rules of Professional Conduct. He is active in local government, youth sports and religious education in his hometown of Winchester, Massachusetts. Professor Cassidy was elected to the American Law Institute in 2012. Professor Cassidy received his B.A. degree, magna cum laude, from the University of Notre Dame, and his J.D. degree, magna cum laude, from Harvard Law School. Following law school he served as law clerk to the Honorable Edward F. Hennessey, Chief Justice of the Massachusetts Supreme Judicial Court, and then as a litigation associate at the Boston law firm of Foley, Hoag. Professor Cassidy served as Associate Dean for Academic Affairs from 2007-2010 and as Associate Dean for Administration and Finance from 1996 to 2002. He is currently serving as the faculty director of the Rappaport Center for Law and Public Policy. He has twice been awarded the Emil Slizewski prize for distinguished teaching by the graduating class at commencement."},
{"DisplayName":"Mary Ann Chirba","area1":"Health Law","area2":"Experiential","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/maryann-chirba.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Chirba_335x400.jpg","SortName":"Chirba, Mary Ann","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Mary Ann Chirba holds a bachelor's degree in biology from Colgate University and a J.D., magna cum laude, from Boston College Law School. She holds a Doctorate of Science in Health Policy and Management as well as a Master's in Public Health from the Harvard School of Public Health. She is the author, along with Alice Noble and Michael Maddigan, of Health Care Reform: Law and Practice - A Comprehensive Guide to the Affordable Care Act and its Implementing Regulations, a major new treatise published by Lexis Nexis/Matthew Bender in 2013. Since 1984, Professor Chirba has taught a variety of courses at Boston College Law School, including Legal Reasoning Research & Writing, Health Care Law and Policy I and II, Advocacy Writing, Advanced Legal Writing, and Product Liability Law. In 1999, she was appointed Assistant Professor of Legal Reasoning, Research & Writing at Boston College Law School and continues to teach a variety of health law courses. Professor Chirba currently lectures on various health law issues at Harvard Medical School, Children's Hospital of Boston, and Tufts Medical School. A former litigator, she has also been certified by the American Health Law Association as a mediator and arbitrator. In past years, Professor Chirba has been an adjunct faculty member at the Harvard School of Public Health, where she taught courses on Pharmaceutical Product Safety, “The Tobacco Wars,” Current Developments in Health Law, Managed Care Law & Regulation, and Medical Malpractice & Risk Management. Her current research interests are varied and include legal protections for disabled children, the use of law and regulation to promote medical product safety, emerging federal and international guidelines for stem cell research, and federal and state health care reform, including ERISA preemption of state efforts to regulate managed care."},
{"DisplayName":"Jeffrey M. Cohen","area1":"Criminal Law & Procedure","area2":"","area3":"Experiential","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jeffrey-cohen.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Cohen_335x400.jpg","SortName":"Cohen, Jeffrey M.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Jeffrey M. Cohen received his J.D. from Stanford Law School. He has also received a masters degree from Oxford University in Social Anthropology. He received his B.A. from the University of Pennsylvania.\n His primary research interests include criminal law and procedure, especially in the areas of corporate sentencing and punishment.  Jeffrey was an Assistant United States Attorney in the District of Massachusetts, where he prosecuted and tried numerous high-profile public corruption and government fraud cases. Before joining the U.S. Attorney's Office, he worked at the Department of Justice in Washington D.C. as an Honors Program Trial Attorney, where he litigated civil False Claims Act cases around the country. Jeffrey clerked at the United States District Court in Massachusetts for Judge Reginald C. Lindsay and at the Supreme Judicial Court of Massachusetts for Chief Justice Margaret H. Marshall. Jeffrey Prior to joining BC, Jeffrey was a Acting Assistant Professor at New York University School of Law.  Before NYU, he was a Visiting Assistant Professor at Boston University School of Law, where he taught courses in white collar crime and criminal trial practice."},
{"DisplayName":"Daniel R. Coquillette","area1":"Legal History & Jurisprudence","area2":"Ethics & Professional Responsibility","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-coquillette.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Coquillette_335x400.jpg","SortName":"Coquillette, Daniel R.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"The author of Lawyers and Fundamental Moral Responsibility, The Anglo-American Legal Heritage, Francis Bacon, and The Civilian Jurists of Doctor's Commons and editor of Law in Colonial Massachusetts and Moore's Federal Practice, J. Donald Monan Professor of Law Daniel R. Coquillette teaches and writes in the areas of legal history and professional responsibility. Professor Coquillette was a law clerk for justice Robert Braucher of the Supreme Judicial Court of Massachusetts and Chief Justice Warren E. Burger of the Supreme Court of the United States. He taught legal ethics on the faculty of the Boston University Law School, taught as a Visiting Professor at Cornell Law School and Harvard Law School, and became a partner for six years at the Boston law firm of Palmer & Dodge, where he specialized in complex litigation. He served as Dean of Boston College Law School from 1985-1993, and was named J. Donald Monan, S.J. University Professor in 1996. Among his many activities, Professor Coquillette is an Advisor to the American Law Institute's Restatement on Law Governing the Legal Profession, a member of the Harvard University Overseers' Committee to Visit Harvard Law School, and Reporter to the Committee on Rules of Practice and Procedure, Judicial Conference of the United States. For five years, he was Chairman of the Massachusetts Bar Association Committee on Professional Ethics and Chairman of the Task Force on Unauthorized Practice of Law. He also served on the American Bar Association Committee on Ethics and Professional Responsibility, the Board of the American Society of Legal History, the Massachusetts Task Force on Model Rules of Professional Conduct and the Massachusetts Task Force on Professionalism. He was also a member of the Special Committee on Model Rules of Attorney Conduct of the Supreme Judicial Court of Massachusetts."},
{"DisplayName":"Daniel Farbman","area1":"Legal History & Jurisprudence","area2":"Civil & Human Rights Law","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/dan-farbman.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/farbman-335x400.jpg","SortName":"Farbman, Daniel","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Dan Farbman joined the Boston College Law faculty as an Assistant Professor of Law in 2017. He teaches and writes in the areas of local government law, legal history, constitutional law, the legal profession, civil rights, and property. His work focuses on the legal history of radical reform movements in public law both from an institutional perspective and from the perspective of the practice of cause lawyering. After he graduated from Amherst College in 2001, Dan spent a few years in New York City trying (and failing) to make it as a professional actor before he enrolled at Harvard Law School. After graduating in 2007, he was a clerk for Judge Margaret Morrow on the Central District of California in Los Angeles before beginning a Skadden Fellowship at Advancement Project in Washington, D.C. At Advancement Project he worked with community organizers around the country on grassroots efforts to fight racial injustice in public education with a particular focus on the school to prison pipeline. After leaving practice, Dan pursued a Ph.D. in American Studies at Harvard. For three years prior to joining Boston College, he was a Climenko Fellow and Lecturer on Law at Harvard Law School. While at Harvard, Dan taught Legal Research and Writing and a seminar on Legal Realism."},
{"DisplayName":"Scott T. FitzGibbon","area1":"Legal History & Jurisprudence","area2":"Corporate & Securities Law","area3":"Business Law","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/scott-fitzgibbon.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/FitzGibbon_335x400.jpg","SortName":"FitzGibbon, Scott T.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Scott FitzGibbon is a graduate of the Harvard Law School where he was an Articles Officer of the Harvard Law Review, and of Oxford University where he studied legal philosophy. He teaches Jurisprudence, Corporations, Securities Regulation, and Contracts and has taught courses in the Law and Theory of Marriage, Equity, and Professional Responsibility. Professor FitzGibbon is the co-editor of The Jurisprudence of Marriage and Other Intimate Relationships and co-author of Glazer and FitzGibbon on Legal Opinions: Drafting, Interpreting and Supporting Closing Opinions in Business Transactions, and of numerous articles on legal philosophy, the family, and business law including the 'The Failure of the Freedom-Based and Utilitarian Justifications for Assisted Suicide,' in the American Journal of Jurisprudence. He is a member of the American Law Institute, the International Society of Family Law, and the Fellowship of Catholic Scholars. Professor FitzGibbon is the Editor in Chief of the International Journal of the Jurisprudence of the Family and Senior Vice President of the International Academy for the Study of the Jurisprudence of the Family."},
{"DisplayName":"Frank J. Garcia","area1":"International & Comparative Law","area2":"Business Law","area3":"Legal History & Jurisprudence; Civil & Human Rights Law;","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/frank-garcia.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Garcia_335x400.jpg","SortName":"Garcia, Frank J.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Frank J. Garcia joined the BC Law faculty in 2001. He had been an associate professor at the Florida State University College of Law since 1993. He has served as a Visiting Professor at a number of schools around the world including the University of Paris, the University of New South Wales in Sydney, the University of the Republic in Uruguay, the University of Houston Law Center, and as the Katherine A. Ryan Distinguished Visiting Professor at the St. Mary's University School of Law/University of Innsbruck, Austria. Professor Garcia received his B.A. in Religious Studies from Reed College in 1985, and his J.D. from the University of Michigan Law School in 1989. He was a law clerk for Andrews & Kurth in Texas and Davis Wright Tremaine in Oregon , and an associate in the Oregon firm Stoel Rives Boley Jones & Grey from 1990-1993. Professor Garcia was a Fulbright Scholar, as well as a professorial fellow at the Law Institute of the Americas, SMU School of Law, and the Associate Director of the Caribbean Law Institute, FSU College of Law. He has served on the Executive Board and as Vice-Chair of the ASIL International Economic Law and International Legal Theory Interest Groups, and on the Board of the Law School Admissions Council. He currently serves as book review editor and board member of the Journal of International Economic Law, and advises the BC International & Comparative Law Review."},
{"DisplayName":"Jane Kent Gionfriddo","area1":"Experiential","area2":"Legal Research","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/janekent-gionfriddo.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Gionfriddo_335x400.jpg","SortName":"Gionfriddo, Jane Kent","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Jane Kent Gionfriddo began teaching in the Legal Reasoning, Research & Writing Program at Boston College Law School in 1982 and was admitted to practice in Massachusetts the same year. In 1985, she became the director of the program and held this position for twenty-two years. In May 1999, Professor Gionfriddo was awarded the Boston College Distinguished Teaching Award for 1999-2000. She was promoted to Professor of Legal Reasoning, Research & Writing in 2012. Professor Gionfriddo has held a variety of positions with the Legal Writing Institute (http://www.lwionline.org), an organization devoted to the pedagogy and scholarship of legal analysis and writing and whose almost 2000 members come from law schools and English departments in the United States as well as from foreign countries. She served as a member of the Board of Directors for the Institute from 1995 to 2004, and served as President from 2000 through 2002 (http://www.lwionline.org/past_presidents.html). From 1994 to 2000, she also co-edited, with several LRR&W colleagues from the Law School, the Institute’s semi-annual newsletter, “The Second Draft.” Professor Gionfriddo has co-chaired many committees for the Legal Writing Institute, including the Election Committee that ran the most recent Board of Directors election and the Monograph Committee that brought forward a proposal for a monograph series to the Board of Directors. Accepting the committee’s proposal, the LWI Board appointed Professor Gionfriddo as the first Editor-in-Chief of the new Monograph Series. This series includes electronic volumes published on the Institute's web site, each one of which will be devoted to a topic relevant to teaching legal analysis and writing. In August 2009, the first volume devoted to 'The Art of Critiquing Written Work' was posted to the web site at http://www.lwionline.org/monograph.html. From 2008 to 2010, Professor Gionfriddo also served on the Board of Editors of the Journal of the Legal Writing Institute, which publishes articles on legal analysis and writing issues. Professor Gionfriddo has worked as a consultant at major Boston law firms, giving presentations to and working individually with associates, and has also been a consultant at other law schools on curricular issues, including Harvard Law School. In addition, Professor Gionfriddo has presented widely, including multiple times at the Legal Writing Institute Conference, at the Association of Legal Writing Directors Conference, at the American Association of Law Schools Annual Conference, and at the American Association of Law Libraries Annual Meeting and Conference. A co-founder of the New England Consortium of Legal Writing Teachers, a regional organization that seeks to promote excellence in teaching, Professor Gionfriddo organized an interactive workshop on analytical feedback on student writing. Professor Gionfriddo’s scholarship focuses on pedagogical issues concerning legal analysis and writing, including an article published in the Texas Tech Law Review on the importance of lawyers’ synthesizing cases in a sophisticated manner. This article was chosen as a lead article and awarded a Texas Tech Law Review outstanding lead article award. As a member of the American Bar Association Subcommittee on Communication Skills, Professor Gionfriddo worked as a contributing author on the second edition of the Sourcebook on Legal Writing Programs, which discusses “best practices” in the field of legal analysis, writing and research. Most recently, she and her co-author Daniel Barnett published a first-year legal analysis and writing textbook, which is titled “Legal Reasoning and Objective Writing: A Comprehensive Approach.”"},
{"DisplayName":"Kent Greenfield","area1":"Constitutional Law","area2":"Business Law","area3":"Corporate & Securities Law; Civil Litigation & Procedure;","acfacAreas":"Business Law; Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kent-greenfield.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Greenfield_335x400.jpg","SortName":"Greenfield, Kent","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Kent Greenfield is Professor of Law and Law Fund Research Scholar at Boston College Law School, where he teaches and writes in the areas of business law, constitutional law, decision making theory, legal theory, and economic analysis of law. He is the past Chair of the Section on Business Associations of the American Association of Law Schools. In addition, he is the author of the book The Myth of Choice, published in 2011 from Yale University Press, Prunsoop Publishing (in Korean), and BiteBack Publishing (UK). Kirkus Reviews stated in its review: “The author deftly debunks prevailing dogma about the infallibility of free markets, especially important during a time when, as he reports, one in seven Americans are poor.' He is also the author of the book “The Failure of Corporate Law” published by University of Chicago Press. The book has been called “simply the best and most well-reasoned progressive critique of corporate law yet written,” and the Law and Politics Book Review said that “it merits a place alongside Berle and Means, [and] Easterbrook and Fischel.” Greenfield also has had journal articles published in the Yale Law Journal, the Virginia Law Review, the Boston College Law Review, the George Washington Law Review, and Constitutional Commentary, among others. His articles are widely cited, and he has been called “the leading figure” and “the most creative thinker” in the progressive, stakeholder school of corporate law scholarship. Greenfield has lectured in 36 states, 9 countries, and at over 100 institutions (including Harvard, Yale, Brown, Stanford, the University of Chicago, the University of Michigan, and the London School of Economics). His opinion essays have appeared in the New York Times, the Washington Post, the Boston Globe, the Atlantic, the Washington Monthly, the American Prospect, Salon, and the Nation. Greenfield consults with litigators on issues of corporate accountability. He was instrumental in developing the theory of the cases brought against Unocal Corporation for alleged human rights violations committed by the company in Burma and against Hershey Corporation for the alleged use of child labor in West Africa. Greenfield has received teaching awards from the law school's Black Law Student Society, the Lambda Law Students’ Association, and the Business Law Society. He was also named B.C. Law Teacher of the Year for 2003-04, a recognition bestowed by the Law Students Association on vote of the entire student body. He was also awarded the Emil Slizewski Award for outstanding teaching, given by the graduating class of 2004. He also received the Kevin Larkin Memorial Award for Public Service from the Massachusetts Lesbian and Gay Bar Association in 2005. Greenfield has been a Law Fund Research Scholar, a recognition of his scholarly contributions, since 2003. He has taught at the University of Sydney, the University of Connecticut School of Law, and the University of Hawaii School of Law, and at Brown University in the political science department. He was the founder and president of the Forum for Academic and Institutional Rights (FAIR), an association of three dozen law schools and other academic institutions organized to fight for academic freedom and against discrimination. in 2003, FAIR brought suit against Donald Rumsfeld and others to contest the Solomon Amendment, which forced universities to assist military recruiters. The Supreme Court decided the case against FAIR on March 6, 2006. Greenfield’s work with FAIR was featured in numerous newspapers and media outlets, including the New York Times, the Wall Street Journal, the Boston Globe, the Chronicle of Higher Education, ABC News, CBS News, CNN, Fox News, MSNBC, CNBC, and NPR. Greenfield is a graduate of the University of Chicago Law School, where he graduated with honors and was awarded membership into the honorary society Order of the Coif. He also served as Topics and Comments Editor of the University of Chicago Law Review. He received an A.B., with highest honors, from Brown University, where he studied economics and history. Before law school, he traveled extensively in South America and Africa."},
{"DisplayName":"Dean M. Hashimoto","area1":"Health Law","area2":"Civil Litigation & Procedure","area3":"Experiential; Business Law; Environmental Law","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/dean-hashimoto.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Hashimoto_335x400.jpg","SortName":"Hashimoto, Dean M.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"The scholarship of Dean Hashimoto focuses on the interface of law, science and medicine, especially in the areas of health care policy and the role of scientific evidence in the courtroom. Educated as both an attorney and physician, he teaches torts, environmental litigation, health care law, and evidence. He has also studied the internment of citizens and aliens of Japanese heritage in World War II and written about the constitutional law cases decided in that era. Professor Hashimoto is the faculty director for the Boston College Law School's JD/MPH dual degree program with Tufts School of Medicine. Professor Hashimoto served as a Notes Editor on the Yale Law Journal and, after graduating from law school, as a law clerk to Justice William Brennan of the U.S. Supreme Court and Judge David Bazelon of the U.S. Court of Appeals in Washington, D.C. He also practiced as a litigator for the Williams & Connolly law firm in Washington, D.C. and as a health care attorney for Ropes & Gray in Boston before joining the Boston College faculty. Professor Hashimoto received his postgraduate medical training at the Brigham and Women's Hospital and the Harvard School of Public Health. He is a board-certified specialist in occupational and environmental medicine and serves as the chief of this specialty at the Massachusetts General Hospital and the Brigham and Women's Hospital."},
{"DisplayName":"Frank R. Herrmann, S.J.","area1":"Criminal Law & Procedure","area2":"Ethics & Professional Responsibility","area3":"Experiential","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/frank-herrmann.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Herrmann_335x400.jpg","SortName":"Herrmann, Frank R., S.J.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Before joining the faculty in 1991, Associate Professor Frank R. Herrmann, S.J., spent more than ten years as a criminal defense lawyer involved in both trial and appellate cases. He teaches Evidence, Advanced Criminal Procedure, Criminal Process, and Introduction to Lawyering and Professional Responsibility. He holds an A.B. from Fordham University, an M.Div. from Woodstock College and a J.D. from Boston College."},
{"DisplayName":"Ingrid Michelsen Hillinger","area1":"Business Law","area2":"Real Estate Law","area3":"","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ingrid-hillinger.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Hillinger_335x400.jpg","SortName":"Hillinger, Ingrid Michelsen","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Ingrid Michelsen Hillinger is a professor of law at Boston College Law School where she teaches a variety of commercial law/bankruptcy courses including Business Bankruptcy, Contracts, and Secured Transactions. She was named one of the 26 'best law teachers' in the country by the authors of What the Best Law Teachers Do (Harvard University Press, 2013), and was the 2002 winner of the Boston College Distinguished Teaching Award. She is a co-editor of Chapter 11 Theory & Practice: A Guide to Reorganization, a multi-volume bankruptcy treatise. She is co-author of an Article 9 case book, Commercial Transactions: Secured Financing: Cases, Materials & Problems, which adopts a problem-solving approach to teaching transactional law. Professor Hillinger has taught at a variety of schools during her 36-year teaching career - William & Mary, the University of Texas at Austin, Emory University, Northeastern University School of Law and the University of Connecticut School of Law. While at William & Mary, she received an Outstanding Teacher Award from the Virginia Council on Higher Education."},
{"DisplayName":"Mary Holper","area1":"Experiential","area2":"Immigration Law","area3":"Civil & Human Rights Law","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mary-holper.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Holper_335x400.jpg","SortName":"Holper, Mary","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Mary Holper is an Associate Clinical Professor and Director of the Immigration Clinic at Boston College Law School. Prior to joining the BCLS faculty, Professor Holper was an Associate Professor of Law at Roger Williams University School of Law in Rhode Island, where she founded and directed the Roger Williams University School of Law Immigration Clinic. Professor Holper previously worked at BCLS supervising students in the school’s immigration clinics. From 2008-2009, she was a Visiting Assistant Professor at BCLS. She also was a detention fellow for the Catholic Legal Immigration Network, Inc. (CLINIC) at the Boston College Immigration and Asylum Project at BCLS from 2005-07, and a Human Rights Fellow for the Boston College Center for Human Rights and International Justice from 2007-08. She began her career as an Equal Justice Works Fellow at the Capital Area Immigrants' Rights (CAIR) Coalition in Washington, D.C. Throughout her career, she has represented immigration detainees who face removal and has participated in impact litigation challenging the overuse of mandatory detention and indefinite detention and the classification of certain crimes as “aggravated felonies” in immigration law. In addition, Professor Holper has represented other vulnerable noncitizen populations such as refugees, juveniles, victims of domestic violence, and victims of violent crime. Professor Holper has spoken on numerous panels about immigration issues, particularly on the intersection of immigration law and crimes and removal proceedings. She also has written and co-authored articles for various handbooks, reference guides, and law reviews regarding immigration issues."},
{"DisplayName":"Kari E. Hong","area1":"Immigration Law","area2":"Family & Estate Law","area3":"Criminal Law & Procedure; Civil & Human Rights Law;","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kari-hong.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Hong_335x400.jpg","SortName":"Hong, Kari E.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Kari Hong is an assistant professor of law at Boston College Law School. An expert in immigration law, criminal law, and family law, Professor Hong’s scholarship focuses on the immigration consequences of criminal convictions, the intersection of family law and immigration law, and contemporary matters in criminal law. Her articles have been published in the Georgetown Immigration Law Journal, the Columbia Journal of Gender and Law, and the University of Virginia Law Review. The New Jersey Supreme Court has cited her work. She has served as a commentator on television, radio, and in print. In addition, she founded and runs the BC Ninth Circuit Appellate Program, which provides pro bono representation to non-citizens with criminal convictions. A central criticism of immigration law is that it treats hundreds of crimes the same, failing to take into account that state and federal judges consider specific offenses not serious or deserving of probation instead of incarceration. The clinic’s mission is to use federal court advocacy to restore proportionality and common sense into the immigration consequences of criminal convictions. Notable decisions include Lopez-Valencia v. Lynch, 798 F.3d 863 (9th Cir. 2015) (holding Cal. Pen. Code § 484(a) overbroad and indivisible) (Kelly Schwartz ’15 and Jeremy Sanders ’15) and Vera-Valdevinos v. Lynch, No. 14-73861, (9th Cir. 2016) (holding that Ariz. Rev. Stat. 13-3408 is overbroad and indivisible as an aggravated felony and deportability ground) (Jovalin Dedaj ’16 and Cristina Manzano ‘16). Prior to joining the faculty, Professor Hong owned her own firm with offices in California and Oregon. In private practice, Professor Hong prepared nearly 100 actions in the Ninth Circuit Court of Appeals, representing non-citizens in asylum, removal defense, and citizenship claims and criminal defendants accused of white collar crimes, violent felonies, and drug-related offenses. In the California courts, she prepared nearly 50 state criminal appeals, which included clients who had been convicted of serious felonies and those on death row. Among her published decisions, Professor Hong prevailed in Ridore v. Holder, 696 F.3d 907 (9th Cir. 2012), which established that BIA must apply its clear error standard to review factual findings, that Matter of J-E- may be rebutted with contemporary evidence, and that government acquiescence may be inferred when a foreign government has a policy to subject U.S. criminal deportees to indefinite detention in deplorable prison conditions. Moreover, she prevailed in Tyson v. Holder, 670 F.3d. 1015 (9th Cir. 2012), which held that the protections of INS v. St. Cyr, 533 U.S. 289 (2001) are not limited to the plea context and may be available to non-citizens who were tried by stipulated facts. Before entering private practice, she clerked for the Honorable Jeremy Fogel, U.S. District Court of the Northern District of California and the Honorable Sidney Thomas, Ninth Circuit Court of Appeals."},
{"DisplayName":"Renee Jones","area1":"Corporate & Securities Law","area2":"Business Law","area3":"Administrative & Government Law","acfacAreas":"Administrative & Government Law; Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/renee-jones.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Jones_335x400.jpg","SortName":"Jones, Renee","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Renee Jones teaches and writes in the areas of corporate and securities law. Her courses at BC Law include Corporations, Securities Regulation, Corporate Governance and a Financial Regulation Seminar. She received her AB from Princeton University’s Woodrow Wilson School of Public and International Affairs and her J.D. (cum laude) from Harvard Law School. In 2005-2006, she was the Eugene P. Beard Faculty Fellow in Ethics at Harvard University’s Edmund J. Safra Foundation Center for Ethics. Professor Jones is a member of the American Law Institute and a Fellow of the American Bar Foundation. She has also served as the Co-Chair of the Securities Law Committee of the Boston Bar Association. She received the Faculty Award for Inspirational Achievement from the Boston College Law Business & Law Society in 2010. Professor Jones’s scholarship focuses on corporate governance and the federal-state relationship in corporate regulation. She also writes about the impact of enforcement practices on corporate ethics and integrity. Her most recent article, Toward a Public Enforcement Model for Directors’ Oversight Duties (with Michelle Welsh) (Vanderbilt Journal of Transnational Law) draws lessons from the Australian model of corporate law enforcement. It recommends implementation of a system of public enforcement for fiduciary duties of corporate directors in the United States. Professor Jones has also written several articles on corporate federalism. Her article 'Rethinking Corporate Federalism in the Era of Corporate Reform' (Iowa Journal of Corporate Law) was reprinted in Corporate Practice Commentator as one of the top corporate law articles of the year. Professor Jones is a frequent commentator on corporate law, securities law and the recent financial crisis. She has appeared at conferences at law schools across the country to address corporate and securities law issues. Professor Jones has been selected to present her work at the Annual Meeting of the American Association of Law Schools in 2004, 2007 and 2010. Among her many professional and community activities, Professor Jones has served as Co-Chair of the Securities Law Committee of the Boston Bar Association. She has also served as a member of the American Bar Association House of Delegates, the editorial board of Human Rights Magazine, and the New England Committee of the NAACP Legal Defense Fund. Before joining BC Law in 2002, Professor Jones practiced for eight years at the Boston law firm Hill & Barlow where she represented private and public companies on corporate and securities matters."},
{"DisplayName":"Gregory A. Kalscheur, S.J.","area1":"Legal History & Jurisprudence","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/gregory-kalscheur.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Kalscheur_335x400.jpg","SortName":"Kalscheur, Gregory A.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Father Kalscheur joined the BC Law faculty in 2003. He received his A.B. in 1985 from Georgetown University, and his J.D. in 1988 from the University of Michigan, where he served on the editorial board of the Michigan Law Review. After law school, he clerked for Judge Kenneth F. Ripple, U.S. Court of Appeals for the Seventh Circuit, and worked as a litigator at Hogan & Hartson in Washington, D.C. After entering the Society of Jesus in 1992, Father Kalscheur served as Adjunct Professor of Political Science and Assistant to the Director of the Center for Values and Service at Loyola College in Maryland (1996-98) and as Associate Pastor at St. Raphael the Archangel Church in Raleigh, N.C. (2001-02). Interdisciplinary dialogue in a setting where faith, intellect, and culture meet is an integral component of Jesuit education, and Father Kalscheur hopes to contribute to that project at BC Law. Jesuit legal education should be an essentially humanistic process of formation for responsible professional service, striving to connect legal inquiry to larger questions of meaning and value, exploring the nature of law as a vocation, and asking how faith and religious values can be integrated with public and professional life. Father Kalscheur’s primary teaching and research interests include law and religion, constitutional law, civil procedure, Catholic social thought and the law, and the contributions of Ignatian spirituality to the character of legal education at a Jesuit law school."},
{"DisplayName":"Daniel Kanstroom","area1":"Immigration Law; Administrative & Government Law","area2":"International & Comparative Law","area3":"Civil & Human Rights Law","acfacAreas":"Administrative & Government Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-kanstroom.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Kanstroom_335x400.jpg","SortName":"Kanstroom, Daniel","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Daniel Kanstroom is Professor of Law, Thomas F. Carney Distinguished Scholar, Director of the International Human Rights Program, and an Associate Director of the Boston College Center for Human Rights and International Justice. He teaches Immigration and Refugee Law, International Human Rights Law, Constitutional Law, Administrative Law, and the International Human Rights Semester in Practice. Professor Kanstroom was the founder of the Boston College Immigration and Asylum clinic in which students represent indigent noncitizens and asylum-seekers. Together with his students, he has won many high-profile immigration and asylum cases and has provided counsel for hundreds of clients over more than a decade. He and his students have also written amicus briefs for the U.S. Supreme Court, organized innumerable public presentations in schools, churches, community centers, courts and prisons, and have advised many community groups. He was a co-founder of the Immigration Spring Break Trips, where students work on immigration law cases during their Spring Break. Professor Kanstroom’s newest initiative, the Post-Deportation Human Rights Project, seeks to conceptualize and develop a new field of law while representing US deportees abroad and undertaking empirical study of the effects of deportation on families and communities. Professor Kanstroom has published widely in the fields of U.S. immigration law, criminal law, and European citizenship and asylum law. His most recent books are: Aftermath: Deportation Law and the New American Diaspora, (Oxford University Press 2012); and Deportation Nation: Outsiders in American History (Harvard University Press 2007). He is also a co-editor of: The New Deportations Delirium (editor, with M. Brinton Lykes); Constructing “Illegality”: Immigrant Experiences, Critiques, and Resistance, (editor, with Cecilia Menjívar) (Cambridge University Press 2013). His articles and short pieces have appeared in such venues as the Harvard Law Review, Yale Journal of International Law, UCLA Law Review, NYU Journal of International Law and Politics, Georgetown Immigration Law Journal, The New York Times, Journal of Social History, and the French Gazette du Palais. Professor Kanstroom has served on the American Bar Association's Immigration Commission and the Advisory Board of the PAIR Project. He was rapporteur for the American Branch of the Refugee Law Section of the International Law Association. He has been a visiting Professor at the University of Paris, the University of Boulogne sur Mer, Northeastern School of Law, American University, King’s College, London, and Vermont Law School."},
{"DisplayName":"M. Cathleen Kaveny","area1":"Legal History & Jurisprudence","area2":"Constitutional Law","area3":"","acfacAreas":"Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/cathleen-kaveny.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Kaveny_335x400.jpg","SortName":"Kaveny, M. Cathleen","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Cathleen Kaveny, a scholar who focuses on the relationship of law, religion, and morality, joined the Boston College faculty in January 2014 as the Darald and Juliet Libby Professor, a position that includes appointments in both the department of theology and the law school. A member of the Massachusetts Bar since 1993, Professor Kaveny clerked for the Honorable John T. Noonan Jr. of the U.S. Court of Appeals for the Ninth Circuit and worked as an associate at the Boston law firm of Ropes & Gray in its health-law group The first faculty member to hold such a joint appointment, Professor Kaveny teaches in both the Theology Department and the Law School at Boston College. Professor Kaveny has published over a hundred articles and essays, in journals and books specializing in law, ethics, and medical ethics. She serves on the masthead of Commonweal as a regular columnist. Her book, Law’s Virtues: Fostering Autonomy and Solidarity in American Society, was published by Georgetown University Press in 2012. It won a first place award in the category of “Faithful Citizenship” from the Catholic Press Association. She is currently completing a book entitled Prophecy without Contempt: An Ethics of Religious Rhetoric in the Public Square. Professor Kaveny regularly teaches contract law to first-year law students. She also teaches a number of seminars which explore the relationship between theology, philosophy, and law, such as “Faith, Morality, and Law,” “Mercy and Justice,” and “Complicity.” Professor Kaveny is the president of the Society of Christian Ethics, the major professional society for scholars of Christian ethics and moral theology in North America. It meets annually in conjunction with the Society of Jewish Ethics and the Society for the Study of Muslim Ethics. Professor Kaveny has served on a number of editorial boards including The American Journal of Jurisprudence, The Journal of Religious Ethics, the Journal of Law and Religion, and The Journal of the Society of Christian Ethics. She has been a visiting professor at Princeton University, Yale University and Georgetown University, and a visiting scholar at the University of Chicago’s Martin Marty Center. From 1995 until 2013 she taught law and theology at the University of Notre Dame, where she was a John P. Murphy Foundation Professor of Law."},
{"DisplayName":"Elisabeth Keller","area1":"Experiential","area2":"Legal Research","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/elisabeth-keller.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Keller_335x400.jpg","SortName":"Keller, Elisabeth","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Elisabeth Keller received her B.A. degree magna cum laude from Brandeis University in 1981 where she was elected to Phi Beta Kappa. In 1988, she graduated from Ohio State University with a M.A. in Higher Education and a J.D. summa cum laude where she was a member of the Law Review and Order of the Coif. She began teaching at Western New England College School of Law the following year. She joined the faculty of Boston College Law School in 1990. She is currently an Associate Professor of Legal Reasoning, Research, and Writing and the Director of the Academic Support Program. She also serves as the Law School Coordinator of the Education and Law Dual Degree program which is a joint program of the Law School and the Lynch School of Education. She has served as co-editor of The Second Draft, the semi-annual newsletter of The Legal Writing Institute."},
{"DisplayName":"Thomas C. Kohler","area1":"Legal History & Jurisprudence","area2":"Labor & Employment Law","area3":"Business Law","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-kohler.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Kohler_335x400.jpg","SortName":"Kohler, Thomas C.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Thomas C. Kohler is the Concurrent Professor of Law and Philosophy. Professor Kohler is an internationally recognized authority on the labor and employment law of the United States and other western nations, with a special emphasis on German law. He has served as a Fulbright Professor on the Law Faculty of the Johann Wolfgang Goethe Universität (Frankfurt am Main), and has taught at the University of Texas School of Law and Columbia University’s Graduate School of Business. Among other honors, he has been a Fellow of the German Marshall Fund and a Lynde and Harry Bradley Foundation Research Fellow. He has served as a member of the Advisory Board for the E.U.-sponsored European Labour Law Network (ELLN), a Consultant to the Industrial Relations section of the Department of Sociology of the University of Warsaw, a member of the International Board for the National College of Ireland, and as a Scientific Expert to the Pontifical Academy of Social Sciences at the Vatican. He also has acted as a consultant to governments, NGOs and other international organizations on labor and employment law and policy matters. Prof. Kohler has lectured and published widely in the United States, Europe and Japan. In addition to an extensive body of publications on labor and employment law issues, and in comparative law, he has written on personhood, mediating institutions and other issues in social and political theory, as well as on issues in Catholic social thought. He is only the second American to have been invited to present both the annual Hugo Sinzheimer Memorial Lecture (Univ. of Frankfurt Faculty of Law) and the Japan International Labor Law Foundation Distinguished Lectures (University of Tokyo Faculty of Law). And he has twice been invited to address the biennial meeting of the Deutscher Juristentag (the Association of German Jurists). Prof. Kohler serves on the Editorial Advisory Board of the Comparative Labor Law & Policy Journal; the American Journal of Comparative Law, and as an International Advisor to and a member of the Scientific Committee of IUSLabor, a journal sponsored by the Law Faculty of the Universitat Pompeu Fabra (Barcelona). He also serves on the National Executive Board of the International Society for Labor Law and Social Security. Recent activities include: lectures in the series, Göttingen Lectures in Foreign and International Labor Law (Law Faculty of the University of Göttingen); at the Law Faculty of the University of Jena; and at the Hugo Sinzheimer Institut in Frankfurt. Recent articles include Comparative Law in a Time of Globalization: Some Reflections, 52 Duquesne L. Rev. (forthcoming, 2014); Konrad Adenauer’s Christian Vision, First Things (tracing the roots of the German social market ideas) (forthcoming, 2014), and Neutralität des Arbeitgebers im US-amerikanischem Arbeitsrecht?, in Arbeit und Recht., 60.4. Prof. Kohler is currently working on a book entitled, Solidarity Forever: the Story and Significance of an Idea (forthcoming, Yale University Press). Prof. Kohler is a member of the American Law Institute, a Fellow of the American Bar Foundation, and a member of the Association of German Jurists (Deutscher Juristentag)."},
{"DisplayName":"Joseph P. Liu","area1":"Intellectual Property & Technology Law","area2":"Business Law","area3":"","acfacAreas":"Business Law; Intellectual Property & Technology Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-liu.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Liu_335x400.jpg","SortName":"Liu, Joseph P.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Joseph P. Liu is a Professor of Law at Boston College Law School, where he writes and teaches in the areas of copyright, trademark, property, and internet law. His main area of academic research is on the impact of digital technology on copyright law and markets, with a particular focus on how digital technology is changing the way individuals interact with copyrighted works. Professor Liu has published extensively on copyright law issues in many law journals, including the Michigan Law Review, North Carolina Law Review, Boston College Law Review, and Indiana Law Journal. He has lectured extensively in the U.S. and in Asia, at institutions such as Harvard, Columbia, U.C. Berkeley, Georgetown, M.I.T., and Tsinghua University in Beijing. He is the co-author (with Professor Alfred Yen) of the casebook, Copyright Law: Essential Cases and Materials (West 2008). Prior to joining the Boston College Law School faculty in 2001, Professor Liu was an Assistant Professor at U.C. Hastings College of Law (2000-01) and a Climenko Teaching Fellow at Harvard Law School (1997-98). Professor Liu previously practiced in Boston at Foley Hoag & Eliot, where he specialized in intellectual property litigation, securities litigation, and white collar criminal defense. He also served for several years as Vice President and General Counsel to BuyerZone.com, a venture-backed, business-to-business internet start-up company. He has consulted on a number of cases involving copyright law and digital technology. Professor Liu clerked for the Honorable Levin H. Campbell of the U.S. Court of Appeals for the First Circuit (1994-95). He received his B.A. in Physics and Philosophy in 1989 from Yale University, and his J.D. in 1994 from Columbia Law School, where he was Editor-in-Chief of the Columbia Law Review. He also earned an L.L.M. from Harvard University in 1999."},
{"DisplayName":"Daniel A. Lyons","area1":"Intellectual Property & Technology Law","area2":"Administrative & Government Law","area3":"Experiential; Constitutional Law; Business Law;","acfacAreas":"Administrative & Government Law; Business Law; Constitutional Law; Intellectual Property & Technology Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-lyons.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Lyons_335x400.jpg","SortName":"Lyons, Daniel A.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Lyons is an associate professor at Boston College Law School. He specializes in the areas of property, telecommunications and administrative law. Before joining the faculty, Professor Lyons practiced energy, telecommunications, and administrative law at the firm of Munger, Tolles and Olson in Los Angeles. He also clerked for the Judge Cynthia Holcomb Hall of the Ninth Circuit Court of Appeals. Professor Lyons has participated in rulemaking proceedings before both the Federal Communications Commission and the California Public Utilities Commission and has represented clients in federal and state litigation involving numerous regulatory issues. He has also spoken at workshops nationwide on the effects of technology convergence on telecommunications regulation."},
{"DisplayName":"Ray D. Madoff","area1":"Tax Law","area2":"Property","area3":"Trusts and Estates; Business Law;","acfacAreas":"Business Law; Tax Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ray-madoff.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Madoff_335x400.jpg","SortName":"Madoff, Ray D.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Ray Madoff is a Professor at Boston College Law School where she teaches and writes in the areas of philanthropy policy, taxes, property and estate planning. Professor Madoff is the Co-founder and Director of the Boston College Law School Forum on Philanthropy and the Public Good, a non-partisan think tank that convenes scholars and practitioners to explore questions regarding whether the rules governing the charitable sector best serve the public good. Professor Madoff is the author of: Immortality and the Law: The Rising Power of the American Dead (Yale), which looks at how American law treats the interests of the dead and what this tells us about our values for the living. The Financial Times called it 'a sparkling polemic. 'Professor Madoff is also the lead author on one of the top treatises on estate planning: Practical Guide to Estate Planning (CCH) (published annually from 2001-2014) and has written numerous articles and chapters in a wide variety of areas involving property and death. Professor Madoff’s areas of expertise include philanthropy policy, the rights of the dead (including the ability of the dead to control their bodies, reputation, and property),estate taxes, comparative inheritance law, and wealth inequality and taxes. A regular commentator on a number of these topics, Professor Madoff has appeared on dozens of national radio shows including On Point, Talk of the Nation, All Things Considered, Here and Now, and Marketplace, among others. Professor Madoff is a frequent contributor to the opinion pages of the New York Times, and has also published Op-Eds in the Washington Post, the LA Times, the Boston Globe and the Chronicle of Philanthropy. Professor Madoff is an experienced mediator and leading authority on the use of mediation to resolve will and trust disputes. Prior to teaching, she was a practicing attorney for nine years in New York and Boston. Professor Madoff is a member of the American Law Institute, an Academic Fellow of the American College of Trusts and Estate Counsel and past president of the American Association of Law School’s Trusts and Estates Section. She was named a 2014 Top Women of the Law by Mass Lawyer’s Weekly."},
{"DisplayName":"Patricia A. McCoy","area1":"Business Law","area2":"Corporate & Securities Law","area3":"Administrative & Government Law","acfacAreas":"Administrative & Government Law; Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/patricia-mccoy.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/McCoy_335x400.jpg","SortName":"McCoy, Patricia A.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Patricia A. McCoy, a nationally prominent scholar in financial services regulation, is the inaugural Liberty Mutual Insurance Professor of Law. In 2010 and 2011, she joined the U.S. Department of the Treasury, where she helped form the new Consumer Financial Protection Bureau (CFPB), and, as the CFPB’s first assistant director for mortgage markets, oversaw the Bureau’s mortgage policy initiatives. She teaches insurance law as well as banking regulation and a full array of other financial services regulatory courses. After receiving her law degree from U.C. Berkeley, Professor McCoy clerked for the late Hon. Robert S. Vance on the U. S. Court of Appeals for the Eleventh Circuit and was a partner at Mayer Brown in Washington, D.C., specializing in complex securities, banking and constitutional litigation. More recently, she was the Director of the Insurance Law Center at the University of Connecticut School of Law before joining the Boston College faculty. Professor McCoy's research interests focus on the nexus between financial products, consumer welfare, and systemic risk, analyzed through the lens of law, economics, and empirical methods. In A Tale of Three Markets: The Law and Economics of Predatory Lending in the Texas Law Review in 2002, Professor McCoy was among the first to raise alarms about the dangers of subprime loans. She has three books to her credit, the most recent being The Subprime Virus with Kathleen Engel, published by Oxford University Press in 2011. The author of numerous book chapters and articles, she has testified before Congress and been quoted in the New York Times, Wall Street Journal, and The Washington Post and on National Public Radio. Previously, Professor McCoy was a Visiting Scholar at the MIT Economics Department and served on the Federal Reserve’s Consumer Advisory Council and on the board of the Insurance Marketplace Standards Association. In 2012, the American Law Institute named her as an Adviser to the Third Restatement on Consumer Contracts. She currently sits on the Advisory Committee on Economic Inclusion of the Federal Deposit Insurance Corporation."},
{"DisplayName":"Judith A. McMorrow","area1":"Civil Litigation & Procedure","area2":"Ethics & Professional Responsibility","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/judith-mcmorrow.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/McMorrow_335x400.jpg","SortName":"McMorrow, Judith A.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Judith A. McMorrow teaches torts, professional responsibility and in the law school’s Semester-in-Practice externship program. Her scholarship is primarily in the area of professional responsibility and legal ethics. Professor McMorrow is active in pro bono and service activities, including over 20 years on the board of Community Legal Services and Counseling Center, 10 years on the Massachusetts SJC Committee on Judicial Ethics, work with the ABA Center for Professional Responsibility and earlier work in representing women in Massachusetts seeking commutation based on Battered Woman Syndrome. After graduating from University of Notre Dame Law School in 1980, Prof. McMorrow clerked for the Hon. Gilbert S. Merritt (United States Court of Appeals for the Sixth Circuit) and Chief Justice Warren E. Burger (United States Supreme Court.) She practiced with the Washington D.C. law firm of Steptoe and Johnson before entering teaching in 1985. In Spring 2013, Prof. McMorrow ran the Boston College Law School London program. For the 2008-09 academic year Prof. McMorrow taught at Renmin University in Beijing, China on a Fulbright grant."},
{"DisplayName":"Alan Minuskin","area1":"Experiential","area2":"Civil Litigation & Procedure","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/alan-minuskin.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Minuskin_335x400.jpg","SortName":"Minuskin, Alan","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Alan Minuskin is an Associate Clinical Professor of Law at Boston College Law School. He teaches and supervises student attorneys in the Law School’s Civil Litigation Clinic, and Housing Law Clinic, which he directs. He also serves as Director the Boston College Legal Assistance Bureau’s Elder Legal Services Project. Prior to beginning his career as a clinical legal educator in 1979, Professor Minuskin was a legal services attorney at Central Middlesex Legal Services and, through a small community practice he founded, a co-grantee of federal legal services funding for the provision of free legal services to the poor. From 1977 to 1984, he was a part time, volunteer staff attorney at the Community Legal Services and Counseling Center (formerly Cambridgeport Problem Center) where he collaborated with mental health professionals in an interdisciplinary approach to solving the legal problems of indigent clients. At Boston College Law School, Professor Minuskin has developed, written elaborate case materials for, and taught innovative litigation practice courses. In his Pretrial Litigation course, students litigate a complex civil case in a semester-long simulated employment discrimination law suit. The roles of parties and witnesses are played by accomplished, local actors; students work in teams comprising firms and are supervised and critiqued by Boston area litigators and judges. After teaching in the Law School’s first-year lawyering program for many years, Professor Minuskin developed his own first-year practice course, Introduction to Civil Litigation Practice, in which students engage in litigation skills training, again with seasoned actors playing the roles of parties, and grapple with real ethics dilemmas presented in class by guest practitioners. Professor Minuskin also periodically serves as on-site externship director for Boston College Law School’s London Program, an international collaboration with King’s College London School of Law in which Boston College law students spend a full semester abroad interning with international finance, human rights, or environmental law placements while taking law classes at King’s. In addition to writing materials for his courses, Professor Minuskin produced and directed an advocacy ethics training video, Shalleck v. Winchester-Park, in collaboration between the Law School and the University of California Hasting College of Law. Professor Minuskin has also engaged in litigation training for practicing lawyers. He frequently presents to and trains community organizations on Massachusetts housing law. He has been active in a variety of professional organizations whose purpose is the expansion and reformation of programs designed to provide wider access to legal services and justice for economically disadvantaged people. He is a member of the Massachusetts bar."},
{"DisplayName":"Shu-Yi Oei","area1":"Tax Law","area2":"Business Law","area3":"","acfacAreas":"Business Law; Tax Law; ","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/shu-yi-oei.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/oei-335x400.jpg","SortName":"Oei, Shu-Yi","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Shu-Yi Oei joined Boston College Law School in 2017. She teaches and writes in the areas of tax law and policy, bankruptcy law and commercial law. She taught at Tulane Law School from 2009-2017 and was the inaugural holder of the Hoffman F. Fuller Professorship in Tax Law. Oei also received the 2014 Felix Frankfurter Distinguished Teaching award, Tulane Law School’s highest teaching honor. Oei’s research focuses on the relationship between the administration and collection of taxes and economic security and financial risk. Her recent work also addresses innovations in the arena of human capital investments and the taxation and regulation of new industries and transactions. Her articles have appeared in leading publications, including the University of Pennsylvania Law Review, the Boston College Law Review and the American Bankruptcy Law Journal. She has presented her research at various workshops and conferences, including the Indiana University Maurer School of Law Tax Policy Colloquium and the Northwestern University School of Law Colloquium on Advanced Topics in Taxation. In collaboration with Tulane's Murphy Institute, she co-founded the Tulane Tax Roundtable, an annual gathering of leading tax scholars. Before joining the Tulane faculty, Oei practiced tax law in Boston for six years. Her practice included advising clients on federal, state and international tax matters, transactional tax planning and tax controversies. In addition to her law degree, Oei holds a Master of Theological Studies from Harvard Divinity School."},
{"DisplayName":"David Olson","area1":"Intellectual Property & Technology Law","area2":"Administrative & Government Law","area3":"Business Law","acfacAreas":"Administrative & Government Law; Business Law; Intellectual Property & Technology Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-olson.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Olson-David-335x400.jpg","SortName":"Olson, David","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Olson is an associate professor at Boston College Law School. He teaches patents, intellectual property, and antitrust law. Professor Olson researches and writes primarily in the areas of patent law and copyright. Professor Olson came to Boston College from Stanford Law School's Center for Internet and Society, where he researched in patent law and litigated copyright fair use impact cases. Before entering academia, Professor Olson practiced as a patent litigator at the law firm of Kirkland & Ellis LLP. Professor Olson clerked for Judge Jerry Smith of the U.S. Court of Appeals for the Fifth Circuit."},
{"DisplayName":"Lynnise E. Pantin","area1":"Business Law","area2":"Experiential","area3":"Corporate & Securities Law","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/lynnise-pantin.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Pantin_335x400.jpg","SortName":"Pantin, Lynnise E.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Lynnise E. Pantin is a Clinical Associate Professor of Law at Boston College Law School. She co-teaches the Community Enterprise Clinic, Boston College Law School’s transactional clinical course. Her scholarship focuses on pedagogy, lawyering skills teaching and clinical teaching, interlacing social justice, ethics and corporate law. Prior to joining the faculty at BCLS, she was the co-founding Director of the Transactional Law Clinic at New York Law School, where she taught Legal Practice in addition to the Clinic and directed the Social Entrepreneurship Initiative of the Impact Center for Public Interest Law & Advocacy. Before joining NYLS, she was an adjunct instructor of Legal Writing at Brooklyn Law School. Professor Pantin began her legal career as an associate at Debevoise & Plimpton LLP, where she practiced corporate and securities law in the investment management group within the firm’s corporate department. She advised private investment funds, their sponsors, and investors in all matters related to the formation and operation of domestic and international funds. She also advised non-profit organizations and small businesses on business transactions, formation issues and governance and regulatory compliance. Professor Pantin has always been interested in teaching. Prior to becoming a lawyer, she was an elementary school teacher in Washington, D.C. Professor Pantin earned her J.D. from Columbia Law School and her B.A. in Media Studies from Pomona College."},
{"DisplayName":"Vlad Perju","area1":"Constitutional Law","area2":"International & Comparative Law","area3":"Legal History & Jurisprudence","acfacAreas":"Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/vlad-perju.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Perju_335x400.jpg","SortName":"Perju, Vlad","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Perju is the Director of the Clough Center for the Study of Constitutional Democracy at Boston College and a tenured Associate Professor at Boston College Law School. His primary research and teaching interests include the law of the European Union, comparative constitutional law and theory, international and comparative law and jurisprudence. Before joining the Boston College faculty in 2007, Perju was awarded a doctorate from Harvard Law School under the supervision of Professor Frank Michelman with a dissertation entitled “The Province of Cosmopolitan Jurisprudence: Constitutional Foundations”. He earned two law degrees from the University of Bucharest and the University of Paris 1 Panthéon-Sorbonne, an LLM degree summa cum laude from the European Academy of Legal Theory in Brussels, Belgium and graduated from the LL.M. program at Harvard (degree waived). While at Harvard, he served as a Byse Fellow, a Safra Fellow at the Edmond J. Safra Foundation Center for Ethics and a Research Fellow in Amartya Sen’s Project on Justice, Welfare and Economics. Perju was a Visiting Associate Professor at Harvard Law School in the Fall Term 2011 and a Visiting Professor of the Theory of the State at the European Academy of Legal Theory in Brussels, Belgium. Perju was awarded the 2009 Ius Commune Prize for his article entitled 'Reason and Authority in the European Court of Justice' (49 Virginia Journal of International Law 307). His paper 'Cosmopolitanism and Constitutional Self-Government' was selected for presentation at the 2010 Yale/Stanford Junior Faculty Forum. In the Fall 2009, Professor Perju was a research fellow at NYU Law School. He has been an affiliate of the Minda de Gunzburg Center for European Studies at Harvard University since the Spring 2010. In 2008 Professor Perju was appointed by the President of Romania to a seven-member Commission on Constitution Reform. He remains actively involved in the process of constitutional reform both in Romania as well as in the European Union. Some of his commentary can be found here (in English) and here (in Romanian). At Boston College, he teaches courses in the Law of the European Union, American and Comparative Constitutional Law, The Past and Future of the State, as well as advanced seminars on European Integration and Modern Legal Theory."},
{"DisplayName":"Zygmunt J.B. Plater","area1":"Environmental Law","area2":"Administrative & Government Law","area3":"Real Estate Law","acfacAreas":"Administrative & Government Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/zygmunt-plater.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Plater_335x400.jpg","SortName":"Plater, Zygmunt J.B.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Zygmunt J. B. Plater is Professor of Law at Boston College Law School, teaching and researching in the areas of environmental, property, land use, and administrative agency law. Over the past 30 years he has been involved with a number of issues of environmental protection and land use regulation, including service as petitioner and lead counsel in the extended endangered species litigation over the Tennessee Valley Authority's Tellico Dam, representing the endangered snail darter, farmers, Cherokee Indians, and environmentalists in the Supreme Court of the United States, federal agencies, and congressional hearings. He was chairman of the State of Alaska Oil Spill Commission’s Legal Task Force over a two-year period after the wreck of the M/V Exxon-Valdez. He was a consultant to plaintiffs in the Woburn toxic litigation, Anderson et al. v. W.R. Grace et al., the subject of the book and movie A Civil Action. Drawing upon his work for the Exxon Valdez Oil Spill Commission he researched and consulted on responses to the BP Deepwater Horizon oil spill. Professor Plater has taught on seven law faculties. While teaching public law for three years in the national university of Ethiopia, he redrafted the laws protecting parks and refuges, assisted in publication of the Consolidated Laws of Ethiopia, and helped organize the first United Nations Conference on Individual Rights in Africa. Articles Professor Plater has published include analyses of environmental law issues, private and public rights in land and resources, equitable discretion, administrative law, and related fields. Several of his articles have been cited in Supreme Court decisions. He is lead author of Environmental Law and Policy: Nature, Law, and Society, now in its fourth edition, Aspen Publishers, 2010. His most recent articles focus on the interaction among environment, economics, and social governance. Several of these most recent articles focus on lessons from the BP Deepwater Horizon blowout and oil spill in the Gulf of Mexico. He was voted the recipient of the Emil Slizewski Faculty Excellence Award by the BCLS Class of 2000 and received the 2005 David Brower Lifetime Achievement Award presented by the Land Air Water Association at the Twenty-third International Public Environmental Law Conference. In 2011, by student vote, he was named Public Interest Law Professor of the Year, Boston College Public Interest Law Foundation."},
{"DisplayName":"Diana C. Pullin","area1":"Administrative & Government Law","area2":"","area3":"","acfacAreas":"Administrative & Government Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/diana-pullin.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Pullin_335x400.jpg","SortName":"Pullin, Diana C.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Education law and public policy; testing and the law; opportunity to learn; educator quality; accountability in higher education; impact of social science research on legal and public policy decisions in education. Member, Board on Testing and Assessment, National Research Council, National Academy of Sciences, Washington D.C. Member, Committee for a Five Year Summative Evaulation of the Washington, D.C. Public Schools. Associate Editor, Educational Policy"},
{"DisplayName":"Brian Quinn","area1":"Corporate & Securities Law","area2":"Business Law","area3":"Experiential","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/brian-quinn.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Quinn_335x400.jpg","SortName":"Quinn, Brian","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Brian JM Quinn joined Boston College Law School in 2008. He teaches Corporations, Corporations Lab, Mergers & Acquisitions, Mergers & Acquisitions Lab, as well as Deals: The Economic Structure of Transactions. Prof. Quinn's research focuses on corporate law, the structuring of transactions, transactional law, and private ordering. Prof. Quinn joined the law school from Stanford Law School where he was the Teaching Fellow for Corporate Governance & Practice. Prior to his position at Stanford, Prof. Quinn was in private practice with Cooley Godward in Palo Alto, where he represented public and private technology clients in merger and acquisitions transactions. Prof. Quinn also previously served as country coordinator for the Harvard University’s Institute for International Development, managing Harvard’s Vietnam-based teaching and research activities. Prof. Quinn got his start as a legislative aide to Senator Edward M. Kennedy working on health and education issues. Prof. Quinn writes on corporate law, transaction structures and private ordering. His work has appeared in numerous journals including the UC Davis Law Review, University of Cincinnati Law Review, the Journal of Corporation Law, and the Delaware Journal of Corporate Law among others. Prof. Quinn is a regularly cited in the media for his legal analysis and commentary on current merger transaction deal developments. Prof. Quinn also blogs on legal developments in corporate governance and mergers & acquisitions at the M&A Law Prof Blog. In addition, Prof. Quinn has written extensively on issues of legal reform in post-Socialist Asia, particularly Vietnam. Prof. Quinn is a member of the board of the Trust for University Innovation in Vietnam (TUIV). The TUIV is a 501(c)(3) organization with a mission to improve institutional innovation in Vietnam’s system of higher education. Prof. Quinn is a non-resident fellow George Washington University Law School’s Center for Law, Economics, and Finance, as well as an International Fellow at the Fulbright Economics Teaching Program at the University of Economics of Ho Chi Minh City, Vietnam. Prof. Quinn received the 2011 Professor Emil Slizewski Award for Faculty Excellence and the Provost’s 2012 TWIN Award for the use of new technology in teaching."},
{"DisplayName":"James R. Repetti","area1":"Tax Law","area2":"Business Law","area3":"","acfacAreas":"Business Law; Tax Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-repetti.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Repetti_335x400.jpg","SortName":"Repetti, James R.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"The inaugural holder of the William J. Kenealy, S.J. Chair, Professor Repetti is co-author of the texts, Partnership Income Taxation, Introduction to United States International Taxation, Federal Wealth Transfer Taxation, Problems in Federal Wealth Transfer Taxation, and Tax Aspects of Organizing and Operating a Business. He is also a contributing author to the treatises, Comparative Income Taxation: A Structural Analysis and to The International Guide to Partnerships. Professor Repetti's numerous influential articles on taxation include 'Democracy and Opportunity: A New Paradigm in Tax Equity' in the Vanderbilt Law Review, 'Textualism and Tax Shelters' in the Virginia Tax Review and 'Democracy, Taxes and Wealth' in the NYU Law Review. He has acted as a consultant to the Internal Revenue Service and Justice Department, and has appeared as a commentator in publications such as the Christian Science Monitor, Forbes Magazine, the Wall Street Journal and Massachusetts Lawyers Weekly. Professor Repetti recently cofounded the Boston College Law School Tax Policy Workshop and organized and moderated a symposium at Boston College Law School entitled, 'The State of the Federal Income Tax: Rates, Progressivity, and Budget Processes,' articles from which were published in the Boston College Law Review. Professor Repetti has also served the University in a number of capacities. These include serving as the Associate Dean of Academics for the Law School, chairing the Law School Appointments Committee for several years, and serving on the University Provost Search Committee and the Law School Dean Search Committee. Professor Repetti is the former Chair of the Executive Committee of the Tax Section of the American Association of Law Schools and is an a Academic Fellow of the American College of Trusts and Estates Counsel. He practiced at Ropes & Gray until joining the Law School faculty and subsequently served as of counsel to Hill & Barlow. He holds a peer review “AV Preeminent” rating from Martindale-Hubbell, which is the highest rating available to lawyers. In 1999, Law School students from all three classes voted Professor Repetti to be the first recipient of an award for excellence in teaching. Courses currently taught by Professor Repetti are individual income tax, corporate tax, estate and gift tax, partnership tax and international tax. He has also previously taught corporations, business planning, charitable organizations and accounting for lawyers."},
{"DisplayName":"Diane Ring","area1":"Tax Law","area2":"International & Comparative Law","area3":"","acfacAreas":"Tax Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/diane-ring.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Ring_335x400.jpg","SortName":"Ring, Diane","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Diane M. Ring is a Professor of Law and the Dr. Thomas F. Carney Distinguished Scholar at Boston College Law School, where she researches and writes primarily in the field of international taxation, corporate taxation, and ethical issues in tax practice. Her recent work addresses issues including information exchange, international tax relations, sharing and human equity transactions, and ethics in international tax. Ms. Ring was a consultant for the United Nation’s 2014 project on tax base protection for developing countries, and the U.N.'s 2013 project on treaty administration for developing countries. She was the U.S. National Reporter for the 2012 IFA Conference on the Debt Equity Conundrum, and the U.S. National Reporter for the 2004 IFA Conference on Double Nontaxation. She was the Assistant General Reporter for the 1995 IFA Conference on Financial Instruments and was a consultant to the IFA research project on the impact of technological and financial innovation on the taxation of income and activities. She is the section chair for the Tax Section of the American Association of Law Schools, and is the Vice Chair for the Tax Section Committee of Teaching Taxation of the American Bar Association. Ms. Ring is also co-author of three case books in taxation– one on corporate taxation, one on international taxation, and one on ethical problems in federal tax practice. Prior to joining Boston College Law School, Ms. Ring was an associate professor of law at the University of Florida Levin College of Law, and an assistant professor at Harvard Law School. Before entering academia, Ms. Ring practiced at the firm of Caplin & Drysdale in Washington, D.C., specializing in the area of international tax and the taxation of financial instruments. Ms. Ring also clerked for Judge Jon O. Newman of the Second Circuit Court of Appeals."},
{"DisplayName":"James Steven Rogers","area1":"Business Law","area2":"Corporate & Securities Law","area3":"Real Estate Law","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-rogers.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Rogers_335x400.jpg","SortName":"Rogers, James Steven","facultyStatus":"Full-Time Faculty","priority":1,"biography":"James Steven Rogers, Professor of Law, teaches and writes in the areas of contracts, modern commercial law, particularly payment systems, the law of restitution, and the history of Anglo-American commercial law. Professor Rogers has played a major role in the development of modern commercial law. He served as Reporter (principal drafter) for the Drafting Committee to Revise UCC Article 8, which established a new legal framework for the modern system of electronic, book-entry securities holdings through central depositories and other intermediaries. One observer characterized that project as “the most challenging and ambitious uniform or model law project since the creation of the UCC” and remarked on the “outstanding work of the tireless and imaginative reporter, Professor James Steven Rogers.” Prof. Rogers has spoken on that project at numerous symposia and conferences both in the United States and abroad. He was also involved in the projects on negotiable instruments (UCC Articles 3 and 4) and secured transactions (UCC Article 9). He is widely published in law reviews on subjects of modern commercial law and bankruptcy, particularly in the fields of investment securities, negotiable instruments, and the history of Anglo-American commercial law. His 1995 book The Early History of the Law of Bills and Notes was published by Cambridge University Press. One reviewer of that book called it “brilliant, daring, even iconoclastic in its scope,” noting that “Rogers' book can only be called path-breaking.” Another remarked that while “few technical subjects remain so nearly inaccessible to those engaged in interdisciplinary studies as the evolution of exchange mechanisms,” Rogers “writes with great technical proficiency and precision” so that “this is a book that most general historians will find accessible.” Yet another reviewer observed that “this is a thoroughly absorbing and consistently illuminating book.” Professor Rogers recently completed a book, The End of Negotiable Instruments: Bringing Payment Systems Law Out of the Past, published by Oxford University Press , on the modern law of payment systems and the role of history in the development of that law. Unlike most discussions of reform of payment systems law—which assume that the existing law works well for traditional paper-based systems—Rogers’ book argues that the law of checks and notes, as set out in Articles 3 and 4 of the Uniform Commercial Code, is itself anachronistic and all but incoherent. The book shows much of the current law of checks and notes is the product of nothing more than that historical fluke, such as odd details of the eighteenth century Stamps Acts. It shows that there is no need for a statute governing promissory notes and that the law of checks would be far simpler if it treated checks simply as instructions to the financial system, akin to debit or credit cards. Rogers’ work is well-known abroad as well as in the United States. He has participated in symposia on comparative aspects of the history of commercial law in Italy and Spain. He has spoken on the commercial law foundation of the securities clearance and settlement system at programs in England, Australia, China, Japan, Mexico, and the Netherlands. He served as one of the United States delegates to the Hague Conference on Private International Law project to negotiate and draft a Convention on Choice of Law for Securities Holding Through Securities Intermediaries and as a member of Drafting Group for that Convention. Prior to joining the Boston College Law School faculty, Rogers practiced with the firm of Sullivan & Worcester in Boston, Massachusetts and clerked for Judge Bailey Aldrich of the United States Court of Appeals for the First Circuit. He received a J.D. magna cum laude from Harvard Law School in 1976, where he served on the Harvard Law Review and was awarded the Fay Diploma for graduating first in his class in cumulative G.P.A. He received his A.B. summa cum laude from the University of Pennsylvania, 1973, where he studied philosophy and history."},
{"DisplayName":"Vincent D. Rougeau","area1":"Legal History & Jurisprudence","area2":"International & Comparative Law","area3":"Business Law","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/vincent-rougeau.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Rougeau_335x400.jpg","SortName":"Rougeau, Vincent D.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Vincent D. Rougeau became Dean of Boston College Law School on July 1, 2011. He previously served as a professor of law at Notre Dame, and served as their Associate Dean for Academic Affairs from 1999-2002. He received his A.B. magna cum laude from Brown University in 1985, and his J.D. from Harvard Law School in 1988, where he served as articles editor of the Harvard Human Rights Journal. A vocal advocate for change in legal education, Dean Rougeau writes and speaks extensively on legal education reform. He has led a reorganization in leadership structure at the law school that supports a more holistic approach to student services, expands the school’s national and international recruitment of a diverse student body through the new Associate Dean for External Relations, Diversity and Inclusion, and enhances the school’s commitment to experiential learning and global engagement. BC Law’s new Center for Experiential Learning brings all the school’s hands-on training programs under one roof, while the new Global Practice Program will launch opportunities for students in Chile, Australia, France and other locations around the globe. Dean Rougeau is an expert in Catholic social thought. His book Christians in the American Empire: Faith and Citizenship in the New World Order was released in 2008 by Oxford University Press. Dean Rougeau’s current research and writing consider the relationship between religious identity and notions of democratic citizenship and membership in an increasingly mobile global order. He serves as Senior Fellow at the Contextual Theology Centre (“CTC”) in London, where he researches broad-based community organizing, immigration, and citizenship in the UK as part of the Just Communities Project. Just Communities began as a partnership among Notre Dame, the CTC, and Magdalen College, Oxford University that explored the role of religious communities in community organizing and the formation of democratic citizens in the multicultural neighborhoods of East London. The project is now a collaboration between Boston College and the CTC. Dean Rougeau’s teaching interests are in contract and real estate law, as well as in law and religion. He has taught first-year contracts, real estate transactions, and seminars in Catholic social teaching and immigration and multiculturalism. He is a member of the bar in Maryland and the District of Columbia. Before entering the academy, he practiced law at the Washington, DC office of Morrison & Foerster from 1988-1991."},
{"DisplayName":"Evangeline Sarda","area1":"Experiential","area2":"Ethics & Professional Responsibility","area3":"Criminal Law & Procedure","acfacAreas":"Criminal Law & Procedure; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/evangeline-sarda.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Sarda_335x400.jpg","SortName":"Sarda, Evangeline","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Evangeline Sarda is an Associate Clinical Professor of Law at Boston College Law School. She has been teaching in the Criminal Justice Clinic and directing the Prosecution Program since 1995. She also has taught Introduction to Lawyering and Professional Responsibility and Authority, Identity and the Psychodynamics of Legal Systems. In 2001, Professor Sarda received a Boston College Teaching Advising and Mentoring Grant to pursue work in the field of group relations. As a result, she created and continues to teach Authority and Leadership in Professional Life which draws from group relations theory and methodology to explore the conscious and unconscious dynamics of legal systems and lawyering. In spring 2006, she received a Boston College Teaching Advising and Mentoring Expense Grant to host the first group relations workshop “Negotiating Meaning of Authority and Justice” (director, Anat Ziff) for BCLS students. The workshop took place at the law school in April, 2006. She coordinated a second group relations learning event under the auspices of the Center for the Study of Groups and Social Systems called “Flying the Plane While Reading the Manual: The Challenge of Getting the Task Done While Learning to Do It” (director, Earl Braxton) which took place in spring 2007 at the Boston College Connors Family Retreat and Conference Center. Professor Sarda received her B.A. from Yale University and her J.D. from Columbia Law School, where she was a founding member of the Columbia Journal of Gender and Law and the Executive Editor of the Columbia Human Rights Law Review. After law school, she was an assistant district attorney in Massachusetts with the Middlesex County District Attorney's Office, working primarily in the Domestic Violence Unit. Professor Sarda is married and is the mother of three wonderful children."},
{"DisplayName":"Francine Sherman","area1":"Experiential","area2":"Civil & Human Rights Law","area3":"Health Law","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/francine-sherman.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Sherman_335x400.jpg","SortName":"Sherman, Francine","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Francine Sherman is a Clinical Associate Professor at Boston College Law School where she has been teaching Juvenile Justice and Children’s Rights & Public Policy for the past twenty years and where she founded and directs the Juvenile Rights Advocacy Program. She speaks and writes widely about the juvenile justice system and, in particular, about girls in the justice system. She has testified before Congress, served on the U.S. Department of Justice National Advisory Committee on Violence Against Women focusing on children and teens victimized by domestic violence and sexual assault, and as consultant to OJJDP’s National Girls Initiative. Her most recent report, Gender Injustice: System-Level Juvenile Justice Reforms for Girls, provides a comprehensive overview of the needs and pathways of girls into and through the justice system and details a developmental approach to current juvenile justice reforms. She is also the author of Detention Reform and Girls, a volume of the Pathways to Detention Reform series published by the Annie E. Casey Foundation (2005), and Making Detention Reform Work for Girls: Practice Guide #5 (Annie E. Casey Foundation). She is also the author of the book, Juvenile Justice: Advancing Research, Policy and Practice (Wiley & Sons), and “Justice for Girls: Are we Making Progress?” (UCLA Law Review). She is an ongoing consultant to the Annie E. Casey Foundation’s Juvenile Detention Alternatives Initiative on strategies to reduce the detention of girls nationally, and regularly consults with national and local foundations and systems on issues related to girls in the justice system. Her current research continues to explore a developmental approach to juvenile justice for girls and young women and includes oral histories of young women with justice system histories, qualitative research focusing on pregnant and parenting young women in the juvenile justice system, and law and social science research with Impact Justice on LBQ/GNCT girls detained for prostitution."},
{"DisplayName":"Natalya Shnitser","area1":"Business Law","area2":"Labor & Employment Law","area3":"Administrative & Government Law; Tax Law; Corporate & Securities Law;","acfacAreas":"Administrative & Government Law; Business Law; Tax Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/natalya-shnitser.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Shnitser_335x400.jpg","SortName":"Shnitser, Natalya","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Natalya Shnitser is the inaugural David and Pamela Donohue Assistant Professor in business law. Her current research focuses on retirement security in the United States, including the provision of retirement benefits by private and public employers and the regulation of financial intermediaries. Before joining the faculty in 2014, she was an Associate Research Scholar in Law and the John R. Raben/Sullivan & Cromwell Executive Director of the Yale Law School Center for the Study of Corporate Law. Prior to her time at the Center for the Study of Corporate Law, she was an associate in the New York office of Cleary Gottlieb Steen & Hamilton. Shnitser received her J.D. degree from Yale Law School, where she was a Coker Fellow, editor of the Yale Law Journal, and editor-in-chief of the Yale Journal on Regulation. She is a Phi Beta Kappa graduate of Stanford University, where she received an M.A. in International Policy Studies and a B.A. in Economics. She currently teaches Corporations and Employee Benefits Law."},
{"DisplayName":"Mark Spiegel","area1":"Civil Litigation & Procedure","area2":"Civil & Human Rights Law","area3":"Ethics & Professional Responsibility; Constitutional Law;","acfacAreas":"Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mark-spiegel.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Spiegel_335x400.jpg","SortName":"Spiegel, Mark","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Mark Spiegel is a Professor of Law at Boston College Law School. Professor Spiegel received his A.B. from the University of Michigan and his J.D. from the University of Chicago Law School. Professor Spiegel was a Reginald Heber Smith Fellow assigned to work in legal services in Chicago. He has taught at the University of Pennsylvania Law School where he directed the law school's clinical program. At Boston College Law School, he has taught Civil Procedure, Federal Courts, Civil Rights Litigation, Complex Litigation and Professional Responsibility. He has also been Faculty Director of the Boston College Legal Assistance Bureau. During the Fall of 1991 he visited at Harvard Law School, teaching Civil Procedure. He has been on the Board of Directors of the Society of American Law Teachers and has served on the AALS Accreditation Committee. Professor Spiegel's research interests have focused on problems of professional ethics, particularly lawyer-client relations, and legal education."},
{"DisplayName":"Paul R. Tremblay","area1":"Experiential","area2":"Ethics & Professional Responsibility","area3":"Corporate & Securities Law; Business Law; Environmental Law","acfacAreas":"Business Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paul-tremblay.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Tremblay_335x400.jpg","SortName":"Tremblay, Paul R.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Paul R. Tremblay is a Clinical Professor of Law at Boston College Law School. A member of the faculty since 1982, he teaches clinical courses at BC Legal Services LAB within the Center for Experiential Learning. He served as the Associate Dean for Experiential Learning until 2015. Professor Tremblay also teaches a professional responsibility course each year. Prior to his appointment at Boston College Law School, Professor Tremblay was a Senior Attorney at the Legal Aid Foundation of Los Angeles and an instructor at UCLA School of Law. Professor Tremblay directs the Community Enterprise Clinic, Boston College Law School’s transactional clinical course. In the Community Enterprise Clinic, students represent low- and moderate-income entrepreneurs, small businesses, and nonprofit organizations. The mission of the Community Enterprise Clinic is to support economic progress in under-resourced neighborhoods, and to offer a vibrant educational experience to students interested in business law, transactional work, and community economic development. Before developing the transactional clinic, Professor Tremblay taught civil litigation and housing law clinics at LAB. Professor Tremblay is actively involved in matters of professional ethics, transactional practice, interdisciplinary collaboration, and legal services for the poor. He has been a member of the Boston Bar Association Ethics Committee since 1993, and a board member of Lawyers Clearinghouse since 2010. He has also served on the Executive Committee of the AALS Section on Professional Responsibility. He is the co-author of two textbooks used in law school clinics around the country, and more than 25 law review articles. Professor Tremblay was the recipient of the 2004 Outstanding Advocate for Clinical Teachers Award from the Clinical Legal Education Association and was awarded the Emil Slizewski Excellence in Teaching Award in 2008."},
{"DisplayName":"Maureen Van Neste","area1":"Legal Research","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/maureen-van-neste.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/VanNeste-335x400.jpg","SortName":"Van Neste, Maureen","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Professor Van Neste joined the BC Law faculty in 2017. From 2014-2017, she served on the faculty at Chicago-Kent College of Law at Illinois Institute of Technology, where she served as the Director of Experiential Learning and supervised the upper-level legal research and writing program. Prior to joining academia full time, Professor Van Neste worked in the Chicago office of Grant Thornton LLP, a national public accounting firm. As a senior counsel at Grant Thornton, she managed complex securities and accounting litigation, oversaw the firm's response to regulatory investigations and subpoenas, negotiated professional service and vendor agreements, and counseled firm professionals on risk management issues. During this time, she also served as an adjunct professor of legal writing at Loyola University Chicago School of Law. Prior to joining Grant Thornton, she was an associate in the litigation department at Winston & Strawn LLP. Professor Van Neste received her J.D. from Georgetown University Law Center. During law school, she served as a law fellow in the first-year legal writing program and a senior writing fellow in the law school's Writing Center. She has had additional education experience as a high school classroom teacher and in the nonprofit sector. Professor Van Neste earned a BA in Policy Studies from Syracuse University and a Master of Public Administration from Syracuse's Maxwell School of Citizenship and Public Affairs."},
{"DisplayName":"Catharine Wells","area1":"Legal History & Jurisprudence","area2":"Civil & Human Rights Law","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/catharine-wells.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Wells_335x400.jpg","SortName":"Wells, Catharine","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Catharine Wells is a Professor of Law and Law School Fund Research Scholar at Boston College Law School, where she teaches and writes in various areas of legal theory, including Pragmatic Legal Theory, Feminist Jurisprudence and Civil Rights Theory. In addition, she teaches a class in American philosophy in College of Arts and Sciences. She is a nationally recognized expert on Pragmatism and its relationship to American legal theory. Prof. Wells has taught at a number of law schools including those at the University of Southern California, Stanford University, the University of Arizona and the University of Utah. Her law review articles have been published in many journals including the Harvard Law Review, the Michigan Law Review, University of Southern California Law Review, and the Northwestern Law Journal. Her current work in progress is a book on Oliver Wendell Holmes, Jr. Professor Wells has also held many positions of leadership within the academic community. In addition to serving as Associate Dean for Academic Affairs at Boston College, she has served as chair of the Association of American Law Schools Section on Torts and Compensation Systems, and the Section on Teaching Methods. She has organized numerous symposia including one on Neo-Pragmatism in American Law, which was published in the USC Law Review. She has also been elected to membership in the American Law Institute. Currently, she is working on a book about Oliver Wendell Holmes, Jr. and the pragmatic tradition in American law. Prior to entering law teaching, Prof. Wells served as an Assistant Attorney General and Director of the Division of Public Charities for the state of Massachusetts. In the area of charities law, she has a national reputation based upon her service as past President of the National Association of State Charities Officials, as an advisor to the Commissioner of the Internal Revenue Service with respect to Non-Profit Organizations; and as a participant in many panels and symposia on non-profit law. Professor Wells received her law degree Magna Cum Laude from Harvard Law School. She also earned an MA and PhD in Philosophy from the University of California, Berkeley. Her dissertation was titled Peirce on Logic: the Phenomenological Bases of Normative Science. Her undergraduate degree was received from Wellesley College."},
{"DisplayName":"Ryan Williams","area1":"Constitutional Law","area2":"Civil Litigation & Procedure","area3":"","acfacAreas":"Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ryan-williams.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Williams_335x400.jpg","SortName":"Williams, Ryan","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Ryan Williams joined the B.C. Law faculty as an Assistant Professor of Law in 2016. He teaches and writes in the areas of constitutional law, civil procedure, and federal courts. His research has included works focusing on the original meanings of the Fifth, Ninth, and Fourteenth Amendments as well as works exploring the intersection of constitutional rules and the civil litigation process. His prior publications have appeared or are forthcoming in the Yale Law Journal, the Columbia Law Review, the Stanford Law Review, the Notre Dame Law Review, and the Virginia Law Review."},
{"DisplayName":"David A. Wirth","area1":"Environmental Law","area2":"International & Comparative Law","area3":"Administrative & Government Law; Civil & Human Rights Law;","acfacAreas":"Administrative & Government Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-wirth.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Wirth_335x400.jpg","SortName":"Wirth, David A.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"David A. Wirth is Professor of Law at Boston College Law School in Newton, Massachusetts, where he has served as Director of International Programs. Professor Wirth teaches primarily in the field of public international law. He has a particularly strong research interest in international environmental law, an area in which he has worked and practiced for more than two decades. In addition to Boston College, he has taught at Harvard, M.I.T., Oxford, the Fletcher School of Law and Diplomacy, and the University of Virginia. Prior to moving to academia, Professor Wirth was Senior Attorney and Co-Director of the International Program at the Washington, D.C. office of the Natural Resources Defense Council (NRDC), a nonprofit public interest law firm specializing in environmental issues. While there, he worked on a variety of international environmental issues, including environmental reform of World Bank and regional development banks, the “greenhouse” effect, Soviet and eastern European environmental issues, stratospheric ozone depletion, and exports of hazardous substances. Professor Wirth has also been Attorney-Adviser for Oceans and International Environmental and Scientific Affairs in the Office of the Legal Adviser of the U.S. Department of State in Washington, D.C., where he had principal responsibility for all international environmental issues, including exports of hazardous substances and technologies, acid rain, and stratospheric ozone depletion. In his positions at the Department of State and NRDC, Professor Wirth has had extensive experience in multilateral negotiations under the auspices of the United Nations Environment Program, the Organization for Economic Cooperation and Development, the UN Economic Commission for Europe, and other international organizations. Professor Wirth is a 1981 graduate of the Yale Law School and served as law clerk to Judge William H. Timbers of U.S. Court of Appeals for the Second Circuit in New York for a year thereafter. He holds undergraduate and graduate degrees in chemistry from, respectively, Princeton University and Harvard University, at which he held a National Science Foundation Fellowship. During the summer of 1997, he was a Fulbright Scholar through the Organization for Security and Cooperation in Europe (OSCE) Regional Research Program. A life member of the Council on Foreign Relations, Professor Wirth has served on advisory boards to a number of institutions of higher learning, domestic agencies, and international organizations, including Vermont Law School, the Environmental Protection Agency and the European Bank for Reconstruction and Development. He has been a consultant to the United Nations Development Program, the United Nations Environment Program, the North American Commission for Environmental Cooperation, the C.S. Mott Foundation, the German Marshall Fund of the United States, and the Belgian State Secretary for Energy and Sustainable Development. A prolific writer, Professor Wirth is the author of more than fifty articles and reports on international environmental law and policy for legal, academic, professional, and popular audiences. He is co-author of major new editions of legal texts on international organizations and environmental law. Professor Wirth is currently at work on a scholarly treatise on the role of science in international trade law. His published work has appeared in numerous highly respected journals, including the Yale Law Journal, the Columbia Law Review, the Virginia Law Review, Foreign Policy, and the American Journal of International Law."},
{"DisplayName":"Alfred Chueh-Chin Yen","area1":"Intellectual Property & Technology Law","area2":"Experiential","area3":"Business Law","acfacAreas":"Business Law; Intellectual Property & Technology Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/alfred-chueh-chin-yen.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Yen_335x400.jpg","SortName":"Yen, Alfred Chueh-Chin","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Alfred C. Yen is the Associate Dean of Faculty and a Professor of Law at Boston College Law School, Law School Fund Scholar, and Director of the Emerging Enterprises and Business Law Program. He is a nationally known scholar who has published numerous articles about copyright law, the Internet, Asian-American legal issues, and law teaching. His recent works include 'Third Party Liability After Grokster,' which appeared in the Minnesota Law Review and a new casebook on copyright (co-authored with Professor Joseph Liu) entitled “Copyright: Essential Cases and Materials,” which was published by West Publishing in 2008. Professor Yen has also held many positions of leadership within legal education and the broader practicing bar. He recently served as Chair of the AALS Professional Development Committee and completed a term on the Board of Editors for the Journal of Legal Education and the Board of Governors for the Society of American Law Teachers. In 2001, the American Law Institute elected him to membership in the Institute. Additionally, Professor Yen has served as chair of the Association of American Law Schools Section on Art Law and its Section on Minority Groups. He organized the first, fifth, and tenth Conference of Asian Pacific American Law Faculty, all of which were held at Boston College Law School. In 1992, Professor Yen wrote and filed an amicus brief with the United States Supreme Court on behalf of 12 copyright scholars in the case of Campbell v. Acuff-Rose Music Publishing Co. He also joined another group of copyright scholars to file an amicus brief in the case of A&M Records. Inc. v. Napster, Inc. during the summer of 2000. Professor Yen is a graduate of Stanford University and Harvard Law School. Before joining the faculty in 1987, he practiced law in Los Angeles for four years at the firm of Sheppard, Mullin, Richter and Hampton."},
{"DisplayName":"Katharine G. Young","area1":"Constitutional Law","area2":"International & Comparative Law","area3":"Civil & Human Rights Law; Legal History & Jurisprudence","acfacAreas":"Constitutional Law; ","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/katharine-young.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Young_335x400.jpg","SortName":"Young, Katharine G.","facultyStatus":"Full-Time Faculty","priority":1,"biography":"Katharine Young joined the faculty as Associate Professor in July 2013. Before coming to Boston College, she was an Associate Professor at the Australian National University, and has been a Visiting Assistant Professor at Boston University and a Byse Teaching Fellow at Harvard Law School. Her fields of expertise are economic and social rights, comparative constitutional law and international human rights law. Professor Young’s recent book, Constituting Economic and Social Rights (OUP, 2012), is published in the Oxford Constitutional Theory series. Other recent publications have appeared in the Harvard Human Rights Journal, the Harvard Law Review Forum, the International Journal of Constitutional Law, the Australian Year Book of International Law, and the Yale Journal of International Law. Professor Young completed doctoral and masters studies in law (the S.J.D. and LL.M.) at Harvard Law School and legal studies at Melbourne University and at the University of Heidelberg. She has been a Fellow at Harvard University’s Project on Justice, Welfare and Economics, the Edmond J. Safra Center for Ethics and the Weatherhead Center for International Affairs. Professor Young has professional legal experience in Melbourne, New York, in the United Nations and in an NGO in Accra, Ghana. She served as Clerk for The Hon Michael Kirby AC CMG at the High Court of Australia. At Boston College, she teaches Contracts and Human Rights and Global Poverty."},
{"DisplayName":"Hugh J. Ault","area1":"Tax Law","area2":"International & Comparative Law","area3":"Business Law","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/hugh-ault.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Ault_335x400.jpg","SortName":"Ault, Hugh J.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"Hugh Ault retired from active teaching duties in the spring of 2012. Professor Ault is a specialist in taxation with an emphasis on international tax issues. He has been visiting professor at a number of foreign universities in Europe, Asia and Australia. He was a Fulbright Exchange Professor at the University of Stockholm, where he received an honorary Juris Doctor degree in 1994. In 2003 he also received an honorary doctor of laws degree from Katholieke Universiteit Leuven, Belgium, in recognition of his academic contributions in international and comparative tax law. He taught courses in business and international taxation as well as tax policy. Professor Ault has written numerous books and articles on tax issues. The third revised edition of his book Comparative Income Taxation: A Structural Analysis (Kluwer/Aspen) appeared in 2010 and a Chinese translation was published by Peking University Press in 2013. Professor Ault was formerly Senior Advisor to the Organization for Economic Cooperation and Development (OECD) Centre for Tax Policy and Administration in Paris (1997-2012). He is currently Visiting Research Scholar at the Max Planck Institute for Tax Law and Public Finance in Munich and Senior Visiting Fellow at the University of Stockholm Centre for Commercial Law. He is also serving as a Consultant to the United Nations Financing for Development Office (FfDO), involved in work on strengthening developing country tax systems."},
{"DisplayName":"Charles H. Baron","area1":"Health Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/charles-baron.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Baron_335x400.jpg","SortName":"Baron, Charles H.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"Professor Baron, recently retired from active teaching, has written extensively here and in Europe about constitutional law and patients' rights. He has taught courses in federal, state, and comparative constitutional law, health law, and law and bioethics. Among the faculties abroad where he has held visiting positions are Oxford University, the University of Paris X, the Hebrew University of Jerusalem, the University of Aix-Marseilles III, and the European University Institute in San Domenico di Fiesole. He is a member of the Scientific Committee of the European Centre for Life Sciences, Health, and the Courts, a member of the Board of Directors of the Death with Dignity National Center, and a Past President of the American Civil Liberties Union of Massachusetts."},
{"DisplayName":"Arthur L. Berney","area1":"Constitutional Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/arthur-berney.html","Image":"","SortName":"Berney, Arthur L.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"Professor Berney retired from active teaching duties in the Spring of 2001. He has taught courses in constitutional, communications and national security law. He is coauthor of National Security Law and Legal Problems of the Poor. He has served on the Steering Committee of the Lawyers' Committee for Civil Rights Under Law. Involved in the writing of an amicus brief to the Supreme Judicial Court of Massachusetts in the same-sex marriage case before that court, for religious groups that support same-sex marriage. Recently quoted by the Boston Herald regarding a class-action lawsuit against Texaco for pollution in Ecuador. Presented a paper on human rights violations in connection with the international effort to control the illicit drug trade, at the conference and workshop, 'Global Organized Crime and International Security: Balancing Societal Needs and Human Rights,' at the Onati Institute for the Sociology of Law in Spain. Consulted in a First Amendment case involving a BC Law alumni, and in a Virginia civil suit where a murder conviction was set aside on a writ of habeas corpus."},
{"DisplayName":"Peter A. Donovan","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/peter-donovan.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Donovan_335x400.jpg","SortName":"Donovan, Peter A.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"Professor Donovan retired from active teaching duties in the Fall of 2002. Professor Donovan specialized in products liability and antitrust law. He taught Torts, Corporations and Antitrust Law and was also the faculty advisor for the law school's moot court competitions. Professor Donovan is coauthor of Massachusetts Corporation Law, to which he made the 1998 revisions. Visiting professor of law at the University of Paris, during the spring 2001 semester, where he will teach an introductory course in American law entitled 'L'introduction de droit americain.'"},
{"DisplayName":"John M. Flackett","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/john-flackett.html","Image":"","SortName":"Flackett, John M.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"Professor Flackett retired from active teaching duties in the Spring of 2001. His previous teaching subjects included Torts, Criminal Law, Mental Health Law, and Law, Values and Professional Identity. He also served as the director of international programs at Boston College Law School from 1991-2000. Work in Progress: 'Lear in Law: A Legal Examination of Shakespeare's King Lear.' A history of the Boston College Law School Program in International and Comparative Law at King's College, London, from 1991-2000. Directed the Spring 2000 BC Law Program in International and Comparative Law at King's College, in London, England. The program, now in its tenth year, received renewal of its accreditation in July, 2000 by the American Bar Association Section on Legal Education."},
{"DisplayName":"Ruth-Arlene W. Howe","area1":"Civil & Human Rights Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ruth-arlene-howe.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Howe_335x400.jpg","SortName":"Howe, Ruth-Arlene W.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"Professor Ruth-Arlene W. Howe retired from active teaching duties in the Fall of 2009. Professor Howe first arrived at BC Law as a student in 1970. More than 40 years later, her hard work, passion, and commitment to diversity and social justice as a student, alumna, and faculty member have helped shape BC Law into what it is today. Professor Howe has spent much of her life working for social justice. Calling upon her life experiences as a daughter, wife, mother, and community activist, Professor Howe dedicated her career to further the best interests of children, especially African-American youth. As the first African-American female faculty member to achieve tenure and the rank of full professor in the history of BC Law, Professor Howe enjoyed a distinguished and varying academic career, teaching a variety of courses and seminars in family law, elder law, legal interviewing and counseling, and professional responsibility. Professor Howe was a founding faculty advisor to the Third World Law Journal, now the Journal of Law and Social Justice, and an advisor to the Black Law Student Association."},
{"DisplayName":"Sanford N. Katz","area1":"Family & Estate Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/sanford-katz.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Katz_335x400.jpg","SortName":"Katz, Sanford N.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"The inaugural holder of The Darald and Juliet Libby Chair, Professor Sanford N. Katz joined the Boston College Law School faculty in 1968 and teaches Family Law and Contracts. The Darald and Juliet Libby Chair is in honor of Michael G. Pierce, S.J. Professor Katz has served as Chairman of the Family Law Section of the American Bar Association, President of the International Society of Family Law and Editor-in Chief of the Family Law Quarterly. He has been named Editor-in-Chief of the Brill Research Perspectives in Family Law in a Global Society, published by Brill Nijhoff of The Netherlands. He is a member of various editorial boards of journals and, in addition to his published articles and books, has been the chief drafter of model child welfare legislation for the federal government. He is a Special Contributor and Consultant for Law for the Fourth Edition of The American Heritage Dictionary of the English Language published by Houghton Mifflin Company. Professor Katz clerked for Chief Judge Marvin Jones, U. S. Court of Appeals for the Federal Circuit, in 1958-59."},
{"DisplayName":"Cynthia C. Lichtenstein","area1":"International & Comparative Law","area2":"Corporate & Securities Law","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/cynthia-lichtenstein.html","Image":"","SortName":"Lichtenstein, Cynthia C.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"A noted specialist on international banking and international transactions, Professor Cynthia C. Lichtenstein retired from active teaching duties at BCLS in the Spring of 2001. She has been a member of the faculty at Boston College Law School since 1971. Upon retirement, she was a Distinguished Visiting Professor at George Washington University Law School and a Visiting Professor at Brooklyn Law School. She occasionally teaches a Seminar in International Financial Law at BCLS. Professor Lichtenstein has lectured in numerous cities around the world including London, Paris, Buenos Aires, and Sydney, Australia. In addition to significant involvement with a major New York law firm in various capacities over the years, she served briefly with the European Economic Community. Among her many contributions to public and private international law, Professor Lichtenstein served as President of the International Law Association (American Branch) from 1986 to 1992, as an officer of the American Society of International Law, and as a member of the Board of Editors of the American Journal of International Law from 1982 to 1991. She is presently an Honorary Editor of the American Journal of International Law, Treasurer of ILSA, the International Law Students Association which administers the Jessup Competition, the international law moot court competition with participants from over 80 countries, and serves as a Vice-Chair of the International Law Association. Professor Lichtenstein is the author of many significant articles on international banking regulation and international transactions. Her most recent publication is a chapter in International Monetary Law: The Global Crisis (eds. Mario Giovanoli and Diego Devos, OUP, 2010) entitled 'Lessons for the 21st Century Central Bankers: Differences between Investment and Depositary Banking.' Other significant articles are 'The FED's New Model of Supervision for 'Large Complex Banking Organizations', 18 Transnational Lawyer 283 (2005); 'Dealing with Sovereign Liquidity Crises: New International Initiatives for the New World of Volatile Capital Flows to and From Emerging Markets,' 29 McGeorge Law Review 807 (1998) and a short version, under the title 'Innoculating Against the Asian Flu,' appears in the Boston College Law School Magazine, Fall 1998. A short viewpoint, 'Do Globalized Financial Markets Need a New Architecture of Regulation?,' appeared in the December 1998 Translex. Professor Lichtenstein graduated magna cum laude from Radcliffe College (A.B.) and magna cum laude from Yale Law School (J.D.) She also holds a Master's degree in Comparative Law from the University of Chicago Law School."},
{"DisplayName":"Sharon H. O'Connor","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/sharon-oconnor.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/OConnor_335x400.jpg","SortName":"O'Connor, Sharon H.","facultyStatus":"Emeritus Faculty","priority":2,"biography":"Sharon Hamby O'Connor is a Professor Emerita at Boston College Law School. During her tenure at the Law School she served as Associate Dean for Library and Computing Services for 23 years. In that capacity she was responsible, with the rest of the library staff, for providing academic, curricular and technology support to the Law School. She completed her service at the Law School as Associate Dean for Academic Affairs. In this position, she worked with the Dean and faculty in areas of curriculum review, program development, and research and oversaw the delivery of academic services to students. Professor O'Connor is a graduate of Southern Methodist University, holds masters degrees from Columbia University and Yale University in library science and environmental studies respectively, and a JD degree from Harvard Law School. She is the co-author of A Guide to the Early Reports of the Supreme Court of the United States which was awarded the Joseph L. Andrews Bibliographical Award for outstanding contribution to legal bibliography. She is a member of the Massachusetts Historical Society, the Colonial Society of Massachusetts, the American Association of Law Libraries, and the American Society for Legal History."},
{"DisplayName":"Jessica Berry","area1":"Experiential","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jessica-berry.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Berry-335x400.png","SortName":"Berry, Jessica","facultyStatus":"Visiting Faculty","priority":3,"biography":"Jessica Berry teaches in the Juvenile Rights Advocacy clinic as a visiting professor at BC Law. She is Deputy Director of the Children's Law Ceneter of Massachusetts (CLCM), joining them in September, 2009 as a recipient of a Skadden Fellowship. Jessica earned her B.A. from the University of Chicago, graduated magna cum laude from the University of Michigan Law School, and has an M.S.W. from the University of Michigan School of Social Work. Following law school, Jessica clerked for the Honorable Nathaniel M. Gorton of the United States District Court for the District of Massachusetts, and then for the Honorable Diana Gribbon Motz of the United States Court of Appeals for the Fourth Circuit. As a fellow at the CLCM, Jessica focused on representing adolescents in child welfare, education, and mental health matters. In her current role as Deputy Director, Jessica represents youth ages 0-22 in child welfare and education matters."},
{"DisplayName":"Jane Biondi","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jane-biondi.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Biondi_2_335x400.jpg","SortName":"Biondi, Jane","facultyStatus":"Visiting Faculty","priority":3,"biography":"Jane Biondi received her J.D. degree cum laude from Boston College Law School in 1999, where she was an articles editor of the BC Law Review. In addition, Professor Biondi holds a Masters degree in English from Boston College.  Following law school, she practiced commercial litigation in Boston at Choate Hall & Stewart and Hinckley, Allen & Snyder. She has taught in the clinical and first-year lawyering programs at Harvard Law School, negotiation at New England Law Boston and in the Legal Assistance Bureau at Boston College Law School.  "},
{"DisplayName":"Geraldine Hines","area1":"Criminal Law & Procedure","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Geraldine-Hines.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Hines-Geraldine-335x400.jpg","SortName":"Hines, Geraldine","facultyStatus":"Visiting Faculty","priority":3,"biography":"Geraldine Hines is the Rappaport Distinguished Visiting Professor for the Spring 2018 semester. She was born in Scott, Mississippi, and grew up in the Mississippi Delta. She graduated from Tougaloo College in 1968 and the University of Wisconsin Law School in 1971. Upon graduation she became a staff attorney at the Massachusetts Law Reform Institute, engaging in prisoner's rights litigation, and then, from 1973 to 1977 practiced criminal law with the Roxbury Defenders' Committee eventually becoming Director of the Committee. After an MIT fellowship researching policy initiatives to address the issue of police misconduct in communities of color, she served as co-counsel in Commonwealth v. Willie Sanders. From 1979-1982 she litigated civil rights cases relating to discrimination in education and advised on special education law while a staff attorney at the Harvard University Center for Law and Education. Justice Hines entered private practice in 1982, appearing in state and federal courts on criminal, administrative, labor and family law matters. She continued to litigate civil rights cases, including employment discrimination and police misconduct claims, as a founding partner in the first law firm of women of color in the New England region. Governor Paul Cellucci appointed Justice Hines as Associate Justice of the Superior Court in 2001. Governor Deval Patrick appointed her as an Associate Justice of the Appeals Court in 2013, and she was appointed to the MA Supreme Judicial Court a year later. Justice Hines has been active in a number of civic and community organizations, some of which include the American Civil Liberties Union, the National Lawyers Guild and the National Conference of Black Lawyers. She has also observed elections and investigated human rights abuses in Africa and the Middle East. She was appointed to serve on both the Judicial Nominating Council and the Judicial Nominating Commission. Justice Hines has been an adjunct faculty member at Northeastern University Law School since 1980, and has frequently presented educational programs for attorneys and judges, including MCLE, where she has both presented and published materials in diverse subjects such as trial advocacy, federal civil litigation and municipal torts and civil rights claims."},
{"DisplayName":"Jay McManus","area1":"Experiential","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jay-mcmanus.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/McManus_Jay_335x400.jpg","SortName":"McManus, Jay","facultyStatus":"Visiting Faculty","priority":3,"biography":"Jay McManus joined the Children's Law Center as Director in March 1999. A graduate of New England Law Boston and the University of Massachusetts, he previously worked as staff counsel to the state's Department of Children & Families, and as Assistant General Counsel to AFSCME, Council 93, a public employee labor union. Between 1991 and 2007, he directed the Massachusetts chapter of the IPPCH-Because of the Children Program, a not-for-profit that provided relief to children of Irish political prisoners and to families affected by the conflict in the North of Ireland.  Prior to his service in the legal field, McManus worked as a counselor to child patients with disabilities, a counselor to youth in state Department of Youth Services programs, and as a pre-school teacher. He is a former foster parent."},
{"DisplayName":"Alice Noble","area1":"Health Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/alice-noble.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Noble_335x400.jpg","SortName":"Noble, Alice","facultyStatus":"Visiting Faculty","priority":3,"biography":"As both a practicing attorney and as a legal educator, Alice Noble’s career has been focused on issues of health law and policy. She is an expert on the Affordable Care Act and co-author of the recently published Health Care Reform: Law and Practice (M. Chirba, A. Noble, M. Maddigan; Lexis/Matthew Bender 2013), which provides a section by section analysis of statutory and regulatory compliance obligations under the Affordable Care Act. Alice is a Senior Lecturer in the Legal Studies Program at Brandeis University and Adjunct Lecturer at Brandeis University’s The Heller School and Boston College Law School. She holds a law degree from Villanova University School of Law and a Master of Public Health degree from Harvard School of Public Health. In addition to teaching at Brandeis University and Boston College Law School, she has taught numerous courses at Harvard School of Public Health and Tufts Medical School. Courses taught include Genetics, Law, and Social Policy, Health Law and Ethics, Health Law and Policy, Advanced Legal Writing, Law and Public Health, Managed Care Law and Regulation, among others. Alice was a fellow in medical ethics at Harvard Medical School and a Senior Researcher at The American Society of Law, Medicine & Ethics. She has a number of peer-reviewed publications on topics such as genetic technology, law and ethics; medical malpractice; managed care; and hospital law. She is a contributor to the Health Affairs Blog and Health Law Professors Blog. Alice has been an invited speaker on various matters, including national health care reform."},
{"DisplayName":"Carmen Ortiz","area1":"Criminal Law & Procedure","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/carmen-ortiz.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Ortiz-Carmen-335x400.jpg","SortName":"Ortiz, Carmen","facultyStatus":"Visiting Faculty","priority":3,"biography":"Carmen Ortiz is the Rappaport Distinguished Visiting Professor for the Fall 2017 semester. A seasoned prosecutor, Ortiz was appointed by President Barack Obama in 2009 to be Massachusetts’ chief federal law enforcement officer, becoming the first woman and first Hispanic to hold the post of US Attorney. During her more than seven years in office, she oversaw 250 attorneys and staff, implemented the district’s first Civil Rights Unit, and served on the United States Attorney General’s Advisory Committee. Among the other complex criminal and civil cases she handled as US Attorney were numerous health care fraud investigations that resulted in significant financial settlements, among them healthcare giants GlaxoSmithKline, Merck and Johnson & Johnson. Her office won convictions against Tarek Mehanna for providing material support to al Qaeda and against Boston City Council member Chuck Turner, State Senator Dianne Wilkerson, and Massachusetts Speaker of the House Salvatore DiMasi for corruption. During the 1980s and until she became an Assistant US Attorney in 1997, she was an attorney with the US Department of Justice Criminal Division, an Assistant District Attorney in Middlesex County, Massachusetts, and a lawyer in private practice. Prior to this, Ortiz had graduated from George Washington University Law School. From 1989 through 1992, she was a Program Associate and Training Coordinator at Harvard Law School’s Center for Criminal Justice, directing the Harvard/Guatemala Criminal Justice Project, working on reforms and training judges, prosecutors, and defense attorneys in Guatemala. Ortiz also worked on a number of special, short-term investigations during her professional career. In 1991, on behalf of the National Football League, she investigated allegations of sexual harassment by a female sports reporter against several players of the New England Patriots. She also was part of a Senate Foreign Relations Committee team in 1992 that investigated the “October Surprise,” the Congressional inquiry into allegations that members of the 1980 Reagan/Bush presidential campaign delayed the release of 52 American hostages held by Iran. Ortiz is a member of the Board of Trustees for Discovering Justice, a Boston-based civic and justice education nonprofit organization offering in-school, after-school, and courthouse field trip programs that teach elementary and middle school students about the justice system, the role of law in a democratic society, and the fundamental importance of good citizenship."},
{"DisplayName":"Kari Tannenbaum","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kari-tannenbaum.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Tannenbaum_335x400.jpg","SortName":"Tannenbaum, Kari","facultyStatus":"Visiting Faculty","priority":3,"biography":"Kari Tannenbaum has served as Director at the Committee for Public Counsel Services (MA)."},
{"DisplayName":"Sandy Tarrant","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/sandy-tarrant.html","Image":"","SortName":"Tarrant, Sandy","facultyStatus":"Visiting Faculty","priority":3,"biography":"Sandy Tarrant provides comprehensive legal advice to tax exempt organizations, businesses and individuals working on nonprofit issues. Sandy advises clients on general corporate and organizational matters: formation, ongoing operations and dissolution; obtaining and maintaining tax exempt status; mergers, affiliations and other business transactions; compliance; financing; tax exempt bonds; tax exemption; and matters involving fiduciary, governance, fundraising and donor issues. In 2009, Sandy took a professional leave from the firm as a Visiting Assistant Clinical Professor and Director of the nonprofit and transactional Community Enterprise Clinic at Boston College Law School. She continues to serve as an adviser and teacher for the Community Enterprise Clinic. Prior to joining Casner & Edwards in 2004, Sandy was an associate in the Corporate and Public Finance practices at the Boston law firm Mintz Levin. Before law school, she worked in varying capacities for nonprofit and political organizations around New England."},
{"DisplayName":"Warren Agin","area1":"","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/warren-agin.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Agin-335x400.jpg","SortName":"Agin, Warren","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Warren E. Agin concentrates his practice in bankruptcy and insolvency, technology and Internet law, and application of math and economics to business and commercial law. The author of the books Bankruptcy and Secured Lending in Cyberspace and The Best in E-commerce, Mr. Agin co-founded Swiggart & Agin, LLC in 1999. He is a graduate of Washington University School of Business (B.S.B.A., Minor in Economics, 1986) and Boston College Law School (J.D. cum laude, 1989). Mr. Agin is a member of the Behavioral Science and Policy Association and founding chair of the American Bar Association's Legal Analytics Joint Working Group. Formerly, he chaired the American Bar Association's Electronic Transactions in Bankruptcy Subcommittee (1999-2005), co-chaired the Boston Bar Association's Internet and Computer Law Committee (2003-2005), and served on the American Bar Association's Standing Committee on Technology and Information Services (2008-2011). Mr. Agin currently co-chairs the Editorial Board of Business Law Today. A contributing editor to Norton Bankruptcy Law and Practice, 3d, and co-author of its chapter on intellectual property for the past fifteen years, he is author of numerous legal articles and addresses on topics of technology, internet and bankruptcy law."},
{"DisplayName":"William Bagley","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/william-bagley.html","Image":"","SortName":"Bagley, William","facultyStatus":"Adjunct Faculty","priority":4,"biography":"William Bagley has worked in the field of philanthropy for over thirty years.  An attorney, his postings range from service at Choate, Yale, Boston College and The Trustees of Reservations, to work advising a Ford Foundation initiative in affordable housing, a HUD program to eliminate lead poising in children and in support of numerous other non-profit organizations. In addition, he advises individuals and foundations in the formation of their philanthropy.  Presently he directs gift planning at St. Mark's School in Southborough, MA, and writes on the topic of philanthropy for the Neiman Watchdog of the Nieman Foundation at Harvard. He took degrees from Holy Cross, Harvard and Suffolk University Law School, and, held a research fellowship at the Yale Divinity School.  His writing includes articles and policy analysis in philanthropy, and, his poems have been published by WCRB/WGBH, Garrison Keillor, America magazine and others."},
{"DisplayName":"William Baldiga","area1":"Experiential","area2":"Ethics & Professional Responsibility","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/william-baldiga.html","Image":"","SortName":"Baldiga, William","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Bill Baldiga joined Brown Rudnick in 1983 upon graduation from Boston College Law School, and has been with that Firm for all 30 years of his practice. Bill practices full time and also manages the Firm's Litigation and Restructuring Department, comprised of more than 100 lawyers in New York, Boston, DC, Orange County and London. His practice has been devoted primarily to insolvency matters, especially the representation of official creditor and equity committees in chapter 11 cases and as debtor's counsel in middle-market public and private companies. Some notable recent cases include the official creditors committee in A123 Systems ( one of the companies that obtained politically charged Deptartment of Energy grants and then failed to become economically viable), the creditors committee in New England Compounding center (the drug compounder responsible for the current epidemic of deaths and meningitis injuries resulting from contaminated injected steroids) and the official equity committee of KIT digital (an international provider of content to mobile devices). Bill looks forward very much to sharing some of his insights and lessons learned from years on the front lines in difficult chapter 11 cases as an integral part of the course. He will be teaching The Life Cycle of a Chapter 11 Restructuring in the spring."},
{"DisplayName":"Thomas A. Barnico","area1":"Administrative & Government Law","area2":"Experiential","area3":"Ethics & Professional Responsibility","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-barnico.html","Image":"","SortName":"Barnico, Thomas A.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Mr. Barnico is a visiting faculty member at Boston College Law School, teaching Administrative Law, the Legal Externship Seminar, and the Attorney General Clinical Progam and Seminar. He has directed the AG Program since 1989. In 2010-2011 and 2012-2013, he was a visiting professor at the Law School, teaching Federal Courts and Administrative Law in addition to the Attorney General Clinical Program. He also coaches the BC Law team in the Braxton Craven Constitutional Law Moot Court Competition at the University of North Carolina Law School. Mr. Barnico served as an Assistant Attorney General for the Commonwealth of Massachusetts from 1981 to 2010. He represented the state and its officers in civil cases involving constitutional law, administrative law, and business regulation. He has argued three cases in the United States Supreme Court, 18 cases in the United States Court of Appeals for the First Circuit, and 72 cases in the Supreme Judicial Court of Massachusetts. Mr. Barnico received his A.B. degree from Dartmouth College in 1977.l He received his J.D. degree from Boston College Law School in 1980. He served as an Assistant District Attorney in Essex County (MA) in 1980 and 1981."},
{"DisplayName":"Kate Billman-Golemme","area1":"Experiential","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kate-billman-golemme.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Billman-Golemme_335x400.jpg","SortName":"Billman-Golemme, Kate","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Kate joined Fitch Law Partners in 2014, after serving as a law clerk to the Honorable William J. Meade of the Massachusetts Appeals Court. Prior to her clerkship, Kate worked as an Assistant Attorney General in the Massachusetts Office of the Attorney General. At the AGO, Kate practiced administrative law, prosecuted financial crimes, and argued before various state superior courts and the Massachusetts Appeals Court. She also served as a Special Assistant District Attorney in the Roxbury Division of the Boston Municipal Court. Kate attended Boston College Law School (J.D., cum laude, 2011) and the University of Massachusetts, Amherst (B.A., summa cum laude, Phi Beta Kappa, 2003). As a law student, Kate represented clients at the Boston College Legal Assistance Bureau and served as an articles editor of the Boston College Environmental Affairs Law Review. She received the Frederic Halstrom Award for oral advocacy, along with various honors for public service, including the Massachusetts Association of Women Lawyers' Honorable Sheila E. McGovern Award, Rappaport Law & Public Policy Fellowship, and James & Lois Champy Scholarship."},
{"DisplayName":"Sayoko Blodgett-Ford","area1":"Intellectual Property & Technology Law","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/sayoko-blodgett-ford.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Blodgett-Ford-335x400.jpg","SortName":"Blodgett-Ford, Sayoko","facultyStatus":"Adjunct Faculty","priority":4,"biography":"BC Law adjunct faculty member Sayoko Blodgett-Ford is a Member and the Chief Privacy Officer at GTC Law Group PC & Affiliates.  Sayoko’s practice focuses on intellectual property strategy and transactions and data privacy and security compliance.  As Chief Privacy Officer, she is responsible for data protection policy and practices, focusing on privacy-related laws, rules and regulations. She has extensive expertise in due diligence in connection with technology M&A transactions.  Sayoko teaches Privacy Law and Mobile App Development: Legal Contributions at Boston College Law School.  Sayoko is a Lecturer in Law at the University of Hawai’i law school, where she has taught Internet Law & Policy, Intellectual Property, Contracts Drafting, High-Growth Entrepreneurship and Administrative Law, among other subjects.  Sayoko has also taught advertising law in the University of Washington IP LLM program. She previously served as general counsel of Tetris Online, Inc. and as Senior Manager of the Intellectual Property Group at Nintendo of America Inc. in Redmond, Washington.  At Nintendo, Sayoko was responsible for domestic and international intellectual property clearance, defense, registration and enforcement.  Her particular areas of focus included patent, trademark, copyright, trade secret and advertising, as well as privacy law compliance and video game ratings compliance.  Prior to Nintendo, Sayoko practiced at Foley Hoag LLP and was a law clerk for Judge Douglas P. Woodlock, U.S. District Court for the District of Massachusetts.  Sayoko holds a B.S. in Physics from the College of William and Mary, an M.S. in Physics from the University of Maryland, and a J.D. from Yale Law School."},
{"DisplayName":"S. James Boumil III","area1":"","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-boumil.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Boumil_James335x400.jpg","SortName":"Boumil, S. James","facultyStatus":"Adjunct Faculty","priority":4,"biography":"S. James Boumil III is an associate in the Litigation Department and a member of the Patent Law and Intellectual Property groups at Proskauer Rose LLP. He is registered to practice before the United States Patent and Trademark Office. James assists clients in obtaining and enforcing intellectual property rights in the U.S. and abroad. He has experience with a range of technologies including lasers, optics, electrochemical devices, medical devices, mechanical systems, electronics, semiconductor devices, communications systems, software and business methods. He also maintains an active trademark practice. In addition, James has diverse experience in a wide variety of administrative proceedings and litigation matters. His patent prosecution experience includes patent reexaminations, inter partes reviews and appeals, as well as equivalent proceedings abroad. His litigation experience spans the fields of patent, trademark, antitrust, trade secret, private equity and other complex commercial litigation areas. While in law school, James served as a legal intern at Tufts Medical Center in Boston. He assisted with the development of the center's Institutional Conflicts of Interest Policy and researched new methods of protecting its intellectual property. He also wrote for the Chicago Journal of International Law while in law school."},
{"DisplayName":"Raymond J. Brassard","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/raymond-brassard.html","Image":"","SortName":"Brassard, Raymond J.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"The Hon. Raymond Brassard is Associate Justice, Massachusetts Superior Court. Prior to his appointment to the Superior Court in 1995, Judge Brassard practiced civil litigation for nineteen years at Rackemann, Sawyer & Brewster in Boston. He is an adjunct professor at Suffolk University Law School and New England School of Law. Judge Brassard will teach Civil Motion Practice in the fall and American Jury in the spring."},
{"DisplayName":"Christopher Brown","area1":"Business Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/christopher-brown.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/brown-335x400.jpg","SortName":"Brown, Christopher","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Chris Brown is a graduate of Colgate University and Boston College Law School. While at BC Law, Mr. Brown was a member of the Boston College Third World Law Journal and participated in the Moot Court and Mock Trial Competitions. He also served as a Student Law Clerk for the Hon. Jonathan Brant in the Middlesex County District Court and was a Student Prosecutor in the Middlesex County District Attorney's Office, Appellate Division. Mr. Brown also serves as an Adjunct Professor of Entertainment Law and Sports Law at Boston College Law School and is a Certified Players Representative with the National Basketball Association Players Union. Mr. Brown has represented various artists, producers and entertainment personalities. Some of Mr. Brown's present and former clients include Octagon Sports, Major League Baseball pitcher David Wells and R&B Singer Freddie Jackson. Mr. Brown concentrates his practice in Intellectual Property, Corporate Litigation, Product Liability, Negligence Defense, Construction Law, Election Law and Sports and Entertainment Law at Brown & Rosen LLC. He will teach Entertainment Law in the Fall."},
{"DisplayName":"Richard Brunell","area1":"","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/richard-brunell.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/brunell-335x400.jpg","SortName":"Brunell, Richard","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Richard Brunell is the Vice President and General Counsel of the American Antitrust Institute. Returning to the AAI after a stint as Senior Advisor for Competition Matters at the Federal Trade Commission, Rick previously practiced in the litigation department at Foley Hoag LLP in Boston, the Massachusetts Attorney General’s Office, and at the Antitrust Division of the Justice Department. A contributing editor of the Antitrust Law Journal, Rick is the author of numerous antitrust articles and book chapters. He has testified before Congress and the Federal Trade Commission and is a frequent speaker at national and international conferences. Rick is a graduate of Swarthmore College and the Harvard Law School, where he was an editor of the Harvard Law Review. He has taught as an adjunct and visiting professor at Boston University School of Law and Boston College Law School."},
{"DisplayName":"Joseph A. Capraro Jr.","area1":"Intellectual Property & Technology Law","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-a-capraro-jr.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Capraro_Joe-335x400.jpg","SortName":"Capraro, Joseph A.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Joseph A. Capraro is a partner in the Patent Law and Intellectual Property Groups and he leads the patent and trademark prosecution and technology licensing groups at Proskauer Rose LLP. Over the course of his career, Joe has developed broad experience in connection with the protection and enforcement of intellectual property rights. He provides clients with practical legal advice across the entire spectrum of intellectual property areas, including strategic intellectual property portfolio development, patent and trademark prosecution, technology licensing, intellectual property due diligence in corporate transactions, and intellectual property litigation support. His clients include private and public emerging technology companies as well as technology start-ups. Joe spends much of his time working with companies having product offerings in the engineering arts, with particular emphasis on plasma devices, semiconductor equipment, analytical science solutions, power supplies, medical lasers, image processing devices, optical components, medical devices, alternative energy technologies, financial services, multimedia, software and telecommunications. Joe works closely with U.S. and global clients directing the strategic development of their patent and trademark portfolios. He is an experienced patent prosecutor and strategist, aggressively pursuing patent and trademark protection  on behalf of his clients in technology fields often crowded with existing patents. In addition, Joe has extensive experience with accelerated patent prosecution and post grant proceedings including inter partes review, reissue and re-examination proceedings in the United States and with patent and trademark opposition proceedings globally. He often acts as adjunct inside IP counsel to his clients, providing both intellectual property and transactional advice tailored to his clients' business and technology objectives. Over his two decade career, Joe has amassed extensive experience in this role, providing advice in support of corporate transactions, technology and intellectual property licenses, settlement agreements, research agreements, product development agreements, distribution agreements and strategic partnership agreements. Joe has participated in numerous intellectual property litigations and in alternative dispute resolution of intellectual property matters involving patents, trademarks, copyrights and trade secrets. His clients have included Hypertherm, Inc., MKS Instruments, Inc., Physical Sciences, Inc., Energetiq Technologies, Inc., Transamerica Capital Management, Earth Networks Inc. and Helius Medical Technologies, Inc. Recognized in Chambers USA, Joe is praised for his “fabulous breadth of knowledge and practicality” and “his excellent strategic advice on portfolios and patent prosecutions.” Clients say Joe “is a business-minded lawyer with knowledge of both corporate and IP issues. He provides practical advice suitable for today’s business climate. He is dependable and a straight-shooter.” Joe is a founder and contributing editor of Proskauer’s New England IP Blog."},
{"DisplayName":"Eugenia Carris","area1":"Criminal Law & Procedure","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/eugenia-carris.html","Image":"","SortName":"Carris, Eugenia","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Eugenia M. Carris received her bachelor’s degree with honors from Harvard University and is a proud graduate of Boston College Law School.  Following law school, she clerked for The Honorable Mark L. Wolf of the District of Massachusetts.  She worked as a litigation associate at Goodwin Procter.  She has extensive litigation and trial experience, having worked as a Special Assistant District Attorney and for the Massachusetts Attorney General’s Office.  She has been an Assistant United States Attorney in the District of Massachusetts since 2002, handling both civil and criminal cases on behalf of the United States."},
{"DisplayName":"Philip Catanzano","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/philip-catanzano.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/catanzano-335x400.jpg","SortName":"Catanzano, Philip","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Mr. Catanzano has worked as an attorney with the U.S. Department of Education’s Office for Civil Rights in Boston. In that role, he led investigations throughout New England concerning a wide range of issues arising in public and private schools and colleges, including the enforcement of federal statutes pertaining to harassment and discrimination based on disability, race, color, national origin, and gender. Prior to joining the Department, Mr. Catanzano was a litigator at Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, where his practice focused on intellectual property litigation. While in private practice, Mr. Catanzano also dedicated a substantial amount of time to the firm’s pro bono efforts, representing indigent clients in due process hearings, immigration asylum proceedings, and other matters in the Massachusetts state and federal courts. In addition, he has drafted amicus briefs to the Massachusetts Supreme Judicial Court regarding the privacy rights of sexual assault victims. He currently serves on the Supreme Judicial Court’s Standing Committee on Pro Bono Legal Services and as a steering committee member of the Boston Bar Association’s Civil Rights-Civil Liberties Section. Mr. Catanzano graduated from Boston College Law School and holds a Masters Degree from the Lynch School of Education at Boston College. He taught legal research and writing at Northeastern University School of Law from 2006-2012 and he has been teaching at the Lynch School of Education and Boston College Law School since September 2011."},
{"DisplayName":"Paul A. Chernoff","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paul-chernoff.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Chernoff_335x400.jpg","SortName":"Chernoff, Paul A.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Honorable Paul A. Chernoff has been on the BC Law School Adjunct Faculty teaching Trial Practice since 1990. He received a BSME (mechanical engineering) degree, from Tufts University in 1961 and a JD from George Washington University Law School (with honors) in 1967. Judge Chernoff has been a Justice of the Massachusetts Superior Court since 1985. He was Justice of the Newton District Court from 1976-1985, and Chairman of the Massachusetts Parole Board from 1972-1976. He served as a Staff Attorney in the Public Defender Service for the District of Columbia from 1965 to 1968, and was a Commissioned officer in the U.S. Coast & Geodetic Survey. Teaching positions include 1990 to present Boston College Law School adjunct faculty; 1986-present MCLE trial advocacy program; 1986 - present National Judicial College faculty teaching criminal procedure, sentencing, search and seizure and scientific and expert evidence. Judge Chernoff is the Chairperson of the Superior Court Judicial Education Committee and the Massachusetts Representative and vice-president of the Russian American Rule of Law Consortium (RAROLC). He was recently awarded the 2004 Tufts University Career Achievement Award. Recent Publication include' Judges and the Media: Communication, Communication, Communication' Sept.-Oct. 2004 Boston Bar Journal."},
{"DisplayName":"Jennifer Connor","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jennifert-connor.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Connor-Jennifer-335x400.jpg","SortName":"Connor, Jennifer T.","facultyStatus":"Adjunct Faculty","priority":4,"biography":""},
{"DisplayName":"Thomas Connors","area1":"","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-connors.html","Image":"","SortName":"Connors, Thomas","facultyStatus":"Adjunct Faculty","priority":4,"biography":""},
{"DisplayName":"Daniel Crane","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-crane.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Crane_335x400.jpg","SortName":"Crane, Daniel","facultyStatus":"Adjunct Faculty","priority":4,"biography":""},
{"DisplayName":"John C. Cratsley","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/john-cratsley.html","Image":"","SortName":"Cratsley, John C.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"The Hon. John C. Cratsley is an Associate Justice of the Superior Court of the Commonwealth of Massachusetts. 1987 to present Chief, Public Protection Bureau, Department of the Attorney General 1983-1987; Judge of Roxbury DistrictCourt; 1973-1983 Member, Massachusetts Parole Board; 1972-1973 Staff Attorney, Cambridge and Somerville Legal Services and its predecessor, the Community Legal Assistance Office, Judge Cratsley received his LLM from the Georgetown University Law Center in 1968, his JD from the University of Chicago Law School in 1966, and his BA from Swarthmore College in 1963."},
{"DisplayName":"Kevin Curtin","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kevin-curtin.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Curtin-335x400.jpg","SortName":"Curtin, Kevin","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Kevin Curtin is Senior Appellate Counsel for Middlesex District Attorney Gerard T. Leone, Jr. He has tried approximately 100 jury cases and handled over 100 criminal appeals. Mr. Curtin is also an instructor in the Harvard Law School Trial Advocacy Workshop and a faculty member of the national trial Advocacy College at the University of Virginia School of Law. Mr. Curtin is a 1988 graduate of Boston College Law School and served as a judicial law clerk to the Hon. William G. Young of the United States District Court for the District of Massachusetts, from 1988-1989."},
{"DisplayName":"Rosemary Daly","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/rosemary-daly.html","Image":"","SortName":"Daly, Rosemary","facultyStatus":"Adjunct Faculty","priority":4,"biography":""},
{"DisplayName":"Joseph Darby","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-darby.html","Image":"","SortName":"Darby, Joseph","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Joseph B. Darby III is a partner in Sullivan & Worcester's Boston office, focusing his practice on business and transactional tax law. Mr. Darby advises a wide variety of corporations and high-net-worth individuals on tax and legal aspects of business and real estate activities and represents these taxpayers before federal and state taxing authorities. He also works with high-net-worth individuals and business owners to organize their personal income tax and estate planning affairs in order to maximize wealth preservation and minimize tax on transfers to family members, charities and other recipients. This is accomplished through the use of the latest sophisticated estate planning strategies, including family limited partnerships, installment sales to defective grantor trusts, the formation of family charitable foundations, and other similar techniques."},
{"DisplayName":"Harlan Doliner","area1":"Environmental Law","area2":"Real Estate Law","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/harlan-doliner.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Doliner-335x400.jpg","SortName":"Doliner, Harlan","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Harlan Doliner is a partner in the environmental group in the Boston office of the law firm of Pepe & Hazard LLP, and an adjunct faculty member for the Law Schools at Boston College and Roger Williams University. His diverse practice focuses on strategic environmental risk-assessment, management and regulatory compliance and enforcement defense; maritime security/environment/technology issues; complex facility siting; waterfront re-development; real estate and corporate transaction risk evaluation and support; hazardous waste site reuse and the full spectrum of land use issues and permitting. Mr. Doliner has also written and taught courses for undergraduate and graduate students, governmental officials, industry leaders, lawyers and environmental professionals in the areas of maritime security, coastal project development, environmental impact and ecological risk assessment, wetlands, and fisheries and wildlife. Harlan has made major presentations on these and other subjects in the United States, Canada and the United Kingdom. In 2006, publisher ReedLogic released the DVD Coastal & Maritime Security and Environmental Compliance in the Post 9/11 World featuring Mr. Doliner. His peers elected him a Massachusetts SuperLawyer in 2004, 2005, 2006, 2007, 2008 and 2009; and a New England SuperLawyer in 2007 and 2009. Mr. Doliner has participated in major appellate and other court cases which helped shape the law of coastal development, environmental impact reporting, water and air quality, and wetlands protection. He has long made marine transportation, maritime security/risk assessment, coastal projects and waterfront redevelopment focal points of his law practice. From 1983 - 1998, Mr. Doliner was a lead counsel in the federal, state and administrative matters dealing with the clean up of Boston Harbor, including negotiating the required water-borne transport of personnel and materials to and from Deer Island. From 1986-1993, he was a lead counsel in the legislative, state and administrative matters relating to the proposed co-generation facility at Quonset Point, Rhode Island. Mr. Doliner serves in the U.S. Coast Guard Auxiliary as a Division Vice-Commander and Marine Safety and Environmental Protection staff officer for Sector Boston. Successfully completing the course and examination administered by the British Standards Institution, Mr. Doliner is certified in the implementation of ISO-14000 series environmental management systems."},
{"DisplayName":"James Dowden","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-dowden.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Dowden-335x400.png","SortName":"Dowden, James","facultyStatus":"Adjunct Faculty","priority":4,"biography":"James P. Dowden received his Bachelor of Arts degree magna cum laude from Boston College where he was elected to Phi Beta Kappa. He received his J.D. from Boston College Law School summa cum laude, was Articles Editor of the Boston College Law Review, and won the James W. Smith Award for the highest academic achievement in his class. Following law school, Mr. Dowden clerked for the Hon. Anthony Scirca, now Chief Judge of the Third Circuit in Philadelphia Pennsylvania as well as Associate Justice Stephen Breyer during the OT 04-05 term. Following his clerkships, Mr. Dowden was an Assistant United States Attorney with the U.S. Attorney's Office for the District of Massachusetts. He is currently an Associate in the Litigation Department at Ropes & Gray."},
{"DisplayName":"Dennis Duffy","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/dennis-duffy.html","Image":"","SortName":"Duffy, Dennis","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Dennis has more than thirty years of experience as an energy attorney in New England. He has represented a wide array of energy clients, including interstate gas pipeline companies, electric distribution companies, gas distribution companies, water utilities and telecommunications companies. He has also served as special counsel to the Rhode Island Energy Facility Siting Board. He was formerly a partner of the law firm of Partridge, Snow & Hahn and the Chair of the firm’s Public Utility Practice Group. For the past eight years, Dennis has served as Chair of the Generator Information System Working Group of the New England Power Pool, which oversees the mechanisms for issuing and tracking tradable certificates reflecting the attributes of all energy consumed within the New England control area. Dennis' work with EMI began in 1988 as outside counsel representing EMI interests in the Dartmouth, Pepperell, Pawtucket, Tiverton, Rumford, and Dighton power projects including development, permitting, financing and litigation matters. He joined the EMI team in 1999 as Vice President of Regulatory Affairs and has worked on the Cape Wind project since its inception. Dennis manages regulatory and legislative affairs, legal strategy and industry trade group relations for the Cape Wind project. Dennis is also an adjunct professor at Boston College Law School, where he is currently teaching a course on energy law. Dennis is a graduate of Columbia University Law School."},
{"DisplayName":"Michael Fatale","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/michael-fatale.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Fatale_335x400.jpg","SortName":"Fatale, Michael","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Michael T. Fatale was recently appointed the Deputy General Counsel at the Massachusetts Department of Revenue (DOR) where he has been employed since 1992. Previously he was for nearly ten years the Chief of DOR’s Rulings and Regulations Bureau, and prior to that he was a tax counsel. Mr. Fatale is the primary author of numerous state tax regulations and other DOR pronouncements, and has litigated or co-litigated several high-profile DOR cases. He is the author of several law review articles on constitutional and federal preemption law that have been cited in various state tax cases, including cases decided by the Iowa and West Virginia Supreme Courts and the New Mexico and California Courts of Appeal. For 2015, he received “honorable mention” as the state tax government person of the year from the Tax Analysts’ publication State Tax Notes. In 2012, he was awarded the Paull Mines Award for Outstanding Contribution to State Tax Jurisprudence by the Multistate Tax Commission. In 2005, The Boston Globe reported on his leadership role in obtaining a large settlement in a bankruptcy case on behalf of eighteen states (“Hooray for the Taxman”). Mr. Fatale speaks frequently at state tax conferences, has previously been a guest lecturer at Georgetown University Law School, and is an instructor of state corporate income tax in a training program offered by the Multistate Tax Commission. Mr. Fatale worked in private practice before joining DOR and holds an undergraduate degree from Columbia University and a law degree, cum laude, from Boston College Law School."},
{"DisplayName":"Paul Faxon","area1":"","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paul-faxon.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Faxon_Paul-335x400.jpg","SortName":"Faxon, Paul","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Paul has represented parties to one of the first successful applications nationwide of Collaborative Law in the civil arena. Paul has overseen the legal aspects of well over 400 real estate transactions, from the purchase of shopping centers and acquisition/development/sell-out of residential subdivisions, to negotiating multiple leases for office complexes. In the area of corporate law, he has represented various service, high-tech and manufacturing businesses from forming corporations and limited liability companies, to negotiating the terms of equity investments in closely-held businesses and acquiring privately held corporations. Paul has built on all my experiences when he facilitates the division and restructuring of closely-held real estate enterprises, especially family business; Paul finds the principles of collaborative law particularly helpful when resolving a dispute among parties with this type of on-going relationship. He has learned that each engagement provides a valuable opportunity for a synergy between the client and himself. Prior to joining The New Law Center, LLC and Archstone Law Group P.C. as of Counsel, he was a founding partner of Faxon & Laredo, LLP. Paul is a team member at Continuity Family Business Consultants. He is a graduate of Amherst College, B.A., magna cum laude; and Northwestern University School of Law, J.D., cum laude. His professional memberships include serving as a member of the board of directors of the Massachusetts Collaborative Law Council, Inc. and its President in 2009. Paul belongs to the IACP and MCLC Civil Practice Protocols Committees. He is a member of the Massachusetts Bar Association, the Massachusetts Real Estate Bar Association and the Family Firm Institute. He also is a manager of several family and closely held real estate limited liability companies. Paul is an author or co-author of articles published in Harvard Negotiation Law Review, Massachusetts Law Review, Massachusetts Lawyers Weekly, Banker and Tradesman, New England Real Estate Journal, Boston Business Journal, Northwestern Journal of International Law and Business, and Massachusetts Collaborative Law Journal. He has spoken at continuing legal education programs, including events sponsored by the IACP, MCLC, Boston Bar Association, New England Corporate Counsel Association, Massachusetts Continuing Legal Education, Inc., CCIM Association, Northeast Builders Association and Building Owners and Managers Association."},
{"DisplayName":"Mithra Fernandez-Kahn","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mithra-fernandez-kahn.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Fernandez-Kahn_335x400.jpg","SortName":"Fernandez-Kahn, Mithra","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Mithra Fernandez-Kahn, a legal services attorney at Greater Boston Legal Services, has spent her entire career working with low-income battered women. As a Georgetown Women & the Law Public Policy Fellow in Washington DC she started her career serving as a clinical instructor in the Georgetown University Law Center's Sex Discrimination Clinic and since then has combined advocacy and teaching. Currently, she directs the Latinas Know Your Rights Project, an innovative, multidiscipliniary partnership working with Latina immigrant women who have experienced domestic violence.  She represents clients in family law, immigration, benefits and other civil cases.  Ms. Fernandez-Kahn is a graduate of Barnard College and Harvard Law School."},
{"DisplayName":"Scott FitzGerald","area1":"Immigration Law","area2":"Experiential","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/scott-fitzgerald.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Fitzgerald-335x400.png","SortName":"FitzGerald, Scott","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Scott J. FitzGerald is the Managing Partner of the Boston, Massachusetts office of Fragomen, Del Rey, Bernsen & Loewy LLP, and a Managing Director of Fragomen Immigration Services India Pvt., Ltd. Mr. FitzGerald has previously served as the Managing Partner of the firm's Washington D.C. and Vienna, Virginia offices, as well as an Associate in the firm's New York office. He is admitted to practice law in Massachusetts, New York, Connecticut and Washington D.C., and is a member of the Labor Relations Committee of the United States Chamber of Commerce, and the U.S. India Business Council. He is also a member of the American Bar Association, the Federal Bar Association, the Association of the Bar of the City of New York, and the American Immigration Lawyers Association. Mr. FitzGerald also serves on the Board of the Council for Emerging National Security Affairs (CENSA). Mr. FitzGerald lectures and writes frequently on business immigration issues. He is a graduate of the Johns Hopkins University (B.A., International Studies) and Fordham University School of Law (J.D.)."},
{"DisplayName":"Lawrence Gennari","area1":"Experiential","area2":"Ethics & Professional Responsibility","area3":"Corporate & Securities Law; Business Law;","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/lawrence-gennari.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/gennari-335x400.jpg","SortName":"Gennari, Lawrence","facultyStatus":"Adjunct Faculty","priority":4,"biography":"A veteran of one of Boston's largest law firms, Lawrence Gennari co-founded Gennari Aronson LLP, to serve innovative companies, entrepreneurs and the investors and venture capital firms that finance them. He advises both public and private companies on all major areas of corporate and securities law. Mr. Gennari counsels entrepreneurs and public and private companies on a wide variety of issues including business and tax planning, financing strategy, negotiation, documentation and coordination of public and private equity transactions, initial and secondary public offerings, private and public mergers, acquisitions, strategic partnerships and management buyouts. He also has significant experience in counseling public companies on proxy contests and takeover defensive measures. Mr. Gennari received a B.S. in Accounting from North Adams State College (summa cum laude) and a J.D. from the College of William and Mary, where he served as editor-in-chief of the William & Mary Law Review."},
{"DisplayName":"Edward Ginsburg","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/edward-ginsburg.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Ginsburg_335x400.jpg","SortName":"Ginsburg, Edward","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Judge Ginsburg is a graduate of Harvard College, and Harvard Law School. He was an Associate Justice of the Probate and Family Court from 1977until 2002. He is the founder and director of Senior Partner for Justice, a group of over seven hundred lawyers who provide pro bono legal services to low income individuals in the Probate and Family Court and elsewhere. He is also a supervising attorney at The Legal Assistance Corporation of Central Massachusetts. He teaches Family Court Practice and Trial Practice."},
{"DisplayName":"Ericka Gray","area1":"Experiential","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ericka-gray.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Gray_335x400.jpg","SortName":"Gray, Ericka","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Ericka Gray has been a full-time dispute resolution professional since 1987 and has been providing conflict management, mediation, training and consulting services since 1985. In addition to providing mediation services, she consults to a number of corporations, employee assistance programs, government and non-profit organizations to provide management consulting, conflict intervention, training, and dispute resolution systems design services relating to communication, interpersonal, and workplace issues. Ericka is the founder and President of DisputEd and is one of three principals of OptionBridge, LLC, which has offices in New Hampshire, Boston, Hartford, and Chicago. Ericka served on the Massachusetts Trial Court Standing Committee on Dispute Resolution and was a convener of the MassUMA Working Group to review mediation legislation in the Commonwealth. She previously served as the director of two multi-door courthouses, in Cambridge, MA and in Burlington County, NJ, was a senior mediator, directory of professionals services, and regional training manager for Endispute/JAMS Boston. She also was the executive director of the Academy of Family Mediators, and has maintained a full-time private practice since 1998. She has mediated a range of disputes from commercial to family, with a concentration in employment and complex family issues. She is a licensed psychologist."},
{"DisplayName":"Allan M. Green","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/allan-green.html","Image":"","SortName":"Green, Allan M.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Dr. Allan M. Green, M.D., Ph.D., J.D., serves as Co-Managing Director of SDG, LLC. Dr. Green has been Of Counsel to the law firm of Greenberg Traurig LLP since 2002 and is an Advisor of Obecure Ltd. He is a Principal in Ground Fluor Pharmaceuticals, Inc., and Co-Managing Director of SDG, LLC, in Cambridge, Massachusetts, a consulting organization supporting the U.S. Food and Drug Administration ( FDA )-regulated industry. Through his position at SDG, LLC, since 2011, he has advised it regarding FDA regulatory requirements for two of its products. He has been actively involved in several start-up ventures in the pharmaceutical industry. His legal practice focuses on the needs of the FDA-regulated industry. He serves as external counsel to a number of nonprofit foundations and hospitals involved in medical research. He is Adjunct Professor of Law and teaches Food and Drug Law at Boston College Law School. He co-founded Immune Control Inc. in 2001. He is a physician, lawyer and research scientist with experience as an Operating Officer in the pharmaceutical industry. He has 30 years' experience developing new drug products and specific experience in the development of new anti-retroviral drugs to the Board. Additionally, he has his FDA knowledge on the regulation of new drug products. He served as the Chief Technology Officer of North American Scientific Inc., since April 2002. Prior thereto, he served as the President of Theseus Imaging Corporation. He served as President of Neuroptix, Inc. From 1991 to 2002, he served as Vice President of Pharmaceutical and Biomedical Products for ML Strategies Inc., and Of Counsel to the law firm of Mintz, Levin, Cohn, Ferris, Glovsky and Popeo P.C. He served as the President of the Biotechnology Data Group in Cambridge, Massachusetts from 1986 to 1990, and as a consultant to many major pharmaceutical companies and investors in the pharmaceutical industry. Dr. Green served as Medical Director of New England Nuclear/DuPont Medical Products from 1975 to 1981 and was Chief of Nuclear Medicine, University Hospitals, Boston, from 1983 to 1986. He was an Instructor at Harvard Medical School and on the medical staffs of Massachusetts General Hospital and Boston Medical Center. Dr. Green is the author of many scientific papers in biochemistry and drug development. He has been a practicing physician and is board certified in internal medicine and nuclear medicine. Dr. Green received his B.S. in economics in 1966 and his Ph.D. in biochemistry and metabolism in 1971, both from the Massachusetts Institute of Technology. He received his M.D. from Case Western Reserve University School of Medicine in 1972 and holds Board certification in both Internal Medicine and in Nuclear Medicine. He received his J.D. from Boston College Law School in 1991."},
{"DisplayName":"Pamela Holleman","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/pamela-holleman.html","Image":"","SortName":"Holleman, Pamela","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Pamela Smith Holleman is Senior Corporate Counsel for E Ink Corporation, where she represents the company in a broad variety of transactional matters, including drafting and negotiation of contracts and advising on contract enforcement and disputes, and provides the company with legal support on various business ventures, mergers and acquisitions, litigation and enterprise risk management. Before joining E Ink, she practiced in the Bankruptcy Practice Group and Litigation Department of Sullivan & Worcester LLP from 1998-2014 (as a partner from 2007-2014). She holds a J.D. from Boston College Law School, an MBA from New York University Stern School of Business, and a Master of Arts in Political Science from the University of Chicago. Before attending law school, Ms. Holleman served as Group Manager, Contract Administration, Ingersoll-Rand Company, managing the contracting activities of the company’s Process Systems Group worldwide."},
{"DisplayName":"Stuart M. Hurowitz","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/stuart-hurowitz.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Hurowitz_335x400.jpg","SortName":"Hurowitz, Stuart M.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Stuart Hurowitz is a Staff Attorney with the Committee for Public Counsel Service's Superior Court Office in Worcester (but has also been with CPCS in both Suffolk and Norfolk Counties). Mr. Hurowitz began his legal career in 1992 at the New Hampshire Public Defender's Office, after having graduated from Boston University School of Law. He spent the next seven and one-half years as a New Hampshire public defender, the last three and one-half as the managing attorney of the Nashua branch office. Leaving NHPD in December 1999, Mr. Hurowitz went to Montenegro (then still a part of Yugoslavia) to work on a wide range of legal reform projects as an American Bar Association's Central and East European Law Initiative's (ABA-CEELI) criminal law liaison. Over the years since his repatriation, he has completed teaching stints for the criminal practice clinic at Boston University School of Law, Boston College Law School, Suffolk University Law School (in the juvenile defender clinic), and Franklin Pierce Law Center in Concord, NH. Mr. Hurowitz is a regular adjunct professor at Boston College Law School, having taught 'Introduction to Lawyering and Professional Responsibility,' Evidence, and Professional Responsibility. He also teaches at BU School of Law as an adjunct teaching Professional Responsibility in the criminal practice clinic."},
{"DisplayName":"Ilana Hurwitz","area1":"Criminal Law & Procedure","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ilana-hurwitz.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Hurwitz_2_335x400.jpg","SortName":"Hurwitz, Ilana","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Ilana Hurwitz holds a B.A. and LL.B. cum laude from the University of Witwatersrand, South Africa, a J.D. cum laude from Suffolk Law School and an LL.M. from Harvard Law School. Professor Hurwitz has an extensive background as a practitioner in the areas of family law and probate litigation. She was a Fulbright Scholar at Harvard, and served as a law clerk for Judge Rya W. Zobel of the United States District Court for the District of Massachusetts. Ms. Hurwitz is a Visiting Professor at Boston University School of Law. She also supervises students in Harvard Law School's Advocates for Human Rights program and advises refugees on career development at Boston Center for Refugee Health and Human Rights at Boston Medical Center. She will be a Visiting Professor at Boston College Law School teaching Trusts and Estates Survey in the fall."},
{"DisplayName":"Susan Simone Kang","area1":"International & Comparative Law","area2":"","area3":"","acfacAreas":"","URL":"http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/susan-simone-kang.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/kang-335x400.jpg","SortName":"Kang, Susan Simone","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Susan Simone Kang is the Director of Graduate Legal Education and International Programs, managing the International Visiting Scholars Program, the LL.M. Master of Laws Program and international law student exchange relationships. Director Kang is also the Co-Director of the BC Law Summer Institute: Foundations of U.S. Law and Practice. Director Kang was in private practice for nine years in Boston based international and regional law firms, focusing on the fields of mergers and acquisitions, international corporate finance and multijurisdictional bankruptcies. Director Kang is also a certified mediator, and has volunteered in Boston area district courts. In 2017, Director Kang co-authored Resolution 10b of the American Bar Association and its related report on the detention of judges and prosecutors under the U.N.’s ICCPR and the European Convention on Human Rights. Director Kang is a member of the New York, Massachusetts and Connecticut bars and speaks Italian, French and Spanish. She is a member of the ABA, the American Society of International Law and the Boston Bar Association."},
{"DisplayName":"Glenn Kaplan","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/glenn-kaplan.html","Image":"","SortName":"Kaplan, Glenn","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Glenn Kaplan is an adjunct faculty member at Boston College Law School, teaching Consumer Law. He has taught this course at BC Law since 2012. Glenn’s prior experience as an educator also includes teaching courses in Securities Regulation and Consumer Protection at New England Law, and Antitrust at Suffolk Law School. Glenn serves as the Chief of the Insurance and Financial Services Division in the Massachusetts Attorney General’s Office, where he oversees investigation and litigation of consumer protection and false claims cases against banks, investment companies, and insurance carriers, as well as administrative rate setting cases relating to various lines of insurance. Mr. Kaplan also handles state investigations and actions relating to for-profit schools, student lending, mortgage, auto and student loan securitization, financial services antitrust matters, and securities fraud. His cases have included actions against Microsoft Corporation, Amazon.com, Doubleclick, Goldman Sachs, Morgan Stanley, State Street, Royal Bank of Scotland, Barclay’s Bank, Countrywide Securities, LPL Financial, JPMorgan, Ameriprise, TD-Ameritrade, CitiGroup, UBS, HSBC, BNY-Mellon, Bank of America, Ocwen, Santander, Equifax, Moneygram, Western Union, Education Management Company, Corinthian Colleges, Premier Education Group, Liberty Mutual, Safety Insurance, Mapfre, and a variety of other financial services and consumer directed firms. Prior to holding his present position, Mr. Kaplan was a trial attorney at the United States Department of Justice in the Civil Fraud Division in Washington D.C., and he worked as a criminal prosecutor in Essex County. He is a graduate of Harvard Law School (J.D., magna cum laude, 1990)."},
{"DisplayName":"Robert J. Keach","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Robert-Keach.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Keach_Robert-335x400.jpg","SortName":"Keach, Robert","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Robert J. Keach is co-chair of Bernstein Shur’s Business Restructuring and Insolvency Practice Group. He is a Fellow of the American College of Bankruptcy and a Past President (2009-2010) of the American Bankruptcy Institute. Bob is also the co-chair of the ABI’s Commission to Study the Reform of Chapter 11. Bob focuses on the representation of various parties in workouts and bankruptcy cases, including debtors, creditors, creditors committees, lessors and third parties acquiring troubled companies and/or their assets. He has appeared as a panelist on national bankruptcy, lender liability and creditors rights programs, and is the author of several articles on bankruptcy and creditors’ rights appearing in the ABI Law Review, Commercial Law Journal and ABI Journal, among other publications. Keach is a contributing author to Collier Guide to Chapter 11: Key Topics and Selected Industries (2011 Ed.). He is recognized as a “Star Individual” in Corporate M&A/Bankruptcy in Chambers USA, in Best Lawyers in America (Ten-Year Certificate), and by New England Super Lawyers (Bankruptcy and Top 100 Lawyers in New England regardless of specialty). Bob is also certified in business bankruptcy by the American Board of Certification. Currently, Bob serves as the chapter 11 trustee in the railroad reorganization case of Montreal Maine & Atlantic Railway, Ltd., a cross-border restructuring case. Bob is also the fee examiner in the Exide Technologies case in Delaware; he was also the fee examiner in In re AMR Corporation (the chapter 11 cases of American Airlines and its parent and certain affiliates). Bob has also, inter alia, represented ad hoc committees in the Homebanc Mortgage, New Century TRS Holdings, and Nortel Networks cases in Delaware, as well as a public utilities commission in the FairPoint Communications case in the Southern District of New York."},
{"DisplayName":"David Koha","area1":"Business Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-koha.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/koha-335x400.jpg","SortName":"Koha, David","facultyStatus":"Adjunct Faculty","priority":4,"biography":"David Koha is an associate at Casner & Edwards, LLP.  His practice focuses on business and consumer bankruptcy law, including litigation and appeals.  He has experience in many aspects of bankruptcy practice, and represents debtors, creditors, trustees, and defendants in preference and fraudulent transfer litigation.  David is a graduate of Boston College Law School, magna cum laude, and received his B.A. from Boston College.  He served as Note Editor on the Boston College Law Review. David has published several articles on bankruptcy topics, including most recently 'The Meaning of Rejection in Intellectual Property Contracts and Beyond After Sunbeam' (December 2012 Norton Journal of Bankruptcy Law & Practice).  He previously taught as an adjunct professor at New England School of Law."},
{"DisplayName":"Joseph LaPlante","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-laplante.html","Image":"","SortName":"LaPlante, Joseph","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Joseph Laplante has been the Chief Judge of the U.S. District Court for the District of NH since 2011.  He was nominated and confrmed to the federal bench in 2007.  He attended Nashua (NH) High School, and went on to Georgetown University, earning an A.B. cum laude in American Studies in 1987, and his J.D. cum laude from Georgetown Law in 1990.  After several years with the Manchester, NH law firm of Wiggin & Nourie, Judge Laplante began his career in public service with the New Hampshire Attorney General’s Office, serving as an Attorney, then Assistant Attorney General and, ultimately, Senior Assistant Attorney General in its White Collar Crime Unit and (then new) Homicide Unit.  From 1998 to 2000, Laplante worked with the U.S. Department of Justice’s Criminal Division in the Public Integrity Section as a member of the Campaign Financing Task Force, where he tried cases and argued appeals in Washington, D.C. and Los Angles, CA.  In 2000, he became an Assistant United States Attorney with the U.S. Attorney’s Offices in Boston, and then Concord, NH, primarily working on the New England Organized Crime Drug Enforcement Task Force, and eventually serving as First Assistant United States Attorney.  He is a member of the adjunct faculty (teaching Statutory Interpretation) of University of New Hampshire School of Law, and serves on several court governance committees in the U.S. Judiciary.  He is a boxing referee, licensed to officiate both professional and amateur bouts.  Judge Laplante will teach Statutory Interpretation in the fall."},
{"DisplayName":"Christine Leonard","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/christine-leonard.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/leonard-335x400.jpg","SortName":"Leonard, Christine","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Christine Leonard teaches the BC in DC Program and is an adjunct faculty member at BC Law. She has over 15 years of experience working to improve the country’s justice system from both the executive and the legislative branches of the federal government—in addition to corporate and nonprofit experience. From her past roles in the House, Senate and the White House, she has a solid record of legislative accomplishments that resulted in meaningful reform of the criminal justice system. She is an expert in legislative policy and well-versed in finding common ground with parties from diverse perspectives and interests. Currently, she is serving as the Director of the Office of Legislative and Public Affairs for the U.S. Sentencing Commission. Previously in 2015, she spearheaded the launch of the Coalition for Public Safety, an unprecedented alliance of progressive and conservative funders and national organizations working together on criminal justice reform."},
{"DisplayName":"Howard Levine","area1":"Environmental Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/howard-levine.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Howard-335x400.jpg","SortName":"Levine, Howard","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Mr. Levine's practice includes representation of commercial and not for profit real estate developers, retailers, and educational institutions. His work is focused in Land Use Planning, Zoning, Municipal Law, and the acquisition and sale of real estate.  From 1966-1968, Mr. Levine served as an officer in the United States Army.  He served in the Republic of South Vietnam from August, 1967 through August, 1968 for which he was awarded the Bronze Star Medal.  He served as an attorney in the City of Newton Law Department from 1970 through 1978.  He was He was the Assistant City Solicitor (1970 to 1973), and the City Solicitor, responsible for all legal matters for all City Departments, Agencies and Officials, from 1973-1978. While City Solicitor, Mr. Levine was an active member and regional officer of the National Institute of Municipal Law Offices (NIMLO), Chairman of various of its Committees, and a contributor and participant in its national seminars and publications. In 2002, Mr. Levine resigned as a K&L Gates Partner and he became Of Counsel so that he could accept an appointment as an Adjunct Professor of Law at Boston College Law School.  Mr. Levine continues to teach Real Estate Development and Finance and Local Government Law at the Law School.  He also supervises Independent Study Programs in Real Estate Development and Finance, and in Municipal and Local Government Law. Mr. Levine is one of the four founders and original Directors of the New England Shelter for Homeless Veterans (The Vietnam Veterans Workshop, Inc.), a non-profit charitable corporation. Located in a nine-story building at 17 Court Street in Boston, the former V.A. Outpatient Clinic, the Shelter houses 150 homeless veterans each evening and counsels, feeds and help to rehabilitate up to 500 veterans each day. The Shelter is recognized as a national model and was awarded President Bush's 142nd Point of Light. Mr. Levine served as Director of the Newton Community Service Center, is a Trustee of the Newton Cemetery Corporation, an overseer of the Newton-Wellesley Hospital, a past-chairman of the Community Advisory Board of PBS's WGBH, a member of the Board of the Newton Historical Society, and an overseer of PBS's WGBH. Mr. Levine is a graduate of Bowdoin College and Boston University Law School."},
{"DisplayName":"Erin Macgowan","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/erin-macgowan.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/macgowan-335x400.jpg","SortName":"Macgowan, Erin","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Erin Macgowan is an Associate in the Litigation Department of Ropes & Gray, LLP. She received her Bachelor of Science and Masters in Elementary Education degrees from the University of New Hampshire. After several years as an elementary school teacher, she attended law school. She received her J.D. summa cum laude from Boston College Law School in 2012. While at Boston College Law School, she was Editor-in-Chief of the Boston College Law Review. Following law school, she clerked for the Hon. Judge Selya of the United States Court of Appeals for the First Circuit."},
{"DisplayName":"David Mackey","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-mackey.html","Image":"","SortName":"Mackey, David","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Dave represents private and governmental clients in litigation, regulatory and administrative matters. Previously, he worked at Massport, as Chief Legal Counsel (2001-2013) and Interim CEO (2011-2012). While at Massport, Dave managed the successful defense of multi-billion dollar litigation stemming from the 9/11 attacks, and of nine lawsuits challenging a new Logan Airport runway. David Mackey represents clients in high-profile matters. Recent examples include the defense of the Massachusetts Gaming Commission in multiple lawsuits brought to challenge the Commission’s casino licensing decisions, the defense of the MBTA in a consumer class action seeking damages for storm-related disruptions in commuter rail service, a petition for judicial review against the TSA on behalf of airport trade associations and 24 airport clients, and representation of the Martha’s Vineyard Airport Commission in a sovereignty dispute with Dukes County over Martha’s Vineyard Airport. Dave also advises clients in governmental enforcement and regulatory matters, and has significant experience with internal investigations. He was recently Chair of the Board of Bar Overseers, and lectures frequently on legal ethics. Prior to Massport, Dave was Chief of the Civil Division and then First Assistant U.S. Attorney at the U.S. Attorney’s Office in Boston. Dave had previously been a partner in Goodwin Procter’s Trial Department."},
{"DisplayName":"Helen MacLeod","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/helen-macleod.html","Image":"","SortName":"MacLeod, Helen","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Helen Chae MacLeod is a commercial litigator who, after completing a judicial clerkship with the U.S. Court of Appeals for the Eighth Circuit, has developed her legal practice among the professionals at Quinn Emanuel, Wilson Sonsini Goodrich & Rosati, Howrey LLP, and Oracle Corporation. Her experience includes handling disputes in a wide variety of substantive areas -- such as contracts, business torts, employment, real estate, securities, patent, copyright, environmental, and consumer fraud -- and in all stages of litigation, including both state and federal trials and appeals. Currently, Ms. MacLeod combines work as a freelance attorney with a teaching position in the first-year legal writing program at the University of Southern California Gould School of Law. Ms. MacLeod received a B.A. in economics from Haverford College, and a J.D. from the University of Minnesota Law School, where she served as Managing Editor of the Minnesota Law Review. She will teach Advanced Legal Writing in the fall."},
{"DisplayName":"Thomas F. Maffei","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-maffei.html","Image":"","SortName":"Maffei, Thomas F.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Thomas F. Maffei is a litigation partner at Sherin & Lodgen, LLP in Boston. He has extensive experience in civil litigation, including legal malpractice cases, bar disciplinary matters and business litigation cases. Mr. Maffei often acts as a mediator or arbitrator and has been retained as an expert witness on civil litigation and legal ethics issues. He is a Fellow of the American College of Trial lawyers and is listed in Top 100 New England Super Lawyers, New England’s Best Lawyers and The Best Lawyers in America. Mr. Maffei teaches professional responsibility and dispute resolution at Boston College Law School and professional responsibility at Suffolk Law School. He has lectured and written extensively on a variety of legal topics concerning litigation, trial practice, professional ethics and lawyer discipline issues. Prior to joining Sherin & Lodgen, Mr. Maffei practiced law at his own firm, Griesinger, Tighe & Maffei, LLP. Prior to starting his own firm in 2000, Mr. Maffei was a partner at one of Boston’s large law firms. Mr. Maffei is a former President of the Massachusetts Bar Association and a past member of the Massachusetts Board of Bar Overseers. He is a former member of the Chief Justice’s Commission on the Future of the Courts and of the Civil Trial Court Advisory Committee. He is a Life Fellow of the Massachusetts Bar Foundation and a trustee of Massachusetts Continuing Legal Education, Inc., and has also served as a member of the American Bar Association House of Delegates. Mr. Maffei graduated with honors from Boston College in 1968 and earned his law degree with honors from Boston College Law School in 1971. Following graduation, he clerked for Chief Justice Edward F. Hennessey of the Supreme Judicial Court."},
{"DisplayName":"Michael F. Mahoney","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/michael-mahoney.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/mahoney-335x400.jpg","SortName":"Mahoney, Michael F.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"A graduate of Boston College Law School ('96), Attorney Mahoney is the principal of the Law Offices of Michael F. Mahoney, P.C., a multi-faceted Plaintiff-oriented personal injury practice with full staff, associates, and attorney of counsel. Areas of practice include motor vehicle accidents, spinal cord/brain injuries, product liability, premises liability, dram shop liability, slip and fall, medical malpractice, nursing home negligence and sexual abuse litigation. Since opening his practice, Attorney Mahoney has tried cases in state and federal court, argued before the Massachusetts Supreme Judicial Court and has obtained numerous multi-million dollar settlements, arbitration awards and judgments in numerous complex personal injury cases. Attorney Mahoney has been featured and profiled by The Boston Globe, Fox News, WBZ Radio, Lawyer's Weekly, and New Mobility Magazine, amongst others."},
{"DisplayName":"Bethany Mandell","area1":"Real Estate Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/bethany-mandell.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Mandell-335x400.jpg","SortName":"Mandell, Bethany","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Bethany (Bee) S. Mandell has practiced immigration law exclusively for over 16 years. She has extensive experience in employment and family based immigration matters and is an active speaker on immigration issues. She represents clients ranging from multinational corporations to start ups, financial, medical and educational institutions, and executives and individuals from across the globe. "},
{"DisplayName":"Jeremy Marr","area1":"Experiential","area2":"Corporate & Securities Law","area3":"Business Law","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jeremy-marr.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Marr-335x400.jpg","SortName":"Marr, Jeremy","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Mr. Marr is a member of the Technology Transactions and Licensing Practice in the Boston office of the international law firm, WilmerHale, where his practice focuses on advising clients on technology transactions and licensing matters in the life sciences, information technology, electronics and entertainment sectors. Mr Marr negotiates and advises clients on collaboration, joint venture, development, outsourcing, coproduction, distribution, license and service arrangements. Mr. Marr has also provided general corporate advice and represented clients in venture capital financings, securities offerings, lift outs, and mergers and acquisitions. Prior to his legal career, Mr. Marr held a variety of senior management positions in international sales, marketing, services and engineering at public and private companies in the software industry. Mr. Marr is a magna cum laude graduate of Dartmouth College, received his J.D. summa cum laude from Boston College Law School, where he was Editor in Chief of Boston College Law Review, and served as a law clerk to Chief Justice Margaret H. Marshall of the Massachusetts Supreme Judicial Court."},
{"DisplayName":"David W. Mason","area1":"Corporate & Securities Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-mason.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Mason-335x400.jpg","SortName":"Mason, David W.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"David is Assistant General Counsel at KAYAK Software Corporation where he specializes in corporate governance, securities law, mergers and acquisitions and general corporate law matters. Prior to working at KAYAK, David was an associate in the Mergers, Acquisitions and Securities group at Bingham McCutchen, LLP. Prior to starting at Bingham, David worked in Boston at KPMG, LLP as a Senior Consultant, Transaction Services, where he performed transaction due diligence for private equity and strategic buyers. David also worked at Arthur Andersen LLP as a Senior Financial Consultant, where he specialized in forensic accounting, business valuations and complex accounting matters. David received a J.D. degree, magna cum laude, from Boston College Law School, and a B.B.A., summa cum laude from the University of Massachusetts - Amherst where he majored in accounting. David is a Certified Public Accountant."},
{"DisplayName":"Christine McEvoy","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/christine-mcevoy.html","Image":"","SortName":"McEvoy, Christine","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Hon. Christine M. McEvoy is a retired Justice of the Massachusetts Superior Court, having been appointed in 1994.  Previously, she served as the First Justice of the Concord Division of the District Court, having been appointed to that court in 1989. Justice McEvoy graduated from Regis College, A.B., and from Suffolk University Law School, J.D., cum laude, serving as a member of the Suffolk Law Review.  Upon graduation, she served as a Law Clerk to the Justices of the Superior Court, and thereafter as an Assistant District Attorney for Middlesex County for twelve years, trying capital cases and major felonies. Justice McEvoy is presently an Adjunct Professor at Boston College Law School, teachingTrial Practice, having been a member of their adjunct faculty member since 1988. She is a board member of the Flaschner Judicial Institute and has chaired their Evidence Program for many years.  She has also chaired the Search and Seizure program for the Massachusetts Judicial Institute.  She is co-author of Hearsay, Russell & Tuoni, MCLE, 20xx, has contributed chapters to various MCLE publications, including Massachusetts Superior Court Criminal Practice, A Practical Guide to IntroducingEvidence, and has lectured extensively on search and seizure, homicide, criminal law and evidence at numerous judicial and legal forums including bar review courses. In her capacity as Chair of the Rule of Law for the Massachusetts Judges Conference, Justice McEvoy has also lectured in China and Russia."},
{"DisplayName":"David McKay","area1":"Corporate & Securities Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-mcKay.html","Image":"","SortName":"McKay, David","facultyStatus":"Adjunct Faculty","priority":4,"biography":"David McKay graduated from Boston College Law School in 1985 Magna Cum Laude and Order of the Coif. He received his Bachelor’s degree from Hamilton College in 1973 with Honors in English and his Master’s degree from Brown University in 1974. He was a summer associate at Ropes & Gray in Boston in 1984 where he remains to this day. His wife, Marge Robertson, is a graduate of Boston College Law School in 1982 who also began her career at Ropes & Gray where they met."},
{"DisplayName":"Richard McKay","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/richard-mckay.html","Image":"","SortName":"McKay, Richard","facultyStatus":"Adjunct Faculty","priority":4,"biography":""},
{"DisplayName":"M. Patrick Moore","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/patrick-moore.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Moore_Patrick_335x400.jpg","SortName":"Moore, M. Patrick","facultyStatus":"Adjunct Faculty","priority":4,"biography":""},
{"DisplayName":"John Moskal","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/john-moskal.html","Image":"","SortName":"Moskal, John","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Mr. Moskal has a 25-plus year track record in the energy and environmental industries as a regulator, investor, consultant, entrepreneur, and teacher with a focus on clean energy technologies and energy efficiency. He currently works at the New England regional office of the EPA where he specializes in environmental impacts associated with restructured energy markets, energy efficiency and renewable energy technologies. He is a frequent speaker at professional forums on these topics, and a frequent guest lecturer at several New England Universities. He is an engineer by training."},
{"DisplayName":"Joseph J. Mueller","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-mueller.html","Image":"","SortName":"Mueller, Joseph J.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Joseph Mueller is a trial and appellate lawyer specializing in complex litigations involving intellectual property. He plays a leading role in both traditional patent litigations and interdisciplinary cases involving issues such as antitrust and competition law, contracts and licensing and trade secrets. He co-leads the firm’s initiative focused on matters at the intersection of intellectual property and antitrust law. In addition, he represents clients who work on wide-ranging technologies in high-tech and other industries. Mr. Mueller’s trial experience is considerable, and includes many high-stakes matters in federal and state courts and the International Trade Commission. He has argued before federal and state appeals courts, including the United States Courts of Appeals for the Federal Circuit, Fourth Circuit and Ninth Circuit. Beyond his domestic trial and appellate practice, Mr. Mueller has in-depth knowledge regarding strategies for international litigations and regulatory proceedings. He has experience with courts throughout Europe and Asia. Mr. Mueller also frequently consults on strategies for intellectual property licensing matters. Mr. Mueller served as a Special District Attorney in the Middlesex District Attorney's Office, where he prosecuted cases involving violent crimes, financial fraud, and many other offenses. While at the Middlesex DA's Office, Mr. Mueller tried a variety of cases to juries and to judges. Mr. Mueller has made pro bono service a core component of his practice. He has worked on significant pro bono matters involving issues such as disability rights, political asylum, detainee rights and public school disciplinary procedures. He received the Boston Bar Association's 2007 'President's Award' and the firm's 2005 John H. Pickering Award for his exemplary pro bono service."},
{"DisplayName":"Christopher J. Muse","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/christopher-muse.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Muse_335x400.jpg","SortName":"Muse, Christopher J.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"The Hon. Christopher J. Muse is a graduate of Georgetown University and Suffolk Law School. Before his appointment to the Massachusetts Superior Court in 2001, he was a trial attorney for more than twenty years, practicing in the Massachusetts State and Federal Courts. He was involved in the criminal defense of charges from misdomeanors up to and including first degree murder indictments. He also represented several labor unions, and litigated many labor and employment issues. Judge Muse will teach Trial Practice in the spring."},
{"DisplayName":"Philip D. O'Neill","area1":"International & Comparative Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/philip-oneill.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Philip_Oneill_335x400.jpg","SortName":"O'Neill, Philip D.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Philip D. O’Neill, Jr. is an international arbitrator and educator. He was a partner at Edwards Wildman Palmer LLP (now Locke Lord Edwards), where his global legal practice for more than 35 years included adjudicating billions of dollars in cross-border commercial claims, as well as general counsel projects in as many as 50 countries per year. Repeatedly, he has been listed in the International Arbitration section of The Best Lawyers in America. An adjunct law professor for over two decades, he currently teaches seminars at Boston University and Boston College Law Schools on International Arbitration. Mr. O’Neill also previously taught International Arbitration at Harvard Law School, and International Business Transactions at the Fletcher School of Law and Diplomacy. The author of two books published by Oxford University Press, Mr. O’Neill also has authored five book chapters and sixteen legal journal articles. The American Arbitration Association includes two of his chapters in the Association’s current handbooks on international and domestic commercial arbitration. In addition, Mr. O’Neill is the author of International Commercial Arbitration, published by West Academic Press, which is the textbook for his course."},
{"DisplayName":"Michael Pelgro","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/michael-pelgro.html","Image":"","SortName":"Pelgro, Michael","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Michael J. Pelgro Michael J. (Mike) Pelgro is the First Assistant District Attorney in the Middlesex County District Attorney’s Office, where he is part of an executive management team responsible for supervising a prosecutorial office in the largest county in Massachusetts. He has been a trial lawyer for over 30 years, litigating criminal and civil cases in federal and state courts. He served more than 15 years in the U.S. Attorney’s Office in Boston, where he prosecuted many federal criminal cases and was the Deputy Chief and Chief of the OCDETF Drug Unit. Prior to that, he served more than 6 years as an Assistant District Attorney in the Middlesex DA’s Office, where he prosecuted hundreds of state criminal cases. He has also been a criminal defense attorney and civil litigator in two Boston law firms. Mike received his undergraduate degree from Boston College and his law degree from Boston College Law School. He is a member of several bar associations and is active in volunteer work in his town."},
{"DisplayName":"Kelli Powell","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kelli-powell.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Powell_335x400.jpg","SortName":"Powell, Kelli","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Kelli Powell is a senior associate at WilmerHale who focuses her practice on complex litigation/controversy matters. While in law school, Ms. Powell served as a student attorney with the Boston College Law Prosecution Program, where she represented the Commonwealth of Massachusetts in a range of proceedings in district court including arraignments, bail hearings, and motion hearings. Ms. Powell also served as a legal intern in the Consumer Rights Unit of Greater Boston Legal Services. During her time there, she handled cases involving foreclosure prevention, predatory lending, and other consumer issues. Prior to her legal education, Ms. Powell was assistant director in the Office of Admissions at College of the Holy Cross. "},
{"DisplayName":"Lynne Riley","area1":"Business Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/lynne-riley.html","Image":"","SortName":"Riley, Lynne","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Lynne Riley has argued numerous appeals before the First Circuit Court of Appeals and the Bankruptcy Appellate Panel for the First Circuit, and has authored amicus briefs for the United States Supreme Court, the First Circuit and the Ninth Circuit Courts of Appeals on significant bankruptcy issues. Her trial and appellate work as counsel and trustee has generated numerous published opinions. Lynne is the editor for the Norton Annual Survey of the Bankruptcy Law, Part II, covering consumer bankruptcy articles. She has written and presented extensively on business and consumer bankruptcy topics, and has published articles for the Norton Annual Survey of Bankruptcy Law, Norton Journal of Bankruptcy Law and Practice, American Bankruptcy Institute Journal and Journal of the National Association of Bankruptcy Trustees. She is on the editorial and advisory boards for the Journal of Bankruptcy Law and Practice and Annual Survey of Bankruptcy Law, and serves as associate editor for both publications. Lynne teaches consumer bankruptcy as an adjunct professor at Boston College Law School and New England Law. Prior to becoming an attorney, Lynne was a public school teacher in Cambridge and worked as a real estate title examiner servicing Middlesex County. Lynne served for many years as a Land Court Title Examiner for the Massachusetts Land Court and participated as the legal member on Medical Malpractice Tribunals in the Massachusetts Superior Court."},
{"DisplayName":"Joel Reck","area1":"Real Estate Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joel-reck.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/reck-335x400.jpeg","SortName":"Reck, Joel","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Joel Reck is a retired partner from Brown Rudnick LLP and is the former Chair of its Real Estate Department.  His practice consisted of structuring, managing and closing sophisticated commercial real estate transactions throughout the United States. Currently, Joel conducts a varied mediation and arbitration practice, principally involving real estate and commercial disputes, but also involving personal injury and professional malpractice matters. He also serves as an expert witness in cases involving transactional practice standards and real estate legal issues. In addition to his work in dispute resolution, Joel also teaches. He is an Adjunct Professor at Boston College Law School, co-teaching with TMG colleague Rudolph Kass. In addition he serves as a faculty member for real estate and mediation courses at the Massachusetts Continuing Legal Education"},
{"DisplayName":"Lynne Riley","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/lynne-riley.html","Image":"","SortName":"Riley, Lynne","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Lynne Riley has argued numerous appeals before the First Circuit Court of Appeals and the Bankruptcy Appellate Panel for the First Circuit, and has authored amicus briefs for the United States Supreme Court, the First Circuit and the Ninth Circuit Courts of Appeals on significant bankruptcy issues. Her trial and appellate work as counsel and trustee has generated numerous published opinions. Lynne is the editor for the Norton Annual Survey of the Bankruptcy Law, Part II, covering consumer bankruptcy articles. She has written and presented extensively on business and consumer bankruptcy topics, and has published articles for the Norton Annual Survey of Bankruptcy Law, Norton Journal of Bankruptcy Law and Practice, American Bankruptcy Institute Journal and Journal of the National Association of Bankruptcy Trustees. She is on the editorial and advisory boards for the Journal of Bankruptcy Law and Practice and Annual Survey of Bankruptcy Law, and serves as associate editor for both publications. Lynne teaches consumer bankruptcy as an adjunct professor at Boston College Law School and New England Law. Prior to becoming an attorney, Lynne was a public school teacher in Cambridge and worked as a real estate title examiner servicing Middlesex County. Lynne served for many years as a Land Court Title Examiner for the Massachusetts Land Court and participated as the legal member on Medical Malpractice Tribunals in the Massachusetts Superior Court."},
{"DisplayName":"Ana Rivera","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ana-rivera.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Rivera_335x400.jpg","SortName":"Rivera, Ana","facultyStatus":"Adjunct Faculty","priority":4,"biography":""},
{"DisplayName":"Allan A. Ryan","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/allan-ryan.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Ryan-335x400.jpg","SortName":"Ryan, Allan A.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Allan A. Ryan, Jr. is a graduate of Dartmouth College and the University of Minnesota Law School magna cum laude, where he was President of the Minnesota Law Review. He served as a law clerk to Justice Byron R. White of the Supreme Court of the United States. After service in the United States Marine Corps, Mr. Ryan became Assistant to the Solicitor General of the United States, representing the U.S. government in the Supreme Court. In 1980, he was appointed the first Director of the Office of Special Investigations, U.S. Department of Justice. In this position, he was responsible for the investigation and prosecution of Nazi war criminals in the United States. Since 1985, Mr. Ryan has been an attorney at Harvard University and Harvard Business School. In addition to teaching human rights law at Boston College Law School, he has served as a consultant on genocide prosecutions to the government of Rwanda and participated in several international conferences on how governments should face the crimes of predecessor regimes."},
{"DisplayName":"Donald Savery","area1":"Civil Litigation & Procedure","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/don-savery.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Savery-335x400.jpg","SortName":"Savery, Donald","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Donald J. (Don) Savery is Vice President & Deputy General Counsel at Blue Cross Blue Shield of Massachusetts where he serves as the company’s chief litigation counsel. Litigation has been a primary focus of Don’s career for over twenty years. Prior to joining Blue Cross Blue Shield, Don served as Assistant United States Attorney in the U.S. Attorney’s Office for the District of Massachusetts, where he focused on health care fraud enforcement. Previously, Don was a Partner in the Litigation and Securities practices at Bingham McCutchen LLP, representing clients across the country in complex civil litigation and white collar matters. He served as Law Clerk to Hon. Joseph R. Nolan of the Massachusetts Supreme Judicial Court and to Hon. Francis J. Boyle of the U.S. District Court for the District of Rhode Island. Don is co-author of the Massachusetts Practice Series treatise on civil practice in the federal courts, Federal Civil Practice (2d ed. 2008, Thompson West), and he has authored numerous articles touching on civil litigation and procedure. He is an elected member of the American Law Institute and a Fellow of the American Bar Foundation. Don received his J.D., cum laude, from Boston College Law School in 1993, and an LL.M. from the University of Cambridge in 1998."},
{"DisplayName":"Debra Squires-Lee","area1":"Ethics & Professional Responsibility","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/debra-squires-lee.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/squires-lee-335x400.jpg","SortName":"Squires-Lee, Debra","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Debra Squires-Lee is a partner in Sherin and Lodgen's Litigation Department, co-chair of the Business Litigation and Professional Liability Practice Groups, and co-chair of the firm’s Mentoring Committee. Debra is an experienced trial lawyer and concentrates her practice on legal malpractice defense and complex commercial litigation. She defends lawyers and law firms in professional malpractice cases and before the Board of Bar Overseers. She also defends companies in “bet the company” litigation, including defense of trade secret misappropriation claims, complex contract disputes, and claims for violation of C. 93A."},
{"DisplayName":"Joseph D. Steinfield","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-steinfield.html","Image":"","SortName":"Steinfield, Joseph D.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Joseph D. Steinfield is a trial lawyer, teacher, and writer. Over the span of nearly five decades, he has represented clients in a wide variety of cases, including complex business disputes, First Amendment litigation, construction cases, fraud and chapter 93A cases, intellectual property disputes, wrongful death cases, section 1983 civil rights claims, and commercial disputes of all types. Joe has argued many appeals in both state and federal courts, including the First and Second Circuits, the Massachusetts Appeals Court and Supreme Judicial Court, and the New Hampshire Supreme Court. Many of his appellate cases have established important precedents under both state and federal law. Joe has represented the media in libel, copyright, access, and privacy cases. He represented a well-known magazine in a landmark case in which the Massachusetts Supreme Judicial Court upheld a claim of First Amendment protection for parody. He represented a major Boston newspaper in a leading First Circuit case granting access rights. On behalf of a New Hampshire newspaper, he persuaded the New Hampshire Supreme Court to adopt novel procedures under the state’s “Right-to-Know” law. In 2007, he represented a television network in a high-profile defamation case, and in 2010 he successfully represented a public television station in a case under the Connecticut shield law. In March of 2015, the First Circuit Court of Appeals ruled in favor of the Massachusetts Bay Transportation Authority in a case challenging the MBTA’s rejection of certain advertisements.  This ruling further solidified the MBTA’s status as a so-called limited public forum.  Joe and Prince Lobel partner Jeff Pyle represented the MBTA successfully in both the district court and the First Circuit. He has appeared many times in Puerto Rico federal court.  From 1998 to 2000, Joe represented the Governor of Puerto Rico and the University of Puerto Rico in two high-profile cases involving claims of political retaliation. In 2007, he tried a lengthy case on behalf of a businessman against officials of the Puerto Rico Department of Insurance. The jury returned a $5 million verdict in favor of his client, which was upheld by the First Circuit Court of Appeals. In 2000, the New Hampshire State Legislature retained Joe as its special counsel to investigate ethical charges involving three justices of the New Hampshire Supreme Court.  Following the impeachment of the Chief Justice, Joe was named as special prosecutor and tried the case before the New Hampshire State Senate. He has extensive alternative dispute resolution experience, both as a mediator and as an arbitrator. He has been a member of the commercial arbitrators panel of the American Arbitration Association for more than 20 years. He has also conducted internal investigations, most recently for a large university. Joe is an adjunct professor of law at Boston College Law School and at University of New Hampshire School of Law.  He teaches a seminar entitled, “Defamation Law and Litigation.”  He has taught in Russia twice, in 2008 in Maykop, Adygheya,  and in 2011 at Herzen State Pedagogical University in St. Petersburg.  In April 2016 he was a Visiting Lecturer of Law at the University of Ljubljana in Slovenia, where he taught “Freedom of Speech and Press” and “Negotiation and Mediation.”  In October 2016, he will be a visiting lecturer at the University of Iceland in Reykjavik, where he will teach American Constitutional Law. From 1993-2011 he was a member of the Practising Law Institute faculty, both as a principal speaker and as a panelist at its annual Communications Law program. He has published numerous articles and book reviews, lectures regularly at litigation and media law programs, and writes a monthly column for the Monadnock Ledger-Transcript, published in Peterborough, NH. His book, Claremont Boy: My New Hampshire Roots and the Gift of Memory was published in the spring of 2014. Joe has been a fellow of the American College of Trial Lawyers since 1984 and founded its Massachusetts Superior Court Mediation Program. He has served as the college’s state chair, has chaired the College’s Emil Gumpert Committee, was a member of its National Trial Competition Committee, and chaired the Sandra Day O’Connor Jurist Award Committee. He served as chair of the Massachusetts Clients’ Security Board, was the founding chair of the Law Clerks’ Society of the Supreme Judicial Court, and served as a member of the Massachusetts Commission on Judicial Conduct from 2008 to 2014, the last two years as its Chair. From 2012 to 2014, Joe served as a member of the Boston Finance Commission."},
{"DisplayName":"James L. Sultan","area1":"Criminal Law & Procedure","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-sultan.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/sultan-335x400.jpg","SortName":"Sultan, James L.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Attorney Jamie Sultan has more than 30 years of experience fighting for clients facing serious criminal charges in both state and federal courts. His practice includes seeking to fend off charges against clients under investigation, defending clients who have been charged, and prosecuting appeals and post-trial motions on behalf of clients following conviction. He has appeared in trial and appellate courts throughout Massachusetts and in seven other states. Jamie has handled a number of high profile cases, including the post-conviction litigation in the Fells Acre Day Care sex abuse case which garnered national media attention. Some of his most recent reported successes include appellate reversals of first degree murder convictions in Commonwealth v. Woodbine, 461 Mass. 720 (2012) and Commonwealth v. Toolan, 460 Mass. 452 (2011). Attorney Jamie Sultan has been listed in the Best Lawyers in America from 1991 to date and in Massachusetts Super Lawyers from 2004 to date. He has received a Martindale-Hubbell Peer Review Rating of AV, signifying “the highest level of professional excellence.” In 1997, Massachusetts Lawyers Weekly named him one of the ten Massachusetts Lawyers of the Year. He has taught criminal law at Suffolk University Law School and lectures regularly at criminal defense conferences. Attorney Jamie Sultan has been a member of the Massachusetts Bar since 1980 and was admitted to the United States Supreme Court Bar in 1988. He also belongs to the U.S. District Court Bar and the Bar of the U.S. Courts of Appeals for the First, Second, Third, and Seventh Circuits. Before beginning his practice of law, Attorney Sultan served as a Legislative Assistant to Congressman Robert F. Drinan and clerked for U.S. District Judge William Wayne Justice. While a student at Harvard Law School, he was awarded Best Oralist in the Ames Moot Court Competition."},
{"DisplayName":"James Sweeney","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-sweeney.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/sweeney-335x400.jpg","SortName":"Sweeney, James","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Attorney Sweeney graduated from the University of Massachusetts with a BA in economics in 1992. He later graduated near the top of his class from the Massachusetts School of Law in 1996. He then began his legal career working as an associate attorney for well known Boston trial attorney, Frank Corso, where he concentrated in civil litigation and real estate. Attorney Sweeney became a partner with Attorney Corso before opening his own firm in 2004. Since 2004, Attorney Sweeney has concentrated his practice in the areas of personal injury and real estate, representing developers, lenders and individual home buyers and sellers."},
{"DisplayName":"Robert Ullmann","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/robert-ullmann.html","Image":"","SortName":"Ullmann, Robert","facultyStatus":"Adjunct Faculty","priority":4,"biography":"The Hon. Robert L. (Bob) Ullmann is a trial judge on the Massachusetts Superior Court, where he handles criminal and civil cases. Before becoming a judge in 2013, Judge Ullmann was a trial lawyer for 30 years, litigating criminal and civil cases in federal and state courts. He served more than 10 years with the U.S. Justice Department, including stints as the First Assistant U.S. Attorney and Chief of the Criminal Division in the U.S. Attorney’s Office in Boston. In 1994, Attorney General Janet Reno appointed him as a Senior Litigation Counsel, the senior trial attorney position in the Department of Justice. As a criminal defense attorney, Judge Ullmann's courtroom successes included acquittals in healthcare and securities fraud cases of national import. He also handled a wide range of other criminal and civil cases in federal and state court, including extensive pro bono work. Judge Ullmann is a Fellow of the American College of Trial Lawyers, the Boston Bar Foundation and the Massachusetts Bar Foundation."},
{"DisplayName":"Anjali Vats","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Anjali-Vats.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Vats-Anjali-335x400.jpg","SortName":"Vats, Anjali","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Anjali Vats teaches courses in the areas of race, rhetoric, law, and media studies. Her research is focused on rhetorics of race in law and popular culture. She has published articles in the Quarterly Journal of Speech and Communication, Culture & Critique. She is currently working on a monograph entitled Created Differences: Intellectual Property and the Formation of Race and National Identity in “Post-Racial” America, which considers how political, popular, and legal discourse about copyrights, trademark, and patents is used to create and manage racial and national identities in the United States and globally. Anjali has been recognized for her work in the areas of race and gender. In 2013, she was awarded an AAUW Dissertation Fellowship from the American Association of University Women and an Exemplary Diversity Scholar Citation from the National Center for Institutional Diversity at the University of Michigan. She also previously received an Honorable Mention in the Ford Foundation Diversity Dissertation Fellowship. In addition, her research has been supported by a Society of Scholars Fellowship from Simpson Center for Humanities and the Institute for Ethnic Studies in the United States at the University of Washington. From 2008 - 2014, Anjali served on the board of directors of the Washington Debate Coalition, a non-profit organization dedicated to promoting debate in Washington. Prior to becoming a professor, Anjali clerked for the Honorable A. William Maupin of the Supreme Court of Nevada. She is licensed to practice law in Michigan and Washington. She is also an Assistant Professor at Boston College Law School."},
{"DisplayName":"Paul F. Ware","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paul-ware.html","Image":"","SortName":"Ware, Paul F.","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Paul F. Ware is of counsel in Goodwin’s Litigation Department and served as its Chairman from 1996-2010. Mr. Ware has been a member of the firm's Executive and Management Committees. As a senior trial lawyer, his practice has included substantial criminal, civil and intellectual property litigation. He has also served as Independent Counsel to the Massachusetts Supreme Judicial Court for investigation of corruption in state government; as Trial Counsel for prosecution of a CIA defendant in the Iran‑Contra Investigation; as Special Counsel to the Massachusetts Attorney General for investigation and prosecution of defendants as a result of the “Big Dig” tunnel collapse; and other public assignments."},
{"DisplayName":"Tracey West","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Tracey-West.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/west-335x400.jpg","SortName":"West, Tracey","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Tracey West is the Associate Dean for External Relations, Diversity & Inclusion at Boston College Law School, where she oversees initiatives designed to address the various obstacles that impact the lack of diverse leadership throughout the legal profession. As the former Assistant Dean for Students and Academic Affairs, Dean West has extensive experience assisting students and alumni with their academic, personal and professional developmental goals. Born and raised in New York City, Dean West attended Georgetown University and Georgetown University Law Center. A former trial attorney and certified mediator, she has worked in both the private and public sectors. Prior to joining Boston College Law School, Tracey was a clinical law instructor at Harvard Law School."},
{"DisplayName":"Brandon White","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/brandon-white.html","Image":"","SortName":"White, Brandon","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Brandon F. White is a partner at Foley Hoag LLP where he serves as co-chair of the firm’s Securities Litigation Practice Group. His practice is focused on litigation in the areas of securities, corporate, business tort and contract disputes. A significant part of his practice is focused in the areas of securities fraud, fiduciary duty and corporate governance issues in both the public and private contexts. Prior to joining Foley Hoag, Mr. White was Law Clerk to the Chief Justice of the Supreme Judicial Court of Massachusetts. Mr. White has conducted litigation in state and federal courts in Massachusetts and in a variety of other jurisdictions, including the Delaware Chancery Court, the Delaware Supreme Court, the Eastern District of Pennsylvania, the District of Rhode Island, the District of Minnesota, the Southern District of Texas, California and Florida state courts, the Southern District of New York, and the United States Court of Appeals for the Second Circuit, as well as arbitrations under the auspices of the American Arbitration Association, the International Chamber of Commerce in London, the Financial Industry Regulatory Authority and JAMS/Endispute. Mr. White received his J.D., summa cum laude, from Boston College Law School, where he served as editor of the Boston College Law Review and was a member of the Order of the Coif. He also earned his B.A., summa cum laude, at Boston College. His most recent publications include “The Rise of the Massachusetts Uniform Securities Act,” MASS LAW REVIEW (2013) and “U.S. Supreme Court Narrowly Interprets the Statute of Limitations in ‘Short-Swing’ Securities Actions: Trial Courts Must Apply Traditional ‘Equitable Tolling’ Principles,” FINANCIAL FRAUD LAW REPORT (June 2012). He began teaching Professional Responsibility at Boston College Law School in 2013."},
{"DisplayName":"Frank White","area1":"Corporate & Securities Law","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/frank-white.html","Image":"","SortName":"White, Frank","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Frank White is an Associate in the Corporate Department of Holland & Knight LLP in Boston, Massachusetts and a member of the Private Investment Funds Group, resident in the Boston office. He has a general corporate practice with an emphasis on representing U.S. and non-U.S. sponsors and managers in private equity fund formations and investments. Frank also counsels U.S. and non-U.S. sponsors on regulatory, compliance and day-to-day operational issues. Frank represents institutional investors with respect to investments in U.S. and non-U.S. private investment funds. He also represents venture capital and private equity funds in their portfolio investments and transactions, including venture financings and acquisitions. Prior to joining Proskauer, Frank practiced at Weil, Gotshal & Manges in Boston where he represented private equity firms as well as public and private companies in merger and acquisition transactions, and regulatory, compliance and day-to-day operational issues."},
{"DisplayName":"Charlotte Whitmore","area1":"","area2":"","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/charlotte-whitmore.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/Whitmore-335x400.jpg","SortName":"Whitmore, Charlotte","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Charlotte Whitmore comes to BC Law from the Pennsylvania Innocence Project, where she was the first Staff Attorney following her receipt of an Equal Justice Works Fellowship. Professor Whitmore is a 2008 honors graduate of the University of Pennsylvania Law School where she was Senior Editor of the University of Pennsylvania Law Review and the University of Pennsylvania Journal of Law and Social Change. She clerked for Marjorie Rendell on the United States Court of Appeals for the Third Circuit and for United States District Judge Anita Brody in the Eastern District of Pennsylvania. She has taught as an adjunct professor at Temple University Beasley School of Law and Drexel University's Earl Mack School of Law."},
{"DisplayName":"Jonathan Witten","area1":"Real Estate Law","area2":"Environmental Law","area3":"","acfacAreas":"","URL":"https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jonathan-witten.html","Image":"//bc.edu/content/dam/bc1/schools/law/academics/profiles/witten-335x400.jpg","SortName":"Witten, Jonathan","facultyStatus":"Adjunct Faculty","priority":4,"biography":"Jonathan Witten has 20 years of professional experience in the fields of land use planning, land use law and environmental resource management. He has worked with numerous cities, towns and Tribal governments throughout the country and has developed hundreds of regulatory and non-regulatory techniques for controlling and guiding growth and development. He has lectured nationally on appropriate strategies to mitigate the effects of land development on natural systems. He represents public, private and non-profit clients in a variety of land use law issues. He has taught at the Boston College Law School since 1998 and Tufts University's Department of Urban and Environmental Policy and Planning since 1987."}]