[
  {
    "Number": "LAWS2110",
    "Title": "Critical Perspectives: Law, Context, and Professional Identity",
    "Areas1": "Ethics & Professional Responsibility",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This is a required, one-credit, pass/fail Fall course for incoming 1Ls. The course will introduce a core set of critical perspectives that will give 1L students the basic skills to begin to think deeply about the role of race, gender, wealth, and power in the law, in the law school, and in their own professional identity formation.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS2120",
    "Title": "Civil Procedure",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Using the Federal Rules of Civil Procedure, this course introduces rules governing the conduct of litigation. After an overview of the entire sequence of events from commencement to final disposition of a lawsuit, specific topics are considered in detail.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS2125",
    "Title": "Constitutional Law",
    "Areas1": "Constitutional Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Constitutional Law introduces the concept of judicial review of legislation and executive action. The course also focuses on the express and implied powers of the federal government and the effect of the interstate commerce clause on federal and state power.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS2130",
    "Title": "Contracts",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The concept of what constitutes a contract is followed by detailed study of the various principles that govern the enforcement of contracts. Common law rules are emphasized, but attention is also given to the statutory changes imposed by the Uniform Commercial Code.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS2135",
    "Title": "Criminal Law",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course examines the elements of crimes, defenses that the accused may assert, and the method and rationales for punishing criminal conduct. Attention is given to the common law of crime as well as to the Model Penal Code.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS2140",
    "Title": "Property",
    "Areas1": "Business Law",
    "Areas2": "Real Estate Law",
    "Areas3": "x",
    "Description": "This first-year course covers the substantive law of real property. Topics include initial acquisition, property theory, the right to exclude, land use regulation, servitudes, conveyancing, landlord-tenant law, zoning, and takings.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS2145",
    "Title": "Torts",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course examines non-consensual relations among individuals and emphasizes negligence law, the measure of damages, and newer developments such as products liability.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS2150",
    "Title": "Law Practice 1",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "All 1L students in their first semester will be enrolled in this course for which they will receive 3 credits toward satisfaction of the requirement in ABA Standard 303 for 6 experiential course credits. The curriculum will introduce students to the role of the lawyer through legal problem solving in a simulated client context. Students will be provided with instruction in: research and analysis of binding authority; identification of legally significant facts from documents, interviews, etc.; guided instruction in how to read and synthesize the law, the presentation of analysis of the law and application of the analysis to the problem facts; and preparation of office memoranda. The course involves classroom instruction and discussion, group work, and intensive individual feedback and conferencing.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS2155",
    "Title": "Law Practice II",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "In their second semester, all 1L students will be enrolled in this 2-credit course in satisfaction of the requirement in ABA Standard 303(a)(2) for a rigorous writing experience in the first year which is faculty supervised. Building on the research, analysis, and writing experiences in Law Practice I, students will prepare documents, primarily in the context of advocacy, which involve more complex legal problems than those presented in Law Practice I. The emphasis will be on improving clarity, precision, and effectiveness of these communications for a designated audience and purpose in a simulation, with continued attention paid to a lawyer's ethical and professional responsibilities to the client and the legal system. The course involves classroom instruction and discussion, group work, and intensive individual feedback and conferencing.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS2181",
    "Title": "Constitutional Law: Speech and Religion",
    "Areas1": "Constitutional Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "In this course, students will study the First Amendment rights of free speech, religious exercise, and non-establishment of religion. The course will cover the theories of these rights, their original meaning, and how they have evolved over time. Students will also analyze how these rights overlap or conflict. The course will cover the substance of the rights in question as well as the proper claimants, including whether and when corporate entities can bring constitutional claims. Students will gain a sophisticated knowledge of existing law and develop a strong theoretical foundation for evaluating future cases.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS2182",
    "Title": "Constitutional Law: Rights and Equality",
    "Areas1": "Constitutional Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "This course continues the study of constitutional law by focusing on individual rights under the Fourteenth Amendment, particularly the protections of due process and equal protection.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS2184",
    "Title": "Inequality",
    "Areas1": "Constitutional Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "The relationship between law in the United States and inequality is tortured. On the one hand, we are committed to agreement with Jefferson in the Declaration of Independence and Lincoln at Gettysburg that our national character is founded on the principle that \"all men are created equal.\" Accordingly, we publicly cherish the Fourteenth Amendment's commandment that we are all guaranteed \"equal protection\" under the law. One heroic narrative suggests that the aspiration toward equality is the defining theme our legal system. In President Obama's narrative, the project of the United States was create a \"more perfect\"--and thus more equal--union. But this view of our legal system maps awkwardly onto a \"real\" world riddled with inequalities that break along racial, economic, gender, sexuality, religion, national origin. At the same time that our legal faith embraces equality, the reality of our legal system reproduces and often exacerbates inequality. This course examines the puzzle of inequality in the American law. Together we will engage with a broad range of sources from literature to social science to philosophy to case law and legislation. In considering the role that inequality plays in our legal system we will also be considering the ways in which law, culture, social movements, and politics intersect.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS2185",
    "Title": "Law and Religion",
    "Areas1": "Constitutional Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "Law and religion are fundamental organizing principles across societies. This course will survey the relationships and interactions between them. We will include a discussion of foundational concepts in the field of law religion, as well as a review of questions related to religious liberty and religious freedom, and an investigation of the relationship between religious and state or civic institutions. There will be focus primarily on U.S. law, but will also review and discuss international approaches and models. Students will be expected to develop and complete a substantial writing project on a topic of their choosing in the field of law and religion.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS2190",
    "Title": "Professional Responsibility",
    "Areas1": "Ethics & Professional Responsibility",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course focuses on central issues of professional responsibility faced by most lawyers in the practice of law, whether in the public or private sector. Included may be problems of client confidences, conflicts of interest, behavior in court, obligations to represent unpopular clients and other restrictions on a lawyer's own speech and actions. Other topics focus on the fundamental moral responsibility of lawyers, analyzed in terms of the rules governing attorney conduct, principles of moral philosophy and the pressures that create ethical blindness.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS2192",
    "Title": "Professional and Moral Responsibility of Lawyers",
    "Areas1": "Ethics & Professional Responsibility",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The first part of this course focuses on central issues of professional responsibility faced by most lawyers in the daily routine of practice, whether in a large firm, a small firm, or a legal services program. Included will be problems of client confidences, conflict of interest, behavior in court, obligations to represent unpopular clients, and other restrictions on a lawyer's own speech and actions. The second part focuses on the fundamental moral responsibility of lawyers, analyzed both in terms of the rules governing attorney conduct and the principles of ethical philosophy. There also will be a discussion of the professional organizations of the bar in a historical context, and their future challenges. Because of the amount and nature of coverage of on the fundamental moral responsibility of lawyers, this class fulfills the Perspectives requirement in addition to the Professional Responsibility requirement.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS2831",
    "Title": "LEAPS Capstone Project",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The LEAPS Capstone Project develops a cohort of third-year students interested in leadership in public service (defined broadly). Students identify an issue of deep interest and interview with Professor Sarda to enroll. During the semester, students develop individual or joint change projects of their choosing and design to address the identified issue(s). Through weekly meetings with classmates, mentors, and professor, students receive coaching and feedback on their project design, vision, and leadership, and develop skills to manage dynamic situations that involve uncertainty and ambiguity, 180 degree shifts in vision and design, roadblocks and frustrations, and also, successes (to name a few). Benchmarks and deadlines are set throughout the semester to ensure that students develop their projects in a systematic yet dynamic and reflective fashion. Course expectations include attending all meetings, writing journals, and completing assignments related to benchmarks, a final presentation, and a final paper. Student journals reflect upon and document their journey and developing capacities, uncover links between their life mission and their project mission, and develop a philosophy of leadership, of public service, and of professional identity formation. Limited enrollment. By permission only. Contact Professor Sarda at sarda@bc.edu. Variable credit.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3231",
    "Title": "Contract Drafting",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course provides a foundation for drafting contracts, a skill critical for all lawyers. Lawyers are writers. A big part of that writing consists of contracts, not just for transactional lawyers but also including litigators, family lawyers, regulatory lawyers (both government and private practice), and others. This class covers both the why of various contract parts and technical writing skills. Thus the course will examine contractual covenants, representations and warranties, conditions, remedies, choice of law and other provisions. Technical topics include structuring contracts and crisp drafting of substantive terms and definitions. To meet the upper-level writing requirement, after learning the various topics and drafting techniques, students will draft various contracts from scratch that together meet the 30-page minimum. That will be the primary component of the grading, and there will also be a significant class participation portion of the grade.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS3322",
    "Title": "Environmental Law Seminar (Advanced)",
    "Areas1": "Environmental Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "For spring 2022, the seminar is focused upon analysis of the Biden Administrations variety of efforts to address the prior Administrations cut-backs of prior-existing federal environmental protections studying statutes, regulations, guidance, litigation, and appointments of judges and agency personnel.The seminar is oriented each year toward a significant current issue in environmental protection or land law. Participants study material together within the focal area, and each student prepares a major research paper on a chosen issue of the semesters theme.This year students will first choose one initial exploratory example of an ongoing change in the federal governments spectrum of environmental protections, followed by a major case-study analysis of a second federal environmental protection issue in transition. Students present ongoing research updates and a final major memoranda.2 or 3 credits. Seminar limited to ten students. Registrants are encouraged to have taken a prior land or environmental law course. The seminar meeting time will be scheduled to accommodate enrolled seminar participants individual schedules; (the meetingtime thus will not be scheduled in advance).",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3327",
    "Title": "Applied Legal Concepts",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Applied Legal Concepts (ALC) identifies select core legal concepts tested on the Multistate Bar Exam (&#34;MBE&#34;) portion of the bar exam, and it develops strategies for applying these concepts effectively particularly in a high-stakes testing environment. Some of the legal concepts may have been introduced in other courses, but the emphasis in ALC is on a review of the most highly tested legal concepts from the MBE subjects through exercises specifically designed and scaffolded to help students develop the strategic mindset essential for success on the multiple choice portion of the bar examination.The ALC courses are offered in the fall and the spring semesters and are reserved for 3Ls. Each course focuses on a different set of MBE subjects and course materials for both courses include access to an online early bar preparation portal. While the materials are similar to the materials that students will use when they are studying for the bar examination after graduation, they contain additional exercises to help students break down the mental process necessary to effectively answer multiple choice questions in a high stakes testing environment. Students have access to substantive outlines, lecture handouts, video lectures, and MBE questions. The course is NOT a substitute for a summer bar prep course, but rather is an opportunity to develop skills essential for success with live professor feedback and at a pace not available during the intense 10 week bar study period.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS3333",
    "Title": "Legal Analysis for Practice",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will further develop and strengthen students' legal analysis and problem-solving skills. Using a practice-oriented approach, the class puts students in the position of new associates at a law firm working with a senior partner (the professor). The course focuses on enhancing fundamental lawyering skills such as reading comprehension, rule mastery, issue spotting, outlining, the mechanics of legal analysis, and strong writing. Throughout the course, students will have multiple opportunities for hands-on practice of these skills through focused drills, group exercises, and workbook activities. The course enhances learning by providing students with individual feedback to learn how to evaluate their work and see a clear pathway for consistent improvement. Evaluation will be based on (1) Good faith completion of a Diagnostic Exam; (2) Timely completion of all quizzes, in-class assignments, and homework assignments; (3) Class Participation; (4) Compliance with Attendance Policy; (5) Midterm Exam; and (6) Final Exam.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS3334",
    "Title": "Strategies for Effective Legal Analysis",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course is designed to provide students with an opportunity to hone critical reasoning, essay writing and test taking skills. This course focuses on the development of legal analysis skills, test performance techniques and a strategic mindset. The course will also provide early preparation for the Bar Exam, specifically the Multistate Bar Exam (MBE), the Multistate Essay Exam (MEE), and the Multistate Performance Test (MPT), which are exams created by The National Conference of Bar Examiners (NCBE). While this course will have a skills approach it will also focus on select topics of law within two substantive subjects tested on the MBE and the MEE. The course will benefit any student who plans to take the bar exam. It will be especially helpful for those seeking to strengthen their legal analysis or legal writing skills. The course will include regular assessments, including an opening test (a \"pre-test\"), in-class quizzes, a mid-term exam and a final exam. This course is offered on a Pass/Fail Basis only. Students will have to achieve a minimum score on assessments to receive a passing grade. Course materials will be provided by instructor. This course is limited to second semester third-year students who plan to sit for the bar exam in the summer immediately following graduation. This course is not intended to replace the need for a post-graduate full bar review preparation course. Students should plan to also take a full bar review course after graduation.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3339",
    "Title": "Environmental Law: Clean Water Act",
    "Areas1": "Environmental Law",
    "Areas2": "Administrative & Government Law",
    "Areas3": "x",
    "Description": "Clean water law is a vital foundation of environmental law. Given recent and potential future Supreme Court decisions, it is a likely bellwether for future federal and global environmental protection. This course is important to students interested in gaining experience in working with statutes, regulatory requirements and working with governmental agencies. The course will cover the history, development, and implementation of the federal Clean Water Act, related provisions, policies and case law and state analogues. It will go beyond classic waste water treatment permitting and enforcement issues to include climate change considerations. The course will include in-class exercises in practical regulatory analysis and client advice, much as would be expected of an associate in a law firm or a staff attorney in an administrative or enforcement agency. Grades will be based upon a final take home exam and class participation.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3340",
    "Title": "Art Law and Cultural Property",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This Course surveys a range of legal issues arising in the production, distribution, and transaction of works of art and the rights and obligations of actors in the art world. This is a course for law students with a background in doctrinal subjects not limited to intellectual property law,and rewards interdisciplinaryinterests without requiring them. The class is reading, lecture, and discussion-intensive alternating among these to encourage immersion in the material. The scope of art covered by this course particularly in primary markets (artists and galleries), secondary markets (auction houses) and non-market sector (museums and cultural heritage).includes: fine art in traditional visual media as single paintings, drawings, sculptures, as well as contemporary art media including limited print, photographs, and conceptual installations, as well as culturally valued singularities. Students will complete a drafting exercise involving non-fungible tokens (NFTs) and a comprehensive final exam, or elect to write an original research paper of 15-20 pages (with approval).",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3343",
    "Title": "Advanced Civil Rights Practice",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Advanced Civil Rights Practice is a 3-credit pop-up clinic that allows students who have completed the Civil Rights Clinic the opportunity, with permission of the Clinic Director, to stay engaged in one of the Clinic's long-term matters and experience new lawyering responsibilities. The representative matters include litigation and policy advocacy projects involving the civil rights of low-wage workers, immigrants, prisoners and communities of color in Massachusetts. Advanced Civil Rights Practice students will work on a team alongside students in the Civil Rights Clinic and be supervised by the Clinic Director. This class does not count toward experiential credits.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS3344",
    "Title": "American Legal Education",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar is designed for students who would like to examine carefully the nature of their legal education. We will commence with the English and Continental origins of legal scholarship and teaching, examine the development of formal legal education in America from the founding of the Litchfield and Harvard Law Schools to the rise of Legal Realism, and conclude with the pressing controversies facing America's law schools today. Among the topics covered will be the relationship between formal legal education and the practicing bar, the changing composition of the faculty and the student body, the early pedagogical controversies, the different methods and ends of modern legal instruction and the role played by law schools in fundamental disputes about jurisprudence political ideology, economics and social reform. A research paper will be required rather than a final examination. Multilithed materials. Course will be taught at Harvard Law School.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS3345",
    "Title": "Movement Lawyering",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This is a course about the complex relationship between lawyers, social movements, and social and legal change. We are living through a moment of instability and possibility where legal norms are eroding and transforming all around us. As lawyers (or at least soon-to-be lawyers) we are faced with the question of what roles we should or can play either in upholding, challenging, or remaking the systems that we operate within. This course offers an opportunity to reflect on this question by thinking deeply and critically about how and whether lawyers can play a role in social movements. While we will be reading and studying together as a class, we'll also be interacting with (and reading alongside) law students and lawyers from around the country. Students in the course will have the chance to learn from and question practicing lawyers. In addition to the traditional modes of engagement (reading and writing), students will have the chance to lead class meetings, do individualized field research in their areas of interest, and engage with law students from around the country.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3347",
    "Title": "Federal Criminal Civil Rights Laws: Their Development and Enforcement",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "This course examines the legal underpinnings and enforcement strategy of federal criminal civil rights laws, and explores how they have responded over time to changing societal mores. The areas of focus include (1) the willful deprivation of constitutional rights by officials acting under color of law e.g. police brutality; (2) federal hate crime laws; (3) violent interference with reproductive rights; and (4) human trafficking. In each of these areas, the course will examine the laws that have been passed to address the protection of these rights from criminal interference. In particular, significant Supreme Court and other appellate court cases that have shaped the application of these statutes will be studied. For example, the course will address the history of Title 18 U.S.C. 241 and 242, which emanate from the Civil Rights Act of 1866 and the Supreme Courts constitutional interpretation of those statutes; the passage in 1968 of modern federal hate crimes laws and judicial interpretation of those laws; and the statutory evolution of hate crime and anti-trafficking laws, highlighted by the enactment of the 2000 Trafficking Victim Protection Act and the 2009 enactment of the Shepard-Byrd hate crime law, the first hate crime law to cover sexual orientation, gender identity and disability. As new legislative initiatives emerge, the course will incorporate any relevant changes to existing federal and Massachusetts laws. The course will also explore the federal enforcement effort of these criminal laws with an eye towards the role played by the Criminal Section of the Department of Justices Civil Rights Division where both Instructors worked. In particular, there will be a focus on the implementation of the policy of successive federal prosecutions to vindicate rights after failed state prosecutions, such as the landmark cases of the beating of Rodney King and the killing of Vincent Chin. It will also examine more contemporary direct federal prosecutions initiated after the racially-biased killings at the AME Church in Charleston, S.C. and in Charlottesville, VA. Besides the Instructors' personal involvement in some of these cases, other guest speakers with experience in criminal civil rights enforcement are expected. Students will also be asked to participate in mock trial openings and closings in cases which highlight the issues of proof endemic to these types of prosecutions.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3353",
    "Title": "Incarceration Law",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "Health Law",
    "Description": "The United States has the highest incarceration rate in the world. In 1980, approximately 500,000 people were behind bars in this country. In 2019, this figure topped 2.1 million (nearly two-thirds of whom are people of color), incarcerated in jails, state prisons, and federal prisons. Incarceration law is a 3-credit course that will examine the constitutional law, and some statutory law, relevant to incarceration and prisoners rights. Topics will include free speech and religious rights in prison, the Eighth Amendment's ban on cruel and unusual punishments, the prison disciplinary process, solitary and supermax confinement, felon disenfranchisement, prisoner access to the courts, and race, gender, &amp; LGBTQ discrimination in prison. We'll also look at Congress's efforts to regulate both prison and litigation brought by prisoners, examining the Prison Litigation Reform Act and the application of the Americans with Disabilities Act within prisons and jails. Finally, we'll examine constitutional remedies, studying the law of injunctive relief in constitutional cases brought by incarcerated individuals, and also some of the issues raised by damages actions. (The course will not cover criminal procedure, habeas corpus, or sentencing.)",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3358",
    "Title": "Criminal Motions Practice",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Intensive practical skills course where students write motions and argue them every week in a simulated pre-trial court session. Students will be assigned the role of prosecutor or defense counsel for each assignment and paired to argue against one another. Students will receive feedback on both their written motion and oral argument. Your attendance in every class is vital and the pairings are important for each argument. If an emergency arises and you are unable to attend class, you must contact mebeforethe start of class. We will arrange to have you make up the assignment. This class meets once a week and every effort should be made to not miss one class.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3360",
    "Title": "Law and Accounting",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "This course teaches concepts of basic financial accounting, including the financial reporting process and the development of financial statements for investors, creditors and other business stakeholders. In addition, practical application of the use financial statements and related concepts in transactional law as well as techniques for analyzing financial statements will be introduced. The course will also review where accounting goes wrong and can lead to litigation and criminal charges within the context of law, auditing, corporate governance.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS3362",
    "Title": "Blockchain, Cryptocurrencies, and Digital Assets",
    "Areas1": "Business Law",
    "Areas2": "Intellectual Property & Technology Law",
    "Areas3": "x",
    "Description": "Welcome to a course where blockchain assets meet law. This course is designed to give the students an understanding of blockchain technology as well as cryptocurrencies and other digital assets, and their interaction with law and the legal practice. The course will explore the legal issues arisen by the innovative business models utilizing peer-to-peer networks and distributed ledger technology. During the course, we will analyze several major cryptocurrency issuances (e.g., Bitcoin and Ether) and the benefits of tokenizing or digitalizing other assets, like gold, art or equity, as well as the business and legal issues connected to trading them. Moreover, students will learn about non-fungible tokens (NFTs), stablecoins and central bank digital currencies.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3379",
    "Title": "Consumer Bankruptcy Seminar",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will focus on critical issues regarding consumer credit and consumer law, in part through inquiries into key aspects of debt collection law and the consumer bankruptcy system. This course will discuss a range of consumer credit products, including mortgages, medical debt, student loans, auto loans, credit cards, and alternative financing, such as payday loans. This course will consider consumer credit as a contributor to peoples bankruptcy filings and the role of attorneys and other actors in the consumer credit and bankruptcy systems. Readings will come from law and non-law sources, including law reviews and the work of a variety of social scientists. The course will discuss issues relevant to the legal system and the study of law generally, including the use of data to measure legal problems, the role of lawyers and non- lawyers, and the nature of modern policymaking. Satisfies Upper Level Writing Requirement.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS3383",
    "Title": "Selected Topics in White Collar Crime",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "This seminar will examine emerging issues in the prosecution and defense of white collar crimes. We will first examine the concept of white collar crime and its import on other areas of the both criminal and business law. We will next study the concepts of corporate and individual liability. Our examination of white collar crime will also include several substantive offenses including conspiracy, tax fraud, mail/wire fraud, bribery, RICO, and financial crimes (including bank fraud and securities fraud). We will also conduct a study of the grand jury system and its role in both the prosecution and defense of white collar crime. Finally, we will intertwine an analysis of federal sentencing throughout the semester.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS3433",
    "Title": "Advanced Juvenile Rights Advocacy Project Class",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "Continuation of JRAP.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3530",
    "Title": "Future of Constitutional Democracy",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The first two decades of the twenty-first century have brought significant, arguably existential, challenges to constitutional democracy in the United States and across the world. From deepening inequality to the rise of authoritarian populism, from a global pandemic to regional wars with a global impact, from the hollowing out of domestic political institutions to the challenges of a knowledge economy and massive shifts in world politics, constitutional democracies have found themselves in fighting mode on all fronts. This course is an invitation to reflect on the vulnerabilities and strengths of constitutional democracy, to re-articulate its promise and reimagine its institutional structures. Students should expect a heavy reading load. Examination will be in the form of questions circulated before the end of classes with answers due by the end of the examination period. The course is offered for two credits but interested students may add one additional credit by writing a paper in conjunction with the course.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS3669",
    "Title": "Foundations of Asset Management Law and Regulation",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The course will provide a basic understanding of the business of asset management and the principal legal and regulatory regimes that affect that business. The course will address key concepts under the Investment Advisers Act of 1940, the Investment Company Act of 1940 and other securities and commodities laws and regulation. Students will enhance their ability to identify relevant legal issues raised in any given situation and to develop potential solutions that will achieve the objectives of the business while presenting an acceptable level of legal and regulatory risk.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3670",
    "Title": "Hedge Funds and Complex Financial Instruments",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course is an examination of the law and regulations governing hedge funds and the financial instruments that many of these funds use to execute their strategies. Hedge funds are increasingly important actors in the financial system, but the regulations governing them are poorly understood and constantly evolving. The course is designed to provide an overview of the types of activities these entities undertake, the various regulatory reform efforts that have targeted these entities, especially in the wake of the Dodd-Frank Act, and the policy issues that funds will face in the years to come. Because it is difficult to understand hedge funds without understanding the types of trading activities they perform, this course will also give an overview of the economic and regulatory issues surrounding financial instruments including options, swaps and structured products. The course will also cover counterparty credit risk in OTC derivatives, the mutualization of risk among participants in clearinghouses, hedge fund activism and government enforcement trends.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS3680",
    "Title": "Mindfulness and Contemplative Practices for Lawyers",
    "Areas1": "Ethics & Professional Responsibility",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Law practice is by nature a demanding profession that requires critical thinking, has lots of deadlines, and requires both cognitive and emotional intelligence. As a result of the demands of their chosen vocation, lawyers, and law students experience higher levels of depression than the general population due to ubiquitous overwork and feelings of being overwhelmed by the constant stresses of their work and its burdens. Setting aside time for reflection and contemplation is hard to come by. The goal of this course is to introduce students to the concept of mindfulness and to explore ways that contemplative practices will enhance and enliven the skills that they will need as lawyers. To be successful and healthy, lawyers need to develop sustainable ways of coping that will help them better withstand the rigorous demands of the legal profession. Throughout the semester, we will be using mindfulness practices for stress reduction, self-awareness, compassion for self and others, focus, resilience, and leadership. This course is practical. By taking it, you will learn about concrete tools to better deal with the problems that you will encounter in the legal profession.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4308",
    "Title": "Advanced Parole and Medical Release Practice",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "Students who have not previously engaged in medical release petitioning will interview inmates, assess their medical conditions (with aid of nursing students), formulate re-entry plans (with aid of graduate social work students), and file petitions with the Department of Correction for release of permanently incapacitated incarcerated persons. Students will also prepare life clients for parole hearings in cases that present issues of advanced complexity. Time requirement is a minimum of 84.8 hours. This class does not count toward experiential credits.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4310",
    "Title": "Housing Law and Policy Seminar",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar/colloquium will explore a range of topics regarding the law and policy of housing in the United States (U.S.). Topics may include but are not limited to: the history and development of federal U.S. housing laws and policies; the past and present of U.S housing markets; laws, policies, and strategies to create affordable housing and low-income housing; eviction, foreclosure, and homelessness; housing discrimination and fair housing; exclusionary zoning/inclusionary zoning; the subprime mortgage crisis and predatory lending; government housing programs; gentrification and displacement; historic preservation law; sustainable and green housing; and the effects of Covid-19 on U.S. housing markets. The course will also use Boston as a laboratory in which to study the local manifestations of U.S. housing law and policy. The seminar will be run as a colloquium and involve presentations by you and me, as well as, occasionally, by guest speakers, who will present virtually or in person. We will meet with local and nationally prominent scholars and practitioners in law, economics, sociology, urban policy and public administration to discuss research in progress on housing law and policy. In sessions before speakers visit the class, the professor will teach students the law, theory, and methodologies necessary to discuss the work in progress with its author. In colloquium sessions, students will discuss the work with the author. All students will submit written questions to ask the author in advance of the presentations. Finally, students taking the course for two (2) credits will prepare a few short papers critiquing some of the works and the author's defense of the work after the presentations. Students taking the course for three (3) credits will write seminar papersthat can satisfy the upper-level writing requirement.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4400",
    "Title": "Feminist Legal Theory",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "Constitutional Law",
    "Description": "This weekly seminar provides a critical introduction to key theorists and contemporary issues in the field of feminist legal theory. This seminar is intended to encourage a set of wide-ranging reflections and conversations about gender and the law. We will consider: the background debates which mark the U.S. feminist legal theory canon; the historical origins of the social movements and political coalitions which have produced legal transformations, including the #MeToo movement, in the U.S. and internationally; and contemporary puzzles for feminism and the law, including controversies behind sex equality; pay equity and minimum wage; gender and legal education; sexual harassment; violence against women; access to reproductive health care, including abortion; same-sex marriage; work and the family; political representation; and gender identity and gender variance.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4403",
    "Title": "Employment Law",
    "Areas1": "Labor & Employment Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course addresses the legal regulation of employment of those without any form of collective representation, including executives, hourly and contingent employees. It addresses three major areas: (1) The common law regulation of the employment relationship. This includes formation of the employment relationship; common law exceptions to the at-will rule; privacy and dignitary protections (including electronic media); trade secrets and other intellectual property concerns; restrictions on competition; the use of arbitration as a means to avoid jurisdiction of common law courts. (2) The second area covered is federal regulation of wages and hours pursuant to the terms of the Fair Labor Standards Act (an area of substantial growth and litigation). (3) The law under the Occupational Safety and Health Act. This is a dynamic and controversial area of the law. Consideration of current developments and trends, economic and social, as well as comparative legal approaches, are included.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4408",
    "Title": "Law of Philanthropy",
    "Areas1": "Tax Law",
    "Areas2": "Family & Estate Law",
    "Areas3": "x",
    "Description": "Millions of individual Americans, as well as foundations and corporations, donate in excess of $300 billion every year in charitable gifts. Even in soft economies, that figure tends to grow annually. Philanthropy is a key, an essential, part of the US economy, accounting for 2.0-2.2% of GDP and, an important, discrete and exciting field in the practice of law. In this course, students explore the structure of American philanthropy, its legal history, current regulation, case law, and, emerging legislation and topics in public policy. As has been the case in recent years, developments across all these areas are lively and dynamic. The course introduces students to sophisticated charitable giving techniques used to convey donations and trends in the practice of law and philanthropy. Whether anticipating a practice with active engagement in philanthropy, a practice in private wealth, charitable organizations, government or legislation, or, volunteer service as a member of foundation or non-profit boards, this course will provide students with an in-depth orientation to the field. The course requires a paper and not a final exam.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4410",
    "Title": "Independent Study--Moot Court",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "By arrangement.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4412",
    "Title": "Intellectual Property Survey",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This survey course emphasizes federal copyright, trademark, and patent law and related state trade secret, rights of publicity, and unfair competition law. It is meant to provide students with a general working knowledge of the various intellectual property doctrines, and an understanding of how the individual intellectual property doctrines compare, contrast, and may be used to complement one another. This course is appropriate for the generalist who wants to understand and be able to analyze IP issues, which are ubiquitous in the modern practice of law. It is also appropriate as the first introductory course for students interested in taking a number of IP courses.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS4414",
    "Title": "Trademark and Unfair Competition Law",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "In this course, students will undertake an in-depth study of trademark law. This course will examine the doctrine, theory, practice and procedure concerning intellectual property rights in corporate names, symbols, logos, and identity. In particular, students will be introduced to trademark creation, registration, protection, licensing, and litigation. There will be a final examination.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4416",
    "Title": "Privacy Law",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will introduce students to the legal framework governing information privacy in the United States, as found in constitutional, statutory, administrative, and common law. Topics include the philosophical foundations of privacy, data mining, surveillance, financial information, electronic communications, healthcare information, and targeted advertising and location tracking. The course will also compare U.S. privacy law with European data protection law.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4425",
    "Title": "Law of Money",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "When we buy things or pay for services, we have to pay money. Sometimes we do so with currency, but usually we use devices such as checks, credit cards, debit cards, and various other electronic or semi-electronic payment systems. New payment systems, such as Bitcoin, are constantly evolving and dying off. Lawyers dealing with such developments will need to be prepared with an understanding of basic payment law concepts. Unfortunately, there isn't a unified body of payment law. Rather, we have widely scattered and rapidly changing sources of law. We will study articles 3, 4, and 4A of the Uniform Commercial Code; various federal statutes and Federal Reserve System regulations; private agreements, such as those governing clearing houses and bank credit card arrangements; and basic common law concepts. Over time the subject matter has variously been described as \"Bills and Notes,\" \"Commercial Paper,\" or \"Payment Systems.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS4430",
    "Title": "Employee Benefits Law",
    "Areas1": "Labor & Employment Law",
    "Areas2": "Business Law",
    "Areas3": "Health Law",
    "Description": "Retirement plans, health insurance, and other employee benefit plans are central features of the employer-employee relationship in the United States. The legal regulation of such plans is highly relevant for the practice of corporate, labor, tax, trust, domestic relations, and health care law, and is at the forefront of current policy debates about health and retirement security for U.S. workers. The course will survey the main types of health and retirement plans and examine the rules governing coverage, vesting, funding, fiduciary standards, integration with Social Security, claims administration, remedies, and preemption of state law. It will also consider how the decline of traditional pension plans and the recent healthcare reform impact the existing regulatory scheme for employee benefits in both the private and public sectors.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS4431",
    "Title": "Foreign Relations of the U.S.",
    "Areas1": "International & Comparative Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course addresses the conduct of foreign relations by the United States with specific reference to domestic legal constraints, such as statutes and the Constitution. The course treats (1) the separation of powers between the Congress and the Executive in foreign affairs, specifically with respect to the war power; (2) the treaty power and the domestic law of treaties and other international agreements; and (3) the role of the judiciary, including the immunity of foreign states (\"sovereign immunity\"), the \"act of state\" doctrine, jurisdiction to prescribe and enforce law outside the borders of the United States, and international aw in U.S. courts. The course has a particular emphasis on post-9/11 developments in the law as a result of the war on terror. There are no prerequisites and minimal overlap in subject matter with International Law, together with which this course may, but need not necessarily, be taken to form a year-long sequence.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4432",
    "Title": "Introduction to Human Rights, Refugee, & Humanitarian Law",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This class will examine legal understandings of and responses to some of the most compelling human rights challenges of our times. We will explore torture, forced migration, religious freedom, refugee and humanitarian protections, the human rights of migrants, human trafficking, and criminal prosecutions of alleged war criminals and those who commit crimes against humanity. We will engage critically with ideas of gender, culture, ethnicity, legal status, and race. There will be guest speakers, engagement with the BC Center for Human Rights and International Justice https://www.bc.edu/bc-web/centers/chrij.html,and (if possible) field trips to observe human rights in action. We will consider: -- Western ideas of human rights and how those ideas differ from other conceptions;--The international law, treaties, instruments, customary norms, etc. that create and protect human rights, including economic and social rights, rights against racial, ethnic, religious, and gender discrimination, rights to self-determination, and the rights of children;--The institutions that monitor and enforce human rights law, including regional systems such as those of Europe and the Inter-American system.Grading will be based on class participation (including in-class simulations and presentations, and aguided research paper of approximately 15 pages on a topic chosen by each student inconsultation with Prof. Kanstroom.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4433",
    "Title": "Labor Policy & Geographic Inequality",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Labor & Employment Law",
    "Areas3": "x",
    "Description": "Empirical evidence of employer power in labor markets has drawn national attention and concern. Employers exercise of their buyer power suppresses wages, benefits, and the quality of work for American workers, and impacts workers of color, women, and low-wage workers most. But employer power is particularly pervasive and intractable in distressed and rural labor markets. Distressed and rural labor marketslabor markets in rural areas and deindustrialized cities, suburbs, and towns that have suffered declining growth or contractionare characterized by high labor market concentration levels, scarce employment, and low levels of labor market regulation that entrench employer power. These characteristics present unique legal and regulatory challenges that this seminar will explore. The course materials and seminar discussions will concentrate on the limitations of current law and labor market regulation in these markets and consider a suite of legal and policy solutions to combatting employer power and strengthening worker power as well asestablishing work as a means of accessing economic opportunity in the context of geographic inequality. In analyzing the limitations of current legal protections, the seminar will concentrate both on substantive rights and obligations imposed by current law as well as the role and ability of labor market institutions governmental agencies, unions, corporate forms, non-profits, and civil society organizationsin ensuring or undermining those rights and obligations.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS4435",
    "Title": "Insurance Law",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "Insurance is of pervasive importance on the modern world, whether in the manufacture and sale of a product, in the ownership of a house or a motor vehicle, in the need for life insurance, in the practice of a profession, in serving as an officer or director of a company, in protection against medical expenses or the consequences of personal injury, and, of course, in the litigation of contract and tort claims. Insurance coverage is often a major influence on litigation. No litigator or representative of an enterprise can avoid having an understanding of insurance principles, including the obligation of insurers to treat claimants fairly. This course covers general principles of insurance, the regulation of insurance, various kinds of insurance (property, life, health, liability and motor vehicle), ethical considerations for lawyers, and relationships between insurers.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4438",
    "Title": "Venture Capital Financing",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "This course deals with the legal and business issues facing start-up companies and the venture capital and other investors who provide financing to them. In particular, the course will focus on the various legal considerations typically encountered by start-up companies, including corporate formation and initial financing, middle and later stage venture capital financing, strategic alliances, employment and equity compensation matters, securities laws compliance, corporate governance and exit strategies. The course will offer an introduction to these topics through the eyes of attorneys who represent start-up companies and may also include guest presentations on various relevant topics. The course may include a written practice exercise designed to expose students to the process of counseling venture backed companies.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4439",
    "Title": "European Union Law",
    "Areas1": "International & Comparative Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course provides a general overview of the legal architecture of the European Union. It introduces students to the complex relationship between the European legal order and the national legal systems of Member States. Students will study the Union's major institutions and decision-making mechanisms as well as substantive legal matters that include fundamental rights, free movement of persons and goods, non-discrimination. This course is a prerequisite for participation in the SIP Dublin but is open to any student interested in the present and future of Europe.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4443",
    "Title": "Introduction to Municipal Law Practice",
    "Areas1": "Administrative & Government Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "1L Elective The course dissects a municipality as a business organization, a Municipal Corporation; how a governmental lawyer practices law within that corporate structure, and the skills needed by a private practitioner to deal with it, municipal boards, agencies, departments and employees. Subject matter includes home rule, Charters, Ordinances and By-Laws (purposes, standards and constitutional issues), forms of municipal government, the government attorney and unique representation issues resulting from multiple clients, the Conflict of Interest common and statutory law, ethical issues, the Attorney-Client Privilege in the governmental setting, taxation, assessments and valuation, procurement, contracts, real estate acquisitions and conveyances, environmental issues, public records, open meetings, zoning and land use planning, comprehensive and master planning, inclusionary zoning, low and moderate income housing and affordable housing.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4444",
    "Title": "Local Government Law",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Real Estate Law",
    "Areas3": "Constitutional Law; Environmental Law",
    "Description": "This course examines the most pervasive and complex form of public law in the United States--the law of local governments. In examining the doctrine (and lack thereof) defining local government law, the course provides a foundation for the many areas of legal practice that deal with local issues, disputes, and concerns. More broadly, the course asks whether local governments serve or impede broader commitments to equality, democracy, inclusion, and participation. We will focus on issues such as federal and state control of city decision-making, the conflict between central cities and suburbs and among the suburbs themselves, alternatives to city-delivered services and to city taxation as a source of local revenue, and the ways in which racial and ethnic division fracture American metropolitan areas. Above all, this is a course about local democracy. For that reason, among others, active class participation is an integral part of the course and will be expected of every student enrolled in it.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4445",
    "Title": "Patent Litigation",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "Civil Litigation & Procedure",
    "Areas3": "x",
    "Description": "This course has two goals. First, teaching substantive patent law and the key events in patent litigations. Second, developing core litigation skills that are critical to not only patent cases, but also other types of litigations. The class will focus on three exercises: (1) a Markman argument in which each student will argue patent claim construction issues; (2) an expert deposition of a technical witness, in which the students will question the witness; and (3) summary judgment briefing and a hearing, in which each student will write a brief and present oral argument. All three exercises will involve review of substantive patent law, issues specific to patent litigations, and core litigation skills.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4449",
    "Title": "The Art of Lawyering and the Commercial Lease",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course is for second and third year students. It is an exercise in the art of transactional lawyering, using commercial leases in a shopping center as a centerpiece. Through the study of a textbook, cases, statutes, and commercial documents, as well as through drafting and negotiation exercises, everything the student has learned in law school will converge on the problems that fictional clients bring to the class for solution. We will explore the choice of business entity, letters of intent, percentage rent, use restrictions, anti-trust, free speech in the shopping center, restrictions on transfer of interest by landlord and tenant, relationships and contracts with abutters, environmental issues, green leases, defaults and remedies, ethical issues, and bankruptcy. The course grade will be determined 50% by performance on drafting assignments and negotiation exercises and 50% by the extent and quality of class participation. There will be no final exam.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4450",
    "Title": "Environmental Law, Advanced: Teaching Seminar",
    "Areas1": "Environmental Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Environmental Law-Teaching Program Seminar. (Professor Plater) (spring semester, with selection in the preceding spring, and preparation starting in fall semester). A seminar providing law students the opportunity to teach a University course in Environmental Law to graduate and undergraduate non-law students. Enrollment limited to eight law students selected from three area law schools--BC, BU, and Harvard. Teachers are given Boston College faculty status [but unsalaried!]. With the professor's advisory participation, two-person teams of law students teach an individually-designed section of a spring semester course in Environmental Law and legal process, each team's class enrollment comprising fifteen to thirty-five students from a wide variety of majors. A weekly law school seminar in the spring semester coordinates the research and teaching preparation. (Six preparatory sessions are required during the fall semester.) 3 pass-fail credits, awarded in spring semester; plus option for 1 graded credit in fall or spring semester.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4453",
    "Title": "State Constitutional Law",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Constitutional Law",
    "Areas3": "x",
    "Description": "Many of the most important constitutional questions of recent times are being decided by state courts interpreting state constitutions. Regularly appearing on state court dockets are novel constitutional issues regarding abortion, gay marriage, the death penalty, education, the environment, health care, privacy, property rights, search and seizure, separation of powers, and state budgeting in times of fiscal crisis. As the Roberts Court reshapes the federal constitutional landscape, we can also expect significant changes from the state supreme courts, given the dynamic relationship that has developed between state and federal constitutional law. This course will cover the fundamental principles of state constitutional interpretation and apply those principles to current cases and controversies. The course will explore the history, text and structure of state constitutions and draw comparisons to the U.S. Constitution. The class will be taught in a seminar format with students having a",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4455",
    "Title": "Internet Law",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "With the rise of the Internet, we can store and transmit vast amounts of digital data across the globe at little to no cost. This digital revolution raises fundamental questions about how, if at all, existing legal rules should apply online. This course explores the legal and policy issues that arise in cyberspace, including issues of sovereignty and jurisdiction, regulation of online speech, peer-to-peer networking, cybersquatting, and virtual property. It also addresses regulation of the physical architecture of the Internet, including net neutrality. The course examines the broader jurisprudential and policy questions that apply to issues arising on the network, and in the process uses cyberlaw to reexamine the way that law operates in the offline world.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4460",
    "Title": "Prosecutorial Ethics",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Ethics & Professional Responsibility",
    "Areas3": "x",
    "Description": "A criminal prosecutor must reconcile the ethical obligation to \"seek justice\" with personal incentives to \"win\" cases and professional obligations to protect the public. We will examine the areas of prosecutorial decisionmaking that bring these competing goals into sharpest conflict. Topics will include the use and abuse of the grand jury; issues of overcharging and selective prosecution; discovery practice; the use of informants; pretrial publicity; plea negotiations; jury selection; trial conduct; and prosecutions of mental health cases. Class participation is considered in the final grade.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4461",
    "Title": "Wrongful Convictions",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "This seminar gives students the opportunity to study the phenomenon of wrongful convictions, including the causes of, and possible solutions to, the problem and its significance for the criminal justice system. Readings, films, guest speakers, and discussions provide students with a range of perspectives on the issues. The academic experience is enriched by the students' ability to draw on their clinical and externship experiences",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4462",
    "Title": "Advanced Innocence Class",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Advanced Innocence Class allows students who have taken Wrongful Convictions andcompleted the Innocence Clinic the opportunity, with permission of the Innocence ProgramDirector, to develop advanced and/or new lawyering skills while working under facultysupervision on BC Innocence Program cases and policy reform collaborations. Representativeactivities include drafting motions for postconviction relief and supporting memoranda of law onbehalf of wrongfully convicted clients, working with forensic experts, preparing for postconvictionevidentiary hearings, and collaborating with community partners on innovative law reformsaimed at preventing or remedying wrongful convictions. Students earn 3 credits requiring 127.5hours of work during the semester (42.5 hours/credit).",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4464",
    "Title": "Authority and Leadership in Professional Life",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Ethics & Professional Responsibility",
    "Areas3": "x",
    "Description": "This course focuses on the conscious and unconscious group and systemic dynamics that arise from the exercise of authority, leadership and power. Students learn by studying their own experience and linking this to theory and class reading. Classes are intensely psychodynamic in nature, and promote powerful and often emotional interchange as students explore the dynamics of social identity and processes such as splitting, projection, and projective identification. Students experiencing a difficult period in life should speak to the professor before enrolling. Class attendance is required. Attendance at a group relations conference is strongly encouraged; there is usually one scheduled at Boston College in March/April (there is a registration fee). Variable credit offered for attendance at, and reflection paper on conference experience. Contact Professor Sarda for information (sarda@bc.edu). Limited enrollment.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4469",
    "Title": "BC Law Prosecution Seminar",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This weekly seminar focuses on the development of lawyering skills, the formation of professional identity, and the study of the prosecution function.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4474",
    "Title": "Energy Law and Deregulation",
    "Areas1": "Environmental Law",
    "Areas2": "Administrative & Government Law",
    "Areas3": "x",
    "Description": "This survey course focuses on the law and public policy of electricity and natural gas, with discussion of both market and environmental regulation. The course will examine the frequent tensions between economic and environmental regulation. There will also be analysis of the Constitutional law applicable to the energy industries, including Commerce Clause and Supremacy Clause limitations upon state energy policies. Class time will also involve review of ongoing political and industry developments. There will be particular focus upon the development and financing of renewable energy resources.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4475",
    "Title": "Climate Law",
    "Areas1": "Environmental Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "This course will explore the role of U.S. and international law in addressing the drivers and impacts of climate change. We will begin with a high-level overview of the causes and effects of - and solutions to - climate change, drawing attention to its expansive reach across sectors and societies as well as the underlying science and economics. Then we will explore international, national and sub-national approaches to addressing climate mitigation and adaptation, including consideration of the U.N. Framework Convention on Climate Change, the Kyoto Protocol, the Paris Agreement and the Kigali Amendment to the Montreal Protocol. With regard to national and subnational laws, policies and regulatory approaches, this course will focus on developments in the United States while drawing on further context from jurisdictions with leading climate policies from around the world. We also will consider the role of non-state actors via the Marrakech Partnership for Global Climate Action under the leadership of the High-Level Champions for Climate Action, as well as the influence of quasi-regulatory bodies such as the G20 Financial Stability Board and its Taskforce on Climate-Related Financial Disclosures. This course also will delve into equitable and social justice issues associated with climate change and climate policies, including nascent policy and regulatory solutions to address disparate impacts. Finally, we will consider evolving jurisprudence and policies with regard to liability for climate-related impacts, and will examine some of the newest frontiers in climate law and policy, including early-stage efforts to establish new regulatory frameworks around geoengineering.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4476",
    "Title": "Domestic Violence and the Law",
    "Areas1": "Family & Estate Law",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "Courts have increasingly become the forum for responding to issues of domestic violence. This course provides the historical and social context of battering, explains the dynamics of battering relationships and the psychological effects of trauma on battered women and children, discusses civil and criminal law issues arising out of battery, and examines the use of expert testimony as a method of presenting battered women's claims in court.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4483",
    "Title": "Advanced Legal Writing: Appellate Litigation",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This course will provide an overview of the basics of appellate procedure and introduce participants to the nuances of appellate writing offering students the opportunity to hone their writing skills in the process.Over the course of the semester, students will research and author their own appellate brief on a fixed record presenting a discrete legal topic. Throughout the drafting process, we will walk through the constituent parts of a brief and describe best practices. Beyond the drafting specifics, the course will introduce students tobig-picture issues in appellate writing. We will cover the substantive(how the standard of review influences the entire brief) to the stylistic(typography and the great font debates) and everything in between (how to structure and style argument headers to create an effective table of contents).We will review standout examples of legal writing, dissecting good briefs to examine what makes them work so well. We will also review ineffective briefs to illustrate potential pitfalls. Finally, we will discuss common issues encountered in appellate writing everything from recurring grammatical issues to effectively managing jargon and defined terms. This course is an ideal fit for students interested in judicial clerkships,appellate practice, or further developing their research and writingskills. Ideally, by the course's end, students will have a firm grasp ofthe fundamentals of appellate writing and a polished writing sample on a sophisticated legal topic.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4484",
    "Title": "Advanced Legal Writing--Employment Law",
    "Areas1": "Labor & Employment Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "In this course, you will apply your legal research, writing, and analysis skills in the context of an employment law practice. Assignments will include pragmatic tasks such as a discrimination position statement, an advice letters concerning an employment policy, and a brief addressing an employment law issue.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS4485",
    "Title": "Advanced Legal Writing",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course focuses on legal analysis and writing with a particular focus on the audience and purpose of written legal communications. The primary purpose of this course is to assist students in becoming practice ready attorneys. Students will continue to build on the skills gained in their First Year Legal Research and Writing course and need only an interest in bettering their writing skills, including their editing skills. Using hypothetical client problems and a simulated court record, students will write client communications, including client letters and electronic communications, as well as pretrial civil litigation documents, such as legal briefs. Students will spend course time discussing each written assignment, reviewing drafts and collaborating on in-class exercises.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS4488",
    "Title": "Global Business Law",
    "Areas1": "Business Law",
    "Areas2": "International & Comparative Law",
    "Areas3": "Corporate & Securities Law",
    "Description": "This is a course on the globalization of private economic relationships and the global regulation of such activity. In particular, the course will focus on identifying and solving the legal problems affecting cross-border transactions in a global regulatory environment. Students will become familiar with the nature of globalization and the global economy; fundamental patterns of business activity across national boundaries; the international legal framework for regulating such activity; and the unique issues raised by sales of goods, licensing, foreign investment and dispute resolution. Private and public law aspects of international business transactions will be examined, including conflicts of law, foreign law, and select issues in WTO, NAFTA and EU law.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4504",
    "Title": "Managing Environmental Compliance in Real Estate and M&A Transactions",
    "Areas1": "Environmental Law",
    "Areas2": "Business Law",
    "Areas3": "Real Estate Law",
    "Description": "This practice-oriented course will address how to manage environmental issues in thecontext of M&amp;A and real estate transactions. The course is designed for studentsinterested in environmental law as well as real estate, business law, and litigation practice. The course will start with a review of the type ofenvironmental liabilities that are of potential concern in corporate and realestate transactions, including Superfund liability, corporate noncompliance,and product-related liability. Students will learn how to manage environmentaldue diligence in transactions, including setting up and reviewing virtual datarooms (VDRs), retaining consultants, and evaluating environmental reports andsampling results. The course willaddress unique challenges presented by global transactions and strategies tomitigate the risk of post-closing litigation over environmental liabilities.Students will do hands on drafting and negotiating of environmentalrepresentations, warranties, indemnifications, and other deal terms. The course will also address how criticalenvironmental issues in the deal can be effectively summarized, quantified, andpresented to clients and senior management. Students will learn how to managepost-closure integration of new businesses and environmental liabilities andprograms relating to newly acquired properties and businesses. A few guest lecturers will help bringdifferent perspectives to the class.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4513",
    "Title": "Constitutional History: The Framing of the Constitution",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar will focus on the framing period of the U.S. Constitution as a political, legal, historical, cultural, intellectual, and literary process. We will consider a range of topics using primary and secondary sources, including, e.g., the idea of a constitution; the narrative of the Convention; the reliability of the sources; the various initial plans and strategies; issues of representation and slavery; the conception of the executive and judiciary; the role of committees and drafts; ratification; the process of amendment; American constitutional culture. As a 3 credit seminar, expectations include class assignments related to class reading and the writing process, and completion of a research paper on an approved topic related to an aspect of constitutional history, politics, or constitutionalism broadly conceived (e.g., history, biographical, American, global, comparative etc.). The seminar includes weekly exercises designed to support the writing of the research paper.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS4514",
    "Title": "Law, Slavery and Race",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "This course will explore the interaction of law, slavery, and race in the United States. We will read primary sources (cases, treatises, codes, personal narratives) and secondary literature (articles, book excerpts, video documentaries). We will study the way law, politics and culture interacted to shape the institution of slavery and the development of modern conceptions of race. Course discussions will focus on questions such as: How did/does law work on the ground to shape the production of racial hierarchy and creation of racial identities? In what ways did slavery influence theU.S. Constitution? How has race shaped citizenship in the U.S? How did race shape economic, social, and criminal justice, from Reconstruction through the 20th century? The course will begin with the origins of New World slavery, race, and racism, and move chronologically to the present day.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4516",
    "Title": "Race, Religion, and the Family Seminar",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar examines how race and religion have influenced the development of laws and policies that regulate American families, focusing on the twentieth century. The seminar also serves as an introduction to the field of legal history; it considers the uses of historical arguments in legal, political, and public advocacy, as reflected in disputes over family law. Representative topics include marriage, reproduction, adoption, welfare, and zoning. Readings will include cases and other primary sources, historians' amicus briefs, legal and historical scholarship, and recent op-eds and news articles.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4770",
    "Title": "Advanced Family Justice Litigation Practice",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The Advanced Family Justice Litigation Practicum allows students who have taken the Family Justice Litigation Clinic the opportunity to develop advanced and/or new lawyering skills while working under faculty supervision. Representative activities include drafting pleadings, motions, and appeals with supporting memoranda of law, negotiations with opposing parties, court appearances, and collaborating with community partners on local law reform on issues of third party custody and pre-petition advocacy. Students, with permission of the Clinic Director, can earn 2 or 3 credits requiring 85 or 127.5 hours (respectively) of work during the semester.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS4771",
    "Title": "Advanced Entrepreneurship & Innovation Practice",
    "Areas1": "Business Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The Advanced Entrepreneurship &amp; Innovation Practice course is a 2-credit pop-up clinic that allows students who have completed the Entrepreneurship &amp; Innovation Clinic the opportunity, with permission of the Clinic Director, to stay engaged in one or more of the Clinic's long-term matters and experience new lawyering responsibilities. The clinic represents for-profit and nonprofit entities in transactional matters only.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4772",
    "Title": "Advanced Civil Litigation Practice",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The Advanced Civil Litigation Clinic is a 4-credit clinic that allows students who have already completed the Civil Litigation Clinic the opportunity to, with the permission of the Clinic Director, stay engaged in one of the Clinic's long-term matters, developing additional lawyering skills. The clinic represents individuals and families in a variety of civil areas impacting health and well-being, including housing, education, family, and benefits law.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS4897",
    "Title": "Justice, Development, and the Global Economy",
    "Areas1": "Business Law",
    "Areas2": "International & Comparative Law",
    "Areas3": "x",
    "Description": "How is globalization changing the nature of international law, international society and global governance? What would it take to construct a just global economy? How can international economic law and institutions be reformed towards this end? These are a few of the questions considered in this seminar, through an introduction to the phenomenon of globalization and to some of the principal theoretical perspectives (i.e., political philosophy, sociology, economics, etc.) currently being applied in the study of these developments. Together we apply these and other theoretical perspectives to select issues in globalization studies and the operation of international economic law institutions, particularly the work of the WTO, IMF and World Bank. The seminar also affords students an opportunity to research, write, and present a substantial paper (30-45 pages) of publishable quality concerning an issue of globalization and contemporary international economic law.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS5140",
    "Title": "Space Law",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "International & Comparative Law",
    "Areas3": "x",
    "Description": "This course will examine space law and policy practices in the United States and internationally. It will first explore the basics of both fields, including a comprehensive overview of their key founding texts, managing structures and international, national and entrepreneurial systems of governance. It will also address on-going debates currently challenging the space sector namely space debris, satellite constellations, the US Space Force, planetary protection, planetary defense and space resource utilization. This active-learning (= not lecture-based) course will serve as a canvas to teach methods of critical thinking and document analysis. Through the interdisciplinary methodology adopted, students will be encouraged to develop their critical skills regarding the core issues both relevant to the space industry today and applicable to all career paths. They will learn how to deconstruct legal and policy source material, historical context and authorship and reflect on common misconceptions.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS5521",
    "Title": "The United States Legal System",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course is required of LL.M. students who do not hold a U.S. J.D. degree. The course has several objectives: exposing students to fundamental concepts underlying the U.S. legal system, providing survival skills for the LL.M. year, exposing students to key doctrinal areas, and offering a frame of reference for comparing the U.S. legal system with students' own. The course is divided into three units: (a) an overview of our basic legal institutions, including the adversary system, the Constitution, and the Bill of Rights; (b) a case study in product liability law, as both substantive exposure to private law and an exercise in identifying and manipulating legal doctrine; and (c) an examination of how the structure of the legal profession and different modes of lawyering contribute to the functioning of the U.S. legal system as a whole.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS5522",
    "Title": "Legal Research and Writing for LL.M'S",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Legal Research and Writing for LL.M.'s is a two-credit course that is recommended for LL.M. students who do not hold a degree from a U.S. law school. The course has several complementary objectives: exposing students to the most widely used techniques of U.S. legal research; teaching students to locate primary legal materials from electronic research sources; helping students identify authority that is relevant to a given fact situation; strengthening students' skills in U.S. legal analysis; and improving students' English language writing skills. The course builds on writing and analytical skills students have developed in the U.S. legal system.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6265",
    "Title": "Law and Public Finance",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "A hopelessly indebted satirist once wrote that \"those who made the laws have apparently supposed that every deficiency of payment is the crime of the debtor\". In no relation between debtor and creditor has this claim borne out more clearly than the relation between government debtors and their many creditors. This seminar will explore how interactions between creditors and debtor governments defined the theory and practice sovereignty, the legal and political basis of the power of cities, states/provinces, and nations. Moving between the historical past and present and comparing across jurisdictions, we will explore how public debt shaped the sovereignty in the context of U.S. federalism, international law, and international investment law. We will engage questions in contract law, international law, international investment law, and corporations together with empirical studies from history, economics, and political science. Along the way, we will see how the laws distribution of power between public debtors and creditors absorbed theories of racial inferiority, financial capitalism, and democracy and produced (and reproduce into the present) the structures of racial capitalism and globalized inequality.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6267",
    "Title": "Fiduciary Obligations and the Law",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "Ethics & Professional Responsibility; Labor & Employment Law",
    "Description": "Fiduciary obligations arise in a multitude of private relationships, including business organizations, agency, guardianships, trusts, and professional relationships of various kinds. This seminar will consider fiduciary law as a distinctive legal category and explore fiduciary principles across a wide range of legal subjects. Through the study of statutory and common law fiduciaries--including trustees, corporate directors and officers, partners, agents, lawyers, physicians, money managers and advisers--the seminar will explore why fiduciary duties arise and how obligations and remedies vary for different types of fiduciaries. The seminar will also assess the use of fiduciary law in financial regulation, and the challenges of fiduciary governance in a global business environment. Finally, the seminar will consider how fiduciary principles might be applied to public officials and public institutions.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6603",
    "Title": "Nonprofit Organizations",
    "Areas1": "Labor & Employment Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This is a course in the law and theory of charities and other not-for-profit organizations. Our primary emphasis is on understanding the state and federal law governing these organizations, together with the rights and responsibilities of their members, officers, and directors. For example, we will explore what is a qualifying &#34;charitable&#34; activity, limits on the commercial and political activities of nonprofits, and operational elements such as governance, fundraising, management and leadership. Our legal discussion will be informed by an exploration of the purposes of charity, whether it has a unique social mission, and what implications those theories have for the proper governance of the sector. Grading is based on participation,written assignments, and a 15-page paper.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6605",
    "Title": "BC Defender Seminar",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The weekly defense class involves readings, discussions, role-plays, case rounds, mock trials and hearings, and reflections on the students experiences, their clients and cases, professional ethics, the role of the public defender, and other issues relating to the criminal justice system.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS6609",
    "Title": "Environmental Corporate Lawyering: Regulatory Compliance",
    "Areas1": "Environmental Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "Students learn about integrating sustainability and other environmental considerations into mergers, acquisitions, and other transactions; supervising regulatory audits of clients' industrial facilities; and designing internal management systems to enhance clients' value while addressing governmental regulation, liability management, investment strategies, and insurance issues. By engendering skills in working with statutes, regulations, policies, guidance, and related administrative procedures while learning principles of U.S. and foreign environmental law in a context of simulated client counseling, students become empowered to integrate these environmental factors into transactional and advocacy practice, whether or not they go on to concentrate in environmental matters. The teaching style for the course is informal lecture and discussion, supplemented by student simulated client counseling and occasional guest speaker presentations. There are no prerequisites. 3 credits, based on at least one simulated practice group project and a final, take home exam.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6610",
    "Title": "Native Americans and the Law",
    "Areas1": "Environmental Law",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "This course will focus on the constitutional, statutory and jurisprudential rules that make up the field of Federal Indian Law. The course begins with the historical framework from which the rules were derived, then traces the development of the underlying legal doctrines that are prominent today, including tribal sovereignty, tribal jurisdiction, treaty rights, and state authority over tribal lands. The second half of the course focuses on subject-specific areas: hunting and fishing rights, reserved water rights, stewardship of natural resources, economic development (including tribal gaming and natural resource development), protection of tribal religious and cultural practices, and the laws related to cultural harms caused by mascots, theft of cultural belongings (including human remains), and cultural appropriation.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6613",
    "Title": "Transitional Justice in Comparative Perspectives",
    "Areas1": "International & Comparative Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "This Seminar comparatively examines the field of Transitional Justice (TJ) which deals with judicial and non-judicial measures through which states and societies seek to come to terms with mass human rights violations by investigating for truth, justice, redress, reconciliation, and peace. The judicial and non-judicial measures/mechanisms of transitional justice include Truth and Reconciliation Commissions (TRCs),criminal tribunals, lustration/vetting, memorialization, criminal justice reforms, and institutional building. While the field's focus is often on post-authoritarian or post-conflict societies, countries such as Canada (Indian Residential School System) and Australia (concerning the right of Aborigines/first nations/indigenous peoples) sometimes also resort to TJ measures to confront historical injustices. These processes help the community to bring closure to the problem through some form of restorative justice. The Seminar will interrogate these ideas and measures through the readings in the syllabus. Students will, in the end, understand some of the theories that undergird TJ and appreciate the debates in the field and the capacities or limitations of the different TJ measures. We will also reflect on how TJ mechanisms may be used to accentuate justice, peace, human flourishing, and respect for human dignity especially in the aftermath of conflicts.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6619",
    "Title": "Mock Trial Team",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "TBD",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6632",
    "Title": "Jurisprudence",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Ethics & Professional Responsibility",
    "Areas3": "x",
    "Description": "This course introduces 1L students to the major legal theories and schools of jurisprudence. What is the relation between law and politics? How does law relate to morality? When is law legitimate or just? What are the sources of law's authority? Students will engage with the traditions of legal thought that understand law as primarily a matter of reason, will, morality, politics, history, power, culture, ideology, social order, emotion, language or professional practice. Approaching jurisprudence from this perspective helps to contextualize the map of modern legal theory (formalism, American legal realism, legal positivism, natural law, critical legal studies, among others).This course will invite students to reflect on the deeper forces that shape legal doctrine and influence its development. For their final grade, students can choose to write reaction papers during the semester or, alternatively, to answer a few questions from a list circulated well before the end of the semester.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6632",
    "Title": "Jurisprudence",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Ethics & Professional Responsibility",
    "Areas3": "x",
    "Description": "This course introduces students to select legal theories and schools of jurisprudence. It invites them to reflect on the deeper forces that shape legal doctrine and to master a theoretical vocabulary that will strengthen their ability to interpret law and to argue about its meaning. The course asks questions such as: What is the relation between law and politics? How does law relate to morality? When is law legitimate or just? What are the sources of law's authority? Students will engage with the traditions of legal thought that understand law as primarily a matter of reason, will, morality, politics, history, power, culture, ideology, social order, emotion, language or professional practice. Approaching jurisprudence from this perspective helps to contextualize the map of modern legal theory (formalism, American legal realism, legal positivism, natural law, critical legal studies, among others). Readings will include: Savigny, von Ihering, Austin, Bentham, Holmes, Hohfeld, Pound, Fuller, Hart, Kelsen, Raz, Dworkin, Finnis, Kennedy, MacKinnon, Waldron, Crenshaw. For their final grade, students will have over one month to answer three questions from a list of over twenty questions that the instructor will circulate well before the end of the semester. No background in philosophy is expected or necessary. No other pre-requisites. The course meets the Perspectives requirement. Students may write an additional credit paper to satisfy the writing requirement. Students in the Spring 2023 1L elective in Jurisprudence may not enroll.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6660",
    "Title": "Foundations of Western Law",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar will place students into a conversation with some of the key thinkers who have shaped our modern Western legal traditions. In addition to Plato and Aristotle, the readings will be drawn from 17th, 18th, and 19th century English, French and German political philosophers. Themes include: how these authors influenced common and civil law systems; the relation among religion, law and morality and the problem of human knowing; the concepts of \"law\", \"reason\", \"human nature\" and the foundations of rights theory; the shift from the good to legitimacy; the rise of individualism and the problem of community.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6673",
    "Title": "Law of War in Historical and Political Contexts",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "International & Comparative Law",
    "Areas3": "Civil & Human Rights Law",
    "Description": "This course is divided into two parts: (1) an introduction to the use of force in international law, first through a historical study of the origins of jus ad bellum in Greco-Roman thought and just war theories of the late Middle Ages through the Religious Wars, and next through a look at contemporary law governing the commencement of hostilities; and (2) jus in bello or the law of armed conflict, covering topics in international humanitarian law, the law of genocide, and U.S. law of war. The majority of this course will be devoted to the law of armed conflict as topics are discussed in their legal, historical, and political contexts. We will consider what is lawful in combat and treaty protections for civilians, the wounded, prisoners of war, and other noncombatants. After a study of the Nuremberg Trials, we will turn to the topics of detention, interrogation, and torture, considering historical examples and the policies of the Bush and Obama administrations post 9/11. We will then discuss the regulation of weapons in warfare and analyze case studies of how specific new technologies like remotely controlled unmanned aircraft (drones) and autonomous weapon systems challenge traditional understandings of the law of armed conflict. Later in the course we will cover the subject of genocide how it is defined, historical and contemporary examples, applicable law, and how the International Criminal Courts have applied the law. Our final topic will be cyberwar, AI, and the future of the law of war.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6676",
    "Title": "International Environmental Law",
    "Areas1": "International & Comparative Law",
    "Areas2": "Environmental Law",
    "Areas3": "Administrative & Government Law",
    "Description": "This course addresses the nature, content, and structure of international environmental law. The course commences with an introduction to international environmental problems, together with basic principles of international law and environmental regulation. Specific topics include global warming, stratospheric ozone depletion, and exports of hazardous substances. Other topics may include marine pollution, transboundary pollution, trade and environment, and development and environment. The course evaluates the role of international and non-governmental organizations; the interrelationship between international legal process and domestic law; and the negotiation, conclusion, and implementation of international environmental agreements. Class meets at the Fletcher School, Graduate School of International Affairs, Tufts University.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6677",
    "Title": "Mergers and Acquisitions",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "This course is an introduction to the legal rules and principles governing corporate transactions including mergers and negotiated acquisitions. We will begin with an examination of the deal structures used in most common transactions, focusing on statutory requirements and relevant Federal regulations. We will then turn to questions of the Delaware common law and the fiduciary duties of selling directors in the context of mergers and acquisitions. Finally, we will turn to the merger agreement. In that setting, we will study the structure of the merger agreement and typical provisions negotiated in merger agreements. The object of this final section will be to understand the incentives addressed by each such provision and the legal limits to their use.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS6679",
    "Title": "Trusts and Estates",
    "Areas1": "Family & Estate Law",
    "Areas2": "Tax Law",
    "Areas3": "x",
    "Description": "This course explores the basic law surrounding the disposition of property at death: (1) overview of the estate planning process and the policy considerations regarding inheritance law; (2) the process by which property is distributed in the absence of a will (intestacy); (3) the law of wills, examining challenges to the will, formal requirements for the execution of a valid will, revocation, and construction; (4) will substitutes and planning for incapacity; (5) the law of trusts, including revocable and pour-over trusts, and creditor and beneficiary rights; (6) brief coverage of powers of appointment, perpetuities, charitable trusts, and general tax considerations. This course does not address in detail tax-motivated estate planning (see instead Estate and Gift Tax and Estate Planning).",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS6682",
    "Title": "Commercial Law: Secured Transactions",
    "Areas1": "Real Estate Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "A massive amount of commercial and consumer transactions involve taking personal property as collateral. Article 9 of the Uniform Commercial Code governs nearly all of these. From car loans, to multi-billion-dollar subprime mortgage lending. From restaurant equipment, to commercial and private jets. From nonprofit hospitals, to crypto-assets. And from financing business day-to-day operations, to the largest leveraged buyouts. Article 9 is at the center of it all. We will study Article 9 extensively, as well as certain other statutes. The goal is to learn technical reading of the statute -- and statutes in general -- and practical implementation of this for lending lawyers. In addition to the traditional types of collateral, we will also look at increasingly important types of collateral such as intellectual property, certain financial instruments, and specialized contracts that are core to the healthcare industry.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS6686",
    "Title": "Anglo-American Legal Heritage",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "A study of how law originates and changes, with an emphasis on some of the fundamental controversies of legal history. The course will cover Anglo-American law and legal institutions from the Anglo-Saxon period through the twentieth-century legal realist movement, and will examine closely the origins of the courts and the jury, the sources of law, the development of precedent justice, and the growth of the legal profession. No previous background will be assumed, and the course will lead into the American Legal History course.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS6692",
    "Title": "IP Portfolio Management",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar will explore a range of issues encountered by IP practitioners related to IP management, enforcement, and defensive measures. While this seminar will focus on patents, we will also touch on issues related to trade secrets, trademarks, and copyrights, as they relate to the overall IP portfolio strategy and management. The purpose of this seminar is to preview the types of issues and considerations that IP practitioners face when implementing IP strategies for companies and law firms.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS6696",
    "Title": "International Trade and Investment Law",
    "Areas1": "International & Comparative Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This is an integrated and comprehensive course on the law, theory and policy of international trade and foreign investment law, which together comprise international economic law (IEL). The course will introduce students to the treaty-based WTO international economic law system, its principal agreements and institutions, its core doctrines, and some of its current policy questions. The course will also introduce students to the law of foreign investment, key doctrines, and the contemporary BIT system. The course will conclude with an examination of current issues and challenges, such as IEL dispute settlement, IEL and development, IEL and the environment, and IEL and human rights.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6760",
    "Title": "China's Challenge: The Role of Law in the PRC",
    "Areas1": "International & Comparative Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "For better or worse, China impacts all our lives. She is a leading force on the global political and economic scene. At the same time, she faces epic problems concerning the environment, corruption, increasing income gap and much more. This course examines China's project of legal development since the 1980s, which is perhaps the most concerted effort in world history to build a legal order and yet one that continues to encounter difficulties in addressing the nation's many challenges. After a short review of China's pre-revolutionary legal history and an introduction to its principal modern legal institutions, this course will look at a cross-section of the most important legal questions confronting China and a world seeking to deal intelligently and effectively with it. Areas of focus will include legal questions surrounding the economy, foreign investment, intellectual property protection, the political sphere, social issues, and dispute resolution.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6822",
    "Title": "Corporate Governance - In House Practice",
    "Areas1": "Corporate & Securities Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This practice-oriented course will provide a real world perspective on in-house practicethe unique issues faced by in-house legal counsel. The course is intended for students whowant to understand what is involved in an in-house practice and the elements thatdifferentiate it from other practice areas. The course will draw up learnings from traditionallaw school classes (e.g., Contracts, Corporations, Securities, etc.), and apply them in a practicalbusiness environment, in which a broad number of competing non-legal issues are considered. The courseis intended to provide an understanding of the practical skills needed and issuesfaced by in-house lawyers. The course will start with an overview of inhouse practice and theelements that differentiate it from other practice areas. It will then provide a more in-depthfocus and discussion of various topics and issues often faced by in-house counsel in todaysenvironment. The course will utilize various reading materials and case studies, as background, for in-class discussion of the various topics. To create a true in-house practice understanding,students will be asked to draft various memorandum and engage in in-class simulations, with afocus on effective analysis and communications skills.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6826",
    "Title": "Corporate Compliance: Building a Strong Compliance Culture",
    "Areas1": "Corporate & Securities Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "This course will provide students with an understanding of the primary aspects of designing, implementing, and maintaining effective corporate compliance programs that will withstand the test of time. The course will examine the key aspects that make up an effective program and comply with the Department of Justice (DOJ) expectations for such programs. Students will examine recent high profile case studies involving companies whose compliance programs were tested by courts, prosecutors, and the public at large. The course will also explore the public policy interests associated with giving corporations favorable consideration by prosecutors for having in place strong compliance programs in exercising prosecutorial discretion. Regular attendance, preparation, and participation in class will be required. The reading materials will be available via the course website. Class participation will count towards 20% of the final grade. There will be a take-home exam at the end of the semester.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6827",
    "Title": "Compliance and Risk Management",
    "Areas1": "Corporate & Securities Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "Business organizations and their directors/executives often face a complex, onerous, and global regulatory landscape, particularly for public companies and businesses operating in financial services, health care, consumer products, and other highly-regulated industries. As numerous corporate scandals have illustrated, the risk of fraud or regulatory breach can lead to civil and criminal liability, heavy sanctions, and significant reputational damage to companies and individuals. Against this backdrop, compliance has emerged as the growing, dynamic practice of identifying and mitigating legal risks through prevention, detection, and remediation. Students will learn the history and legal underpinnings of corporate governance, compliance, and risk management standards particularly as applied to public companies and regulated financial services firms. Topics will include fiduciary duties; the roles and interactions of board directors, executives, lawyers, compliance officers, auditors, regulators, and enforcers; compliance program effectiveness; internal investigations; corporate and individual liability; and ethics considerations. Students will also gain practical experience through case studies on high-profile compliance and risk management failures.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6842",
    "Title": "Media Law and Litigation",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Constitutional Law",
    "Areas3": "x",
    "Description": "This course offers an in-depth study of First Amendment media and defamation law, together with a clinical component designed to develop litigation skills. The seminar will cover such issues as the evolving concept of what constitutes defamation, the public figure doctrine, the opinion defense, confidential sources, burden of proof, Internet and social media, and related issues. Students will draft pleadings in a hypothetical case and take the depositions of the parties, witnesses and an expert. Heavy emphasis will be placed on class participation. In lieu of a final exam, students will be required to prepare a summary judgment memorandum based on both the case law and the discovery information developed during the course, using transcripts of the depositions.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS6864",
    "Title": "Comparative Law",
    "Areas1": "International & Comparative Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "TBD",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS6880",
    "Title": "Dangers of the Administrative State: Advanced Topics in Administrative Law",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "This seminar course will focus on important debates and real-world controversies relating to administrative and structural constitutional law. It will examine from practical, constitutional, and rule-of-law perspectives central features of the modern administrative state, including as characterized by some of its strongest critics. Are various aspects of federal agencies genuinely worrisome, or reflective of the complexity of governance? What forces have driven the evolution of government agencies? And what have critics of relevant constitutional doctrine and administrative law gotten wrong? Our primary aim is to foster fruitful discussion about whether the administrative state is lawful, based on both theoretical material and materials from popular discourse (such as long-form journalism and visual media). Our meetings will cover topics such as whether the administrative state is revolutionary, unlawful, or immoral; presidential power and the New Deal; the separation of powers; the legislature and independent agencies; administrative due process; and governmental involvement in immigration, healthcare, and financial regulation. Major themes will include the intersection of law and politics, the role of agencies in relation to the branches of government, and the criteria for understanding whether the administrative state is succeeding or failing. Prior background is welcome but not assumed; all are welcome to enroll. Students will be evaluated based on class participation and a final seminar paper.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7462",
    "Title": "Advanced Human Rights Class",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Advanced Human Rights Practicum is a 3-credit pop-up clinic that allows students who have completed the International human Rights Practicum the opportunity, with permission of the Clinic Director, to stay engaged in the Clinic's long-term matters and experience new lawyering responsibilities. The representative matters include litigation in compliance procedures of integral reparations and non-repetition measures decisions in cases before the Inter-American Court of Human Rights and policy advocacy projects with the Inter-American Commission on Human Rights. Advanced International Human Rights Practicum students will work alongside students in the International Human Rights Practicum and be supervised by the Clinic Director.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7482",
    "Title": "Law of Toxic Substances",
    "Areas1": "Environmental Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will provide students with an in depth review of the laws and policies regarding the introduction of hazardous substances into the marketplace, the handling and release of such substances, and the storage, treatment, and disposal of hazardous wastes. The course also will study the investigation and remediation of chemical releases, including examining both major cleanups at \"Superfund\" sites and the cleanup and redevelopment of \"Brownfield\" sites. Students also will review how these environmental issues impact purchase and sale of real property and how due diligence and allocation of liability can be handled in transactions involving contaminated property. The course will focus in particular on the TSCA, RCRA, and CERCLA statutes. The course will emphasize the practical aspects of practicing environmental law. During the course students will do three papers/practical exercises in lieu of exams.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7645",
    "Title": "Election Law",
    "Areas1": "Administrative & Government Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course focuses on issues relating to the franchise. The franchise is central to a democratic republic. Voting not only determines who will be in the government, it establishes the legitimacy of any government that flows from accountability to the governed. Thus, a government must establish and protect a franchise that is fairly available and fairly administered. However, this seemingly simple goal masks a wide range of problems. Some examples are redistricting and gerrymandering (both partisan and racial), questions of voter suppression, including voter ID and \"purging\" of rolls, campaign finance, and bribery of candidates. The course is given in seminar form for 2 credits. The grading instrument is a paper of 25-30 pages in length. Students work closely with the instructor in developing and researching a topic.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7646",
    "Title": "Election Law - Voter Suppression",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "This course focuses on issues relating to the franchise. The franchise is central to a democratic republic. Voting not only determines who will be in the government, it establishes the legitimacy of any government that flows from accountability to the governed. Thus, a government must establish and protect a franchise that is fairly available and fairly administered. However, this seemingly simple goal masks a wide-range of problems. Some examples are redistricting and gerrymandering (both partisan and racial), questions of voter suppression, including voter ID and purging of rolls, campaign finance and bribery of candidates. This year the course has beenreconfigured in two significant ways. First, there will be greater emphasis on racial issues in voting. This issue is part of the national debate on attacking systemic racism. Second, we will have frequent discussion on the related issues of the debate over voter suppression. The course is given in seminar form for 2 credits. Thegrading instrument is a paper 25--30 pages in length. Early in the course I will circulate a list of &#34;representative paper topics&#34; on Canvas.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7652",
    "Title": "Healthcare Law and Compliance",
    "Areas1": "Health Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Healthcare Law and Compliance offers the student with a personal or professional interest in the healthcare industry and/or criminal law the opportunity to develop a basic understanding of the legal framework and ethical issues involved in today's healthcare environment. The seminar will use a practical, case-study approach to some of the issues arising in the complex world of healthcare enforcement and compliance. Emphasizing the procedural mechanisms of the False Claims Act and the substantive law of the Anti-Kickback Act, the Stark Laws, the Food and Cosmetic Act, the seminar will explore the following: how prosecutors, defense attorneys, whistleblowers, and compliance officers approach their work; the relationships between regulated industries (pharmaceuticals; hospitals; doctors; medical device companies) and government insurance companies (Medicare; Medicaid); legal and ethical issues arising from the expanding edges of healthcare technology and treatment.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7654",
    "Title": "Federal Health Law, Policy, and Politics",
    "Areas1": "Health Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Satisfies the Upper Level Writing Requirement and the Perspectives Requirement. This course will evaluate; the reasons for the US health care system's high costs & poor outcomes; the Affordable Care Act's methods, successes & failures in expanding access to, & improving the quality & cost of health care; judicial & legislative challenges to the ACA's individual & employer mandates, Medicaid expansion, subsidized coverage & mandated benefits (including no-cost contraceptives); GOP efforts to repair, repeal or replace the ACA; & emerging challenges to the Trump Administration's use of executive orders, suspension of notice and comment rulemaking & incremental legislation to destabilize the ACA & change access to health care and coverage. We will also examine two of the nation's most urgent public health crises; gun violence & the opiod epidemic. Both increase mortality, morbidity & costs. Both illustrate the adverse impact of inconsistent laws & policies for individuals, health care providers, private industry and lobbyists, and state & fed. government. Both demonstrate the increasing importance of litigation in seeking redress for the unsustainable costs & unbearable health burdens that federal policies have shifted to states, municipalities & individuals. Both underscore the importance of law in promoting and impeding public & personal health. The course is NOT intended to instill a particular point of view but only to enable your own views, criticisms and disagreements to be informed by reality, not myth. No need for an interest in practicing health law",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7708",
    "Title": "Business Law and Health Care Enterprises",
    "Areas1": "Health Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar focuses on the business and corporate practices of health law. It covers legal issues involving private and government insurance, managed care, tax-exempt status, health care organizations, professional contracts, and labor relations. Evaluation will be based on a substantial paper, class presentation, and class participation.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7710",
    "Title": "Constitutional Theory",
    "Areas1": "Constitutional Law",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "Great constitutional questions always evoke constitutional theory. This course focuses on the great constitutional questions of our time, from the institutional design of electoral systems to the future of the separation of powers; from the constitutionalization of the economy to the constitutionalization of the environment; from the constitutionalization of the family to the constitutionalization of entertainment; from the clash between information and privacy to the tension between constitutional stability and cultural change. Students read landmark judicial decisions as well as the most fecund constitutional scholarship. Graded on final paper. No knowledge of constitutional doctrine or of legal theory assumed. Students and auditors from across the university are welcome. No pre- or corequisites. Meets the Law School's Perspectives Requirement.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7717",
    "Title": "International Investment Law: Evolution and Challenges",
    "Areas1": "Corporate & Securities Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "In this seminar we will explore the historical origins of international investment law (IIL), the body of law that governs foreign direct investment and the resolution of disputes between foreign investors and sovereign states. We will draw on an array of historical sources, cases, and the multidisciplinary scholarly literature to analyze how the norms and practices governing centuries of cross-border investment coalesced into a body of law during the late twentieth century. From a global perspective (focusing on the U.S., Latin America and the Caribbean, and Europe in particular) we will study the influence on ILL exerted by theories of race, economic development, legacies of colonialism and empire, pressures of globalization, and generations of IIL practitioners.We will build on these historical explorations to consider new critiques, theories, and practice-relevant aspects of IIL. Topics include the evolution of standards of treatment for foreign investors, the proliferation of bilateral investment treaties, the rise of investor-state arbitration, the role of large law firms, and various proposals for IIL reform designed to achieve greater equity and fairness.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7723",
    "Title": "Partnership: Transactions, Planning, and Tax",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "This course will examine tax and economic issues associated with partnerships and limited liability companies. There will be occasional reference to substantive state partnership law as necessary to understand other concepts. Aimed at students interested in small business, venture finance, real estate, or general transactional work as well as taxation.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7724",
    "Title": "Advanced Immigration Class",
    "Areas1": "Immigration Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This class is a continuation of the Innocence Clinic.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7727",
    "Title": "Whistleblowing and Retaliation",
    "Areas1": "Administrative & Government Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The laws relating to whistleblowing have evolved dramatically in the last twenty years. Additionally, whistleblowers in both the private and public sector have increasingly played a more prominent role in influencing social reform and public policy. The courts, legislatures, and government agencies charged with enforcing whistleblower laws have wrestled with the degree to which whistleblowers should be protected from retaliation and under what circumstances they should be incentivized to come forward by the prospect of a monetary award. In the private sector, courts remain divided over the proper balance between whistleblower protection and enforcement of legitimate corporate business interests such as the protection of confidential and proprietary information and trade secrets. In the public sector, challenges abound to balance to competing interests in disclosing alleged wrongdoing while protecting national security. In addition to examining the dramatic evolution of the laws and social policies relating to whistleblowing, this course will also examine the many ethical issues presented such as when and under what circumstances can an attorney present as a whistleblower. Finally, this course will examine best practices from a corporate compliance perspective to foster transparency and to effectively investigate whistleblower claims as they arise.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7731",
    "Title": "Administrative Law",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Environmental Law",
    "Areas3": "x",
    "Description": "This course will examine the principles of law that govern the work of administrative agencies. Topics include: constitutional and statutory sources of agency authority; the appointment and removal of executive officers; constitutional and statutory constraints on administrative rulemaking and adjudication; standards for judicial review of agency conclusions of law and policy; and civil and appellate procedure applicable to judicial review.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7732",
    "Title": "Church and State",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will examine the multitude of legal and policy issues that flow from the \"Religion Clauses\" of the First Amendment (Establishment and Free Exercise). The prohibition on establishment raises important questions such as religion in schools, aid to religious schools, and governmental display of religious symbols such as crosses and the Ten Commandments. The guarantee of free exercise presents particular problems when the practices of minority religions vary from generally applicable norms. We will consider the intersection of religion and national security in the context of measures that seem to single out the Islamic faith for special scrutiny.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7733",
    "Title": "Business Bankruptcy",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "This course explores business reorganization under Chapter 11 of the Bankruptcy Code. It also touches on Chapter 7 liquidation for business entities. It adopts a problem-solving approach. Secured Transactions is recommended but not required. Students should take this course if they plan to practice any type of business law -- transactional as well as commercial litigation.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7736",
    "Title": "Remedies",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "Remedies is a supplement to many other courses, studying in greater operational detail the many forms of relief that may be available to successful plaintiffs. The major categories are monetary remedies (damages and restitution, primarily) and specific remedies (such as injunction or specific performance).Different types of claims have different damages rules. Contract damages, are different for buyers and sellers, or for building contractors and owners. Damages rules in tort are different for bodily injury, and/or property damage, or defamation, or other injuries. Many remedies have some specialized issues of procedure or evidence. Remedial law is not easily classified as substantive or procedural because remedies rules are designed to effectuate the policies of the underlying primary law and therefore seem substantive, but they operate in litigation and therefore seem procedural. The grant or denial of the remedy is the ultimate exercise of judicial power in civil litigation. Therefore, the course presents an opportunity to think more about the distinctive characteristics of adjudication in a democratic capitalist society. Additionally, predictive judgments and uncertainty about potential remedies underlie virtually all settlements. Whether tried to conclusion or settled, every case is about what might happen, or what remedy, if any, will the plaintiff get. Therefore, the remedies course is obviously important for lawyers who anticipate engaging in civil litigation. A working knowledge of remedies is also useful for lawyers engaged in planning and transactional work, as in being able to advise clients what might happen if things go wrong. The method of assessment will be an exam at the end of the course.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7739",
    "Title": "Conflict of Laws",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Constitutional Law",
    "Areas3": "x",
    "Description": "Disputes often arise involving transactions, occurrences, or events that touch on the laws of different legal systems--a car crash in Missouri involving residents of California and New York, a contract between a U.S. purchaser and a seller in Italy, a marriage in Nevada between two Canadian citizens who reside in Massachusetts, etc. When such disputes result in litigation, how should a court determine which jurisdiction's laws govern which aspects of the parties' legal rights and responsibilities? This course examines the ways in which courts determine which substantive, procedural, and remedial law should be used to adjudicate disputes involving such multi-jurisdictional contacts. This course will be of special interest to students considering a career in litigation as the problem of conflicting law is endemic in modern litigation, and the ways in which courts resolve these conflicts is not intuitive. Topics covered will include the historical development of principles governing conflicts between the laws of different states within the U.S. legal system and modern approaches to such questions; the role of state and foreign law in federal court adjudication; constitutional limits on choice of law; and the legal effectiveness of judgments issued by courts in a different jurisdiction.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7741",
    "Title": "European Union Practice",
    "Areas1": "International & Comparative Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "European Union Practice will provide students with an introduction to European Union Law, with a focus on practical applications. This course will be useful to anyone anticipating practice in an EU system, and is of particular benefit for BC Law Students participating in the spring 2024 Dublin Program. The course will consist of approximately 12 lectures by experts and will provide (1) an overview of the EU system; (2) introduction to key topics of legal practice in the EU, including fundamental civil and political rights, economic rights, financial regulation, privacy, and other common EU topics that arise in practice; and (3) instruction in how to research EU and Irish law. Readings will be posted on our class Canvas site. Evaluation will be based class reflections, short research exercise, and a short final paper exploring an EU topic in the area that the student anticipates practicing in. This EU Practice seminar is not intended to replace a full European Union Law course, which will delve more deeply into the theoretical and political dynamics of EU law.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7743",
    "Title": "Estate Planning",
    "Areas1": "Family & Estate Law",
    "Areas2": "Tax Law",
    "Areas3": "x",
    "Description": "This course provides a practical approach to estate planning, the process by which lawyers work with their clients to provide for the transfer property during life and upon death. Estate planning involves wills as well as trusts to provide for the care of minor children, establish charitable bequests and obtain favorable tax treatment. It also involves planning for succession of businesses and planning for retirement benefits and life insurance. We will be focusing on practical estate planning techniques as well as how an estate planner prepares documents to create a complete estate plan. Estate and Gift Tax is recommended, however, students can also take course with permission of the professor.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7746",
    "Title": "Copyright",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will give you an introduction to copyright, including a foundation in the theories underlying copyright law, an understanding of the current contours of copyright protection, the basic elements of proving infringement, the fair use defense to and remedies for infringement, and familiarity with related forms of liability such as secondary and vicarious liability. Each class meeting will consist of a combination of lecture and class discussion. Our discussions will sometimes focus on dissecting a landmark case and other times on working through the dynamics of a transaction or a policy question based on your reading. Well also work through hypotheticals based on real-world examples and explore scenarios that will require you to think from a variety of different perspectives.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7747",
    "Title": "Family Law",
    "Areas1": "Family & Estate Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Studying family law provides an opportunity to review much of what has been foundational in your legal education. Family law can be seen as a matter of constitutional law, property law, civil procedure, and contracts. Family law also provides an important opportunity to explore critical theories, including critical race theory, feminist theory, and queer theory. Family law is about power: power inside intimate relationships and the power of the state over intimate relationships. Laws codify certain family structures; these structures, in turn, tell us much about societys values, about who we notice and who we privilege. We will consider what jurisprudence is appropriate given dynamic and shifting visions of what family is, does, and should mean.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7749",
    "Title": "Immigration Law",
    "Areas1": "Immigration Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "U.S. immigration law involves such technical questions as how to obtain a visa, a \"green card,\" citizenship and who is subject to deportation. It is also \"a magic mirror\" in which the highest aspirations and the deepest biases of American legal culture and history are reflected. This course explores both aspects of this complex area of law: the technical/legal and the political/philosophical. It involves constitutional law, administrative law, statutory interpretation, among other disciplines. There are traditional lectures, class discussions, in-class exercises, outside speakers, films, and court visits. The three-credit course requires class attendance, participation, and a final exam. More detailed information will be available in the first class. It is a pre- or co-requisite for the Immigration Clinic.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7750",
    "Title": "Corporations",
    "Areas1": "Corporate & Securities Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "This is the basic course in corporation law. It focuses on the governance structure of the corporation and the allocation of power and responsibility among shareholders, directors and officers. Topics covered will include corporate formation, choice of entity, shareholder voting fiduciary duties of officers and directors, insider trading, and the role of the corporation in society.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7753",
    "Title": "Scientific and Expert Evidence Seminar",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "Civil Litigation & Procedure",
    "Areas3": "Criminal Law & Procedure",
    "Description": "TBD",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7756",
    "Title": "International Tax",
    "Areas1": "International & Comparative Law",
    "Areas2": "Tax Law",
    "Areas3": "x",
    "Description": "This course examines U.S. income tax laws and policies relating to the taxation of foreign income of U.S. persons and U.S. income of foreign persons. Emphasis will be on fundamental issues, such as jurisdiction to tax, source of income, U.S. taxation of foreign persons, relief from double taxation of income subject to taxing jurisdiction of two countries, U.S. taxation of foreign income earned by foreign entities owned by U.S. persons, transfer pricing in transactions between related parties, and income tax treaties. Reference will be made to how other countries address these international tax issues.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7757",
    "Title": "Labor Law",
    "Areas1": "Labor & Employment Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "What do the NFL, Major League Baseball and other professional sport leagues, the entertainment industry, the Writers' Guild, as well as large portions of the health care, hospitality, service and manufacturing industries, to name a few, have in common? Collective bargaining and the law governing that process regulates employment relations in all these industries. This course examines the Nation's basic collective bargaining statute, the National Labor Relations Act, the statute that provides the basic model for public-sector labor relations as well. Among other issues, this course examines the legal framework for bargaining, for dispute resolution through the grievance-arbitration process, the regulation of economic pressure tactics, union organizing and a series of Constitutional issues affecting this area. Current trends are highlighted and existing doctrine is studied in light of its demonstrated or likely impact. Evaluation by examination.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7759",
    "Title": "Land Use Law and Planning",
    "Areas1": "Environmental Law",
    "Areas2": "Administrative & Government Law",
    "Areas3": "Real Estate Law",
    "Description": "This course will provide participants with a detailed and national review of the techniques used by local and regional governments to regulate the development of real property. Strong emphasis will be placed on the relationship among land use planning, land use law, and natural resources. We will focus in detail on numerous traditional land use planning controls (zoning, subdivision control, and health regulations) but spend considerable time analyzing the legal issues involved in the use of more innovative land use regulations (transfer of development rights, exactions, impact fees, and development agreements). Participants will become well-versed in all aspects of local, regional, and state land use controls and permitting procedures for residential and non-residential development.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7762",
    "Title": "Criminal Law Theory",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "One phenomenon is universally implicated in social order: coercion. A specialized form of coercion is that deployed by constitutional orders as punishment, or the threat thereof, for criminal offenses. In crime and punishment constitutional orders seek a mechanism to promote their values, avert their fears, and facilitate social cohesion and coordination. This 3-credits course interrogates the conditions under which penal coercion may transmute into legal authority consistent with freedom, equality, justice, and dignity. Readings consist of exemplary works that focus on the conceptual structure of criminal law, on its justification, and on its position within society. The course grade is based on a final paper, and can be taken pass/fail. Students from across the university and beyond are welcome to enroll or audit.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7769",
    "Title": "Health Law",
    "Areas1": "Health Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will introduce students to patient care issues within the context of the U.S. health care delivery system. The course will cover both legal and policy aspects of: (1) Cost, quality, access, and health care delivery in the U.S.; (2) Medical liability and the provider/patient relationship; (3) Regulation of private health insurance and the impact of health reform; (4) Selected current issues in bioethics.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7773",
    "Title": "Consumer Financial Protection Seminar",
    "Areas1": "Business Law",
    "Areas2": "Health Law",
    "Areas3": "x",
    "Description": "This seminar will focus on the developing law of consumer financial protection and the new Consumer Financial Protection Bureau.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7774",
    "Title": "Securities Regulation",
    "Areas1": "Corporate & Securities Law",
    "Areas2": "Administrative & Government Law",
    "Areas3": "Business Law",
    "Description": "This course provides an overview of the federal regulation of the issuance and trading of stocks and other securities, focusing on the Securities Act of 1933 and the Securities Exchange Act of 1934. We will analyze the regulation of the public offering of securities and discuss the structure and operation of securities trading markets. Topics covered will include the disclosure regime for public companies, exemptions from the securities laws' registration requirements, and liability under the securities laws, including sanctions for fraud and insider trading.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7775",
    "Title": "Taxing the Rich",
    "Areas1": "Tax Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "Civil & Human Rights Law",
    "Description": "We live in a time of extraordinary inequality and concentration of wealth. According to recent data from the Federal Reserve, the wealthiest 1% of Americans own 44 trillion dollarsmore than the combined wealth of 90% of Americans. Moreover, all signs point to continued concentrations of wealthparticularly among the wealthiest of the wealthyrecent data shows that Americas billionaires saw their wealth grow an unprecedented 62% over the course of the pandemic. While the wealthy are clearly owning more and more of the countrys wealthone thing that is far less certain whether any of this wealth will ever be subject to taxation so that it can be used to support the expenses of governmentlike national defense, roads and bridges and taking care of our most vulnerable citizens. On the one hand, it would seem that the answer would be an obvious yes. After all, the federal government imposes multiple taxes often at progressive ratesdesigned to ensure that those with the most pay the highest amount. On the other hand, some have argued that the rules are not as they initially appear and that there are many ways that the wealthy are able to avoid paying taxes. While there have been a lot of different views around whether the rich pay a lot or little taxes, beginning last year, the public for the first time had access to something it rarely had access to that is information from actual tax returns of some of the wealthiest Americans as and that data has shown some alarming resultsnamely Americas wealthiest contributing little or no taxes. This seminar will explore questions around taxing the rich. What do we knowand not knowabout the wealth and tax liabilities of the rich? What are some of the features of the current system that allow the wealthy to avoid paying taxes? What proposals have been made to change the status quo? How effective are they likely to be? This course will be graded based on preparedness and participation in seminar discussions and writing assignments throughout the semester, as well as a longer seminar paper on a topic of your choice. For those interested in getting writing credit, you can do a longer paper for an additional credit. Credits 2 or 3. Recommended: One prior tax course",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7776",
    "Title": "Tax Concentration Seminar",
    "Areas1": "Tax Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "One credit seminar in which students pursuing the tax concentration develop additional tax expertise in targeted areas through a combination of: (1) one-on-one sessions with tax faculty on special tax topics including special timing rules, advanced corporate transactions, and related issues (and completion of assigned problem sets) and (2) attendance at four tax policy workshop presentations during the semester (preceded by a meeting with the instructor prior to the workshop and the submission of a comment paper for each workshop attended).",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7777",
    "Title": "Taxation II",
    "Areas1": "Tax Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "Business Law",
    "Description": "Taxation II explores the taxation of corporations. After a brief review of the other common forms for organizing a business and their distinctive tax treatments, the course focuses on the most important federal income tax issues relating to the organization, operation, liquidation and reorganization of publicly-traded corporations (and other \"C\" corporations). This includes the relationship between corporations and shareholders and the treatment of dividends and redemptions. The course is important for any student thinking of practicing in the general business area, even if she or he does not intend to become a \"tax specialist.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7778",
    "Title": "Taxation III (Advanced Corporate Tax)",
    "Areas1": "Tax Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "Business Law",
    "Description": "Tax III is the most advanced course in the tax curriculum (note that Tax I and Tax II are prerequisites). It deals with both taxable and tax-free corporate acquisition transactions, the treatment of net operating loss carryovers, single corporation reorganizations and an introduction to the consolidated return rules and subchapter S. Students will engage in a variety of projects including some mix of the following: negotiate the terms of an acquisition transaction, prepare drafts for a request for a private letter ruling from the IRS, and draft tax opinions letters.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7780",
    "Title": "Tax Policy",
    "Areas1": "Business Law",
    "Areas2": "Tax Law",
    "Areas3": "x",
    "Description": "This course examines the legal, economic, and political considerations relevant to the formulation and implementation of federal tax policy. The specific issues will vary, but, in general, will deal with some or all of the following issues: the concept of income and the tax base; defining efficiency and equity; ability to pay and progressivity; the tax expenditure concept; consumption taxation; the double taxation of corporate income; the estate tax; and current tax policy legislative initiatives.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7781",
    "Title": "Legal Scholarship Workshop: Regulation and Business",
    "Areas1": "Business Law",
    "Areas2": "Administrative & Government Law",
    "Areas3": "Corporate & Securities Law",
    "Description": "This workshop will feature presentations by five or six invited legal scholars of their works-in-progress concerning law, business, and the regulation of economic activity, broadly construed. Students will meet with one or more BC faculty conveners the week before each presentation to discuss the paper. (The faculty conveners are: Renee Jones, Patricia McCoy, Diane Ring, Shu-Yi Oei, and Natalya Shnitser.) Students will prepare one-page response papers for each work-in-progress presented. Response papers will be shared with the authors. This workshop is designed for students who are interested in publishing during law school and in legal scholarship more generally. It is also well suited for students with an interest in economic regulation, business, and corporate governance. 1 credit, pass/fail.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7785",
    "Title": "International Law",
    "Areas1": "International & Comparative Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course is designed to familiarize students with the operation and institutional structure of the international legal system, the law of nations that govern relations among states. The first portion of the course, consisting of somewhat more than half of the semester, will address the principal attributes of the international legal system, including (1) sources of international law; (2) subjects of international law; (3) jurisdiction of states; (4) international adjudication and dispute settlement; and (5) the law of treaties. The remainder of the course, as time permits, will be devoted to special topics, including such subject matter as the law of the sea; the international law of human rights; the use of force in international law; and diplomatic and consular immunity.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7789",
    "Title": "Entertainment Law",
    "Areas1": "Business Law",
    "Areas2": "Intellectual Property & Technology Law",
    "Areas3": "x",
    "Description": "Most entertainment law practitioners agree \"Entertainment Law\" has no set definition, but includes a hybrid of distinct areas of the law, including but not limited to, copyright, trademark, contracts, wills, estate planning, real estate, bankruptcy and intellectual property. Course focuses on the protection of IP and the contractual relationships between various parties in the Entertainment and Music Industry. A major focus will be analysis of the Copyright Act of 1976, as amended, the Digital Millennium Copyright Act, and the protection of IP and contractual rights in TV, film, music, books, etc. The relationship between the artist and his/her manager, agent, lawyer, and record company will be explored in great detail. Course will cover representation of artists and music labels and the problems they encounter. Students will participate in a group exercise where they negotiate a record deal on behalf of either the artist or the record label, and report back their terms to instructors.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7791",
    "Title": "Food and Drug Law",
    "Areas1": "Health Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Food and Drug Administration (FDA) regulates 25% of the U.S. economy and exerts decisive authority over the commercial availability of new therapeutic drugs and medical devices by controlling pharmaceutical patents, drug and device manufacturing and clinical research. The Agency plays a leading role in assuring the safety of food grown, imported and distributed in the U.S. and controls food labeling, including use of the terms &#34;organic&#34; and &#34;natural.&#34; Through lecture, reading assignments and discussion, this course will provide background on the legislative authority which underlies FDA activities, the processes and procedures by which the Agency carries out its mandate and the public policy debates which deal with the tension between accelerating approval of new treatments for incurable diseases such as AIDS, cancer and Alzheimer's disease and the demand to improve the safety of marketed drugs and foods. Enrollment is limited.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7792",
    "Title": "Federal Courts",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Constitution assures that the separate powers conferred upon each of the branches of the federal government serve as a check and balance to prevent abuse of power by any single branch, and that the aggregate of federal power, while supreme, is limited in scope, thereby serving to bind the union and simultaneously respect state sovereignty. This course will explore these two themes as they relate to the role of federal courts. Among the topics to be covered: separation of powers, federalism, congressional power to curtail federal jurisdiction, the case and controversy requirements as it relates to doctrines of standing, ripeness, and mootness, sovereign immunity, Congressional power to abrogate Eleventh Amendment immunity, Ex Parte Young doctrine, section 1983 litigation, absolute and qualified immunity in suits against state and federal officers, abstention doctrines, inter-system preclusion, and Rooker-Feldman doctrine. Evaluation will be by an in-class exam.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7798",
    "Title": "LLM Thesis",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "An extended independent study writing project.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7799",
    "Title": "Independent Study",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "TBD",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7805",
    "Title": "The Courts and the LGBT+ Movement: A Critical Assessment",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The seminar will examine the role of the courts in both enabling and hindering the remarkable social/political/cultural shifts that have made it possible for many lesbian, gay, bisexual and transgender Americans to participate more fully in our common life while being as open as they choose about who they are, creating for many of us a changed landscape impossible to have imagined a just a few decades ago. The First Amendment will be a primary focus, although the questions posed will inevitably spill over into considerations of the Due Process and Equal Protection provisions of the Fourteenth Amendment. Our perspective will be critical, recognizing evolving openness in the courts where it appears and at the same time calling out the conscious, unconscious and systemic bias that continues to pervade the law. The plan is to begin with the unlikely emergence of the First Amendment as a friend to LGBT+ folk in the otherwise hostile legal landscape of the Fifties. Then, we will track how, fertilized by the African-American civil rights and feminist movements of the Sixties and early Seventies, the right to speak burgeoned into the right to participate openly incivic venues that were formerly off limits. We will look at how, and to what extent, the role of the state as guardian of gender conformity lost much of its power to impede openness and equality for people who had historically been regarded as simply beyond the pale of community. We will examine the redlines that queer people were forbidden to cross, like the scouts, the military, athletics, parenting and marriage; and the extent to which those lines have eroded or become more rigid.We will assess the blowback, such as the spate of laws forbidding discussion of sexual orientation and gender identity in the schools; laws targeting transgender individuals; and the increasing use of the First Amendment to create exemptions to public accommodation laws.Finally, we will think together about the advantages and possible drawbacks of the strategies employed to advance equality for LGBTQ+ folks as these strategies relate to the larger struggle for human liberation and for the fostering of an environment that makes it easier for the planet and its inhabitants to thrive.To help facilitate this discussion, one or more sessions will, if feasible, include practicing attorneys working in this area of the law. There will be final paper in lieu of an examination. Grades will be based on the paper and class participation, including weekly response papers to the material covered in our weekly sessions.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7840",
    "Title": "Patent Law",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course covers the major doctrines and policies at work in modern patent law. While current law will be taught in detail (both the 1952 Act and the America Invents Act), the course will also focus on enough history and policy so that students are equipped to deal with, and make predictions about, the rapid changes in patent law that we have witnessed recently and that we will continue to see. The course also has a skills component. Students will learn to review prior art, analyze the validity and novelty of particular patents in the form of claim construction charts, and make oral arguments for summary judgment on issues of validity, novelty, and claim construction in front of patent practitioners in the field.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS7851",
    "Title": "Reflections on Critical Race Theory, Justice, and Debt",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "Critical Race Theory (CRT) refers to a surge of legal scholarship, starting in the late 1980s, that challenged conventional anti-discrimination thinking. CRT scholars view racism as institutional and as baked into both American law and society. The recent nationwide protests for social justice have further exposed the deep interconnections between race and law, and particularly the ways in which race and law are mutually constitutive. This course will focus on the body of theoretical work on the law and politics of race which has come to be known as CRT. The seminar will pursue two main, overlapping goals. The first is to introduce key concepts associated with CRT, and to examine the specific analytic strategies and forms of argument critical race theorists have deployed to investigate the uses and meanings of race in U.S. legal institutions and ideology. The second is to map the connections between CRT and broader national and transnational debates about race, racism and racial justice. Special attention will be paid to social movements to protest racism, police violence against and incarceration of disproportionate numbers of people (especially men) of color, and the criminalization of debt. Readings will come from law and non-law sources, including law reviews and the work of a variety of social scientists. The course will discuss issues relevant to the legal system and the study of law generally, including the use of data to measure legal problems, the role of lawyers and non- lawyers, and the nature of modern policymaking. This course is a 2-credit seminar. Evaluation will be short non-research &#34;reflection&#34; papers and class participation.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7852",
    "Title": "Critical Race Theory Reading Group",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "This one-credit, pass-fail seminar offers participants an introduction to Critical Race Theory (CRT) as well as an opportunity to delve more deeply into an area of interest. The class will meet for 90-minutes for ten classes during the spring semester. In the initial five classes, we will explore seminal articles within Critical Race Theory. Students are then responsible for choosing topics and assignments for the next five sessions, which enables students to develop an area of interest while deepening their understanding of CRT. Students will work in pairs throughout the semester to lead class discussions. Attendance and participation are required to pass. Students interested in satisfying the Upper Level Writing Requirement may opt to do a 2-credit graded independent study and write a 30-page research paper this option would also satisfy the Perspectives on Justice and Law Requirement. Contact Professor Sarda for more information (sarda@bc.edu). Limited enrollment.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7853",
    "Title": "Critical Race Theory Seminar",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "This class is limited to students in the Critical Race Theory Reading Group and is equivalent to an independent study. There is a 1- or 2- credit option for those who want to write a 15- or 30-page paper. The 2-credit, 30-page paper option will satisfy the upper-level writing requirement. Papers will receive a letter grade.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS7861",
    "Title": "Reimagining the Reconstruction Constitution",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Constitutional Law",
    "Areas3": "x",
    "Description": "This weekly, two-credit seminar introduces students to the history, theory, and contemporary application of the Reconstruction Constitutionthe Thirteenth, Fourteenth, and Fifteenth Amendments. These Amendments abolished slavery, established birthright citizenship, nationalized a set of fundamental rights, and expanded the right to vote. What these Amendments mean for us today, however, remains an open and intensely debated question. Does the Thirteenth Amendment only abolish chattel slavery, or does it do more? What exactly does the Fourteenth Amendments Equal Protection Clause require of us? And what does our right to vote actually entail? In this course, we will study the meaning of the Reconstruction Constitution and critically reflect on its implications for contemporary legal practice. To do so, we will examine the original historical documents of the public debates surrounding the framing, passage, and ratification of the Thirteenth, Fourteenth, and Fifteenth Amendments. Special focus will be given to the constitutional legacies of the abolitionist, womens rights, and long civil rights movements, as well as the constitutional theories that shape the way we understand our Reconstruction Constitution today.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS7862",
    "Title": "Human Rights and Inequality",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "International & Comparative Law",
    "Areas3": "x",
    "Description": "The law of human rights is global and rests on a vast array of international human rights conventions, customary international law, and borrowed, transplanted, or migrating constitutional or statutory fundamental rights. These two avenues the international and the domestic are together examined in this course, using recently advanced techniques of comparative law. Our focus is on how the law of human rights conceives of, and addresses, the problem of inequality. In particular, we will study one set of human rights the so-called economic and social rights which include the rights to food, housing, health care, education, and water and sanitation. Of immediate interest to the American law student with a global, transnational, or comparative outlook, or to others interested in the changing idea-base of human rights law, law and political economy, law and equality, and law and social change, the course will emphasize the International Covenant on Economic, Social and Cultural Rights and its Optional Protocol, comparative legal developments in South Africa, Colombia, and India, and where and how the United States contributes to this rapidly developing field of law.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8001",
    "Title": "Summer in Training--Curricular Practical Training Fieldwork",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Summer in Training Fieldwork is the companion course to the CPT seminar. Students are responsible for finding their own placement, and must have it approved by the Associate Director for Externships (includes, having the MOU signed by their supervisor). Class Dates: dates to be determined, but expect that class will meet the week of May 22.",
    "Semester": "2023SUMM"
  },
  {
    "Number": "LAWS8016",
    "Title": "Introduction to Non-Profit Transactional Lawyering",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "1L Elective This course is designed to acquaint students with some of the legal issues associated with starting up and operating a business or venture, examining the role of a transactional lawyer and learning basic practice skills. The objective is to give first year students an introduction to legal issues that lawyers are likely to encounter in an entrepreneurial setting, how the process works, decisions that need to be made and all of the various legal issues during the life cycle of a start-up. These issues include choice of entity, selection of a company name and trademark, protecting the intellectual property of a new company or venture, financing arrangements, operating issues including employment and general business agreements and exit strategies. The course will use simulation and role-plays to explore the legal issues relevant to transactional lawyering.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8017",
    "Title": "Introduction to Transactional Lawyering",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "This course is designed to acquaint students with some of the legal issues associated with starting up and operating a business or venture, examining the role of a transactional lawyer and learning basic practice skills. The objective is to give first year students an introduction to legal issues that lawyers are likely to encounter in an entrepreneurial setting, how the process works, decisions that need to be made and all of the various legal issues during the life cycle of a start-up. These issues include choice of entity, selection of a company name and trademark, protecting the intellectual property of a new company or venture, financing arrangements, operating issues including employment and general business agreements and exit strategies. The course will use simulation and role-plays to explore the legal issues relevant to transactional lawyering.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8045",
    "Title": "Immigration Practice",
    "Areas1": "Immigration Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "Immigration Practice focuses on the practice of immigration law and in particular the intersection of criminal and immigration law. Students will advocate for hypothetical clients whose cases deal with cutting-edge issues of bond, the intersection of immigration law and crimes, and discretion. In-class hearings include client interview, client counseling, a bond hearing, and a portion of a removal defense case.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8055",
    "Title": "Introduction to Practice in the Criminal Justice System",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "1L Elective In this class, students will engage in various aspects of a simulated criminal trial, which will give students the opportunity to develop some of the lawyering skills inherent in criminal practice, including how to interview clients, argue motions, engage in plea negotiations, break down a statute, fact investigation, & plan for a trial. Students will also be confronted with the important ethical issues that face counsel in criminal cases. The course will begin with an overview of the Criminal Justice System, including perspectives from various system mechanisms - police, court system, prisons, defense attorneys & prosecutors. As this is an introductory course, it is necessary to introduce a variety of law school courses including professional responsibility, criminal law & criminal procedure. The goal is to have students become familiar with the criminal justice system, gain experience through simulations & think critically while performing tasks within the practice of criminal law.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8056",
    "Title": "Introduction to Criminal Law and Trial Practice",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will take a hands-on approach to being introduced to criminal law; taking a criminal domestic violence case all the way from arraignment through trial. This practical simulation class will allow students to delve into both the prosecution and defense sides of bail arguments, motions to suppress, discovery motions, trial strategy as well as conducting mock opening statements, direct and cross exams, and closing arguments. During the course, students will be introduced to Massachusetts criminal law pertaining to bail, discovery and evidence, with emphasis on the effects of bail on diverse populations, the intersection of the criminal justice system on victims and witnesses of violent crime, ethical considerations pertaining to exculpatory evidence and effective trial strategies in criminal cases. Students will be encouraged to participate in the class activities from both a prosecution and defense approach.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8057",
    "Title": "Introduction to Trial Practice",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "This course offers a dynamic view of the litigation process and provides students with the opportunity to learn effective trial skills by participating in simulations and exercises in class. The course will focus on developing trial advocacy skills in all phases of a trial as well as learning how to use themes and theories of a case in order to make the advocates presentation more effective. After each exercise, students will receive real time feedback and commentary to improve their advocacy.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8065",
    "Title": "Introduction to Restorative Justice: Transforming the Law from Within",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Ethics & Professional Responsibility",
    "Areas3": "x",
    "Description": "1L Elective. This course is designed to train students in implementing restorative justice principles & practices in legal practice. Students will learn how to facilitate restorative justice circles & how to incorporate restorative justice into their daily lives through an interdisciplinary framework combining the head & heart with the aim of cultivating compassionate lawyers committed to transforming themselves & the justice system. We will identify practices which nurture & strengthen the inner life & the connection between the inner life & well-being of lawyers & the quality of legal practice. To transform the justice system through restorative justice, future lawyers must be committed to transforming themselves & their way of being in the world. We will explore the roots of restorative justice, contemporary examples of its application in post-conflict settings in the US & the world, & examine its utility in addressing the pressing mass incarceration crisis, the current penal system & mode of punishment in the US. We will practice & apply Critical Race & Systems Theories to sharpen the students' ability to assess themselves, & their future clients, through a systems lens & to examine the impact of racism, sexism, gender discrimination & other systems of oppression on behavior & on the justice system. We anticipate holding at least one class session off-campus at a correctional facility. The grade will be based upon attendance, participation, written assignments, & facilitation skills.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8118",
    "Title": "Environmental Law Research",
    "Areas1": "Environmental Law",
    "Areas2": "Administrative & Government Law",
    "Areas3": "Clinical & Experiential Education",
    "Description": "This two-credit course is designed as an in-depth look at the legal resources and research techniques used in the practice of environmental law. Strong emphasis on administrative law and the rulemaking process, legislative history, and government documents. Course will also review basic case law and statutory research. Students are exposed to strategies for using these materials competently, effectively, and economically in the research process to enable them to develop research skills necessary to be a successful environmental lawyer. Ungraded exercises, regular feedback, and multiple opportunities for self-evaluation allow students to track their progress in learning the materials. Course grade is based on participation, effort, and two graded exercises, one of which students will have the opportunity to improve their performance on by doing additional research as directed.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8119",
    "Title": "Immigration Law Guided Research",
    "Areas1": "Immigration Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Immigration Law Research is a two-credit optional companion course to Immigration Law. The course will teach students how to research complex immigration law issues, using specialized secondary sources, administrative agency decisions and regulations, federal constitutional law, statutes, and case law. Students will learn strategies and resources by completing pragmatic research problems. Research techniques and sources will track the course content of Immigration Law. Students will receive an introduction to international and foreign law resources used in immigration law. Weekly ungraded exercises allow students to track their progress in learning the material. Grade will be based upon class participation, two graded assignments and a final, open book, take-home examination.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8127",
    "Title": "Intellectual Property Research",
    "Areas1": "Intellectual Property & Technology Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This two-credit course is designed as an in-depth look at the legal resources and research techniques used in the practice of intellectual property law. Course will cover basic primary sources used in IP law such as the U.S. Constitution, statues, and cases. Course will also cover research tools and techniques unique to IP law such as patent and trademark searching, the activities and publications of the U.S. Copyright Office of the Library of Congress and the Patent and Trademark office of the Department of Commerce. Resources are compared and contrasted to help students learn efficient research skills necessary to be a successful IP lawyer.  Ungraded exercises, regular feedback, and multiple opportunities for self-evaluation allow students to track their progress in learning the materials. Course grade is based on participation, effort, and two graded exercises, one of which students will have the opportunity to improve their performance on by doing additional research as directed.",
    "Semester": "2025SPRG"
  },
  {
    "Number": "LAWS8128",
    "Title": "Tax Law Research",
    "Areas1": "Tax Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "Students will master research sources and methods in the area of federal tax, including federal statutory and legislative history research, regulatory process and regulatory publications. Students will master techniques of state-level tax research, including state statutory and regulatory resources. Students will be introduced to international and foreign law tax research sources. Emphasis is placed on the technology and tools used by practitioners, including BloombergLaw, CCH Intelliconnect, IBFD, RIA Checkpoint, BNA Tax Portfolios, LexisNexis, Tax Analysts and Westlaw. Students will receive instructor feedback on short ungraded assignments.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8130",
    "Title": "Advanced Legal Research",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Advanced Legal Research (3 credits) offers an in-depth, hands-on experience with the process of legal research. Students use a wide range of legal materials and devise practical techniques and strategies for using these materials competently and effectively. The goal of the course is to create self-sufficient legal researchers capable of analyzing and resolving legal problems effectively. Emphasis is placed on the types of legal sources and research not covered in the first year of law school (e.g., treatises, forms sources, administrative law, statutory research, legislative histories and legal practice materials). Both print sources and free and fee-based electronic sources are explored and critiqued. The course covers Westlaw, Lexis, Bloomberg Law, and other electronic sources.",
    "Semester": "2024FALL;2025SPRG"
  },
  {
    "Number": "LAWS8131",
    "Title": "Research Techniques for Law Review",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "Research Techniques for Law Review offers hands-on experience with the process of and sources for legal research. Students use a wide range of legal materials and devise techniques and strategies for using these materials competently, and efficiently. The goal of the course is to ensure success for new 2L Law Review staff by creating self-sufficient legal researchers capable of a) effectively researching a variety of legal issues and b) performing source collection and cite-checking duties. \n\nThis pass/fail course is mandatory for new members of the Law Review staff, unless they take another qualifying research course (as determined by John Gordon and editors-in-chief) during their 2L fall semester.",
    "Semester": "2024FALL"
  },
  {
    "Number": "LAWS8133",
    "Title": "Business Law Research",
    "Areas1": "Business Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "Business Law Research is a two-credit simulation class in which students develop primarily their legal research skills, but also other lawyering skills such as organization and management of legal work, professional ethics, and collaboration. Students will educate themselves on critical research skills for transactional law practice through legal compliance scenarios that apply state, federal, and local law. Students in this class will also develop key business law research skills needed for drafting contracts and working on other important transactional tasks, such as due diligence for business combinations. Most initial research instruction takes place outside the classroom so that students can work on simulations in the classroom and receive guidance from the instructor. There are multiple opportunities for self-evaluation as well as extensive feedback on a regular basis from the instructor.",
    "Semester": "2025SPRG"
  },
  {
    "Number": "LAWS8134",
    "Title": "Administrative Law Research",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Immigration Law",
    "Areas3": "Clinical & Experiential Education",
    "Description": "Administrative Law Research is a two-credit simulation-based course that qualifies as an experiential course under the ABA requirements. In this course, students will develop legal research skills but also other lawyering skills such as organization and management of legal work, professional ethics, and collaboration. Through the use of realistic fact patterns, we will work together to approach and solve research problems that implicate administrative law. Students will explore the general structure of the administrative state in the U.S. and how to research the materials generated within that structure. This includes how administrative regulations are promulgated, how agency decisions are made and reviewed, and how guidance is issued. The class will focus on immigration, securities, and tax law. However, students will learn skills that they can apply to other heavily regulated areas of practice. Grade will be based on class attendance, participation, and graded assignments.",
    "Semester": "2024FALL"
  },
  {
    "Number": "LAWS8140",
    "Title": "Introduction to Civil Litigation Practice",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "1L Elective. This course provides an introduction to civil litigation practice, with emphasis on the word \"practice.\" The 1Ls enrolled will bring a basic knowledge of Civil Procedure, plus lifetime perceptions of how civil litigation is conducted, and a personal sense of morals and ethics. The course will provide an understanding of skills involved in litigating a civil case through the stages preceding trial, with an emphasis on the interrelationship of those skills with the litigator's professional responsibilities to clients, colleagues, opponents, judges and others. In addition to discussions and guest presentations by experienced litigators, students will perform litigation skills--client interviews, negotiations, depositions, and courtroom advocacy--based on a hypothetical factual scenario. The combination of teaching techniques will provide insight into the real world of civil litigation while fostering skills that are important for all practitioners to master, whatever field they choose to enter.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8150",
    "Title": "Introduction to Children's Rights Practice",
    "Areas1": "Family & Estate Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "1L Elective. Children's Rights Practice is a 1L Elective designed to introduce students to the law and skills needed to represent children involved with state systems. A hypothetical case of a multi-system involved teenage girl will be carried through the semester exposing students to child welfare, delinquency and education law. Student simulations will include interviewing the adolescent client, representing her at a multi-disciplinary meeting, and negotiating a settlement of her education-based claim. In addition to relevant law and policy, guest speakers will discuss child development and how to work with an expert consultant to advance your client's case. Critical issues of professional responsibility, such as client directed representation and how to navigate family relationships while representing the child, will also be studied.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8151",
    "Title": "Introduction to Family Law",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Immigration Law",
    "Areas3": "Civil Litigation & Procedure",
    "Description": "This course introduces first-year students to the excitement and challenges of family law practice by focusing on development of specific skills, both written and oral. Students will learn how to conduct client interviews, draft pleadings, investigate facts (including discovery), counsel clients and practice expectation management, negotiate, and advocate in the courtroom. The class will explore how a family law attorneys often desire to help can be either enabled or frustrated by the limits of what the court system can do to assist families. This class will note the intersections of family law with constitutional law, property law and contracts. We will cover the Model Rules of Professional Conduct for lawyers governing obligations of loyalty, zeal, confidentiality, avoidance of conflicts of interest, fairness in dealing with opponents, honesty in interactions with courts, and fairness to the legal system and society. The primary mode of instruction will be instruction via two case studies. The case studies will allow for the practice of pre-trial litigation skills, motion and discovery request drafting, client interviewing and counseling and the opportunity to learn about the other systems that impact family law case outcomes. The method of instruction will also include periodic guest presentations by family law attorneys concerning specific challenges they have faced, both with clients and opposing counsel and identified solutions to these challenges",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8161",
    "Title": "Introduction to Mental Health Law",
    "Areas1": "Health Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will introduce students to the practice of mental health law. Students will explore the intersection of substance use and mental health balanced against the goals of civil liberties and public safety, and treatment and accountability for individuals and communities in crisis. Students will develop skills in factual development and legal research, preparing for evidentiary hearings, oral advocacy, and preparing legal filings and memorandum addressing treatment, civil commitment, and criminal responsibility. Throughout the course, students will explore and reflect upon the ethical considerations raised in the approaches and choices made by the legal system and by individual attorneys.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8207",
    "Title": "Department of Revenue Tax Externship",
    "Areas1": "Tax Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "An intensive externship experience at the Legal Division of the MA Dept. of Revenue(DOR). Students will handle cases involving state taxation of individuals, corporations and other entities and related federal issues. The goal is to provide in-depth exposure to the practice of state tax law, including principles of administrative, constitutional and federal tax law.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8250",
    "Title": "Government Externship Seminar",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The purpose of this seminar is to teach basic concepts of administrative law and practice that will aid the student in his or her co-requisite externship in a local, state, or federal agency. The seminar will present: (1) elements of a successful externship; (2) common ethical issues for government lawyers; (3) a brief summary of the law governing the Executive Branch of federal and state governments; (4) an introduction to and comparison of the offices of state and federal attorneys general; (5) an exploration of issues confronted by counsel within the Executive Branch; and (6) the perspective of counsel for an entity regulated by the federal and state governments. Through journals, class discussions, and oral presentations, the seminar will provide students with opportunities for reflection about their externships and for the exchange of student views on subjects related to the practice of law within the Executive Branch.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8251",
    "Title": "Legal Practice Seminar",
    "Areas1": "Ethics & Professional Responsibility",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This seminar will support students to be successful in their legal externships and will encourage sharing and cooperation among students in self-evaluation, providing feedback, and navigating ethical considerations. The course will cultivate students' professional development through the exploration of different legal career pathways and through critical evaluation of external and internal influences on individual and organizational practice. Students will be equipped to engage in authentic and impactful legal practice, and will develop skills to help them support both client and attorney well-being.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8260",
    "Title": "Introduction to Human Rights, Refugee, & Humanitarian Law",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "International & Comparative Law",
    "Areas3": "x",
    "Description": "This class will examine legal understandings of and responses to some of the most compelling human rights challenges of our times. We will explore torture, forced migration, religious freedom, refugee and humanitarian protections, the human rights of migrants, human trafficking, and criminal prosecutions of alleged war criminals and those who commit crimes against humanity. We will engage critically with ideas of gender, culture, ethnicity, legal status, and race. There will be guest speakers, engagement with the BC Center for Human Rights and International Justice https://www.bc.edu/bc-web/centers/chrij.html,and (if possible) field trips to observe human rights in action. We will consider: -- Western ideas of human rights and how those ideas differ from other conceptions;--The international law, treaties, instruments, customary norms, etc. that create and protect human rights, including economic and social rights, rights against racial, ethnic, religious, and gender discrimination, rights to self-determination, and the rights of children;--The institutions that monitor and enforce human rights law, including regional systems such as those of Europe and the Inter-American system.Grading will be based on class participation (including in-class simulations and presentations, and aguided research paper of approximately 15 pages on a topic chosen by each student inconsultation with Prof. Kanstroom.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8263",
    "Title": "BC Innocence Clinic",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "Students in BC Innocence clinic work with faculty supervision on post-conviction screening and/or litigation of cases of prisoners who assert their innocence. Case screening involves review of trial transcripts, pre-trial discovery, appellate and post-conviction briefs, and judicial opinions, as well as factual and forensic research, to determine whether scientific testing or other investigative leads could establish a strong likelihood that the prisoner is factually innocent. Students produce a memorandum analyzing the case and making a recommendation as to whether post-conviction litigation should be pursued. Students engaged in litigation research and draft motions for various types of post-conviction relief with supporting memoranda and affidavits. Class component is devoted to case-rounds and development of legal, professional, and ethical skills in the context of post-conviction innocence work. Students spend 10-12 hrs/week outside of class time on casework.",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8265",
    "Title": "International Human Rights Practicum",
    "Areas1": "International & Comparative Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This course focuses on appellate submissions to regional and international courts and other legal organizations that address international human rights issues. For spring 2020, students will work on submissions to the Inter-American Court of Human Rights (IACtHR) and the Inter-American Commission on Human Rights (IACHR). The Inter-American System for the protection of human rights (IASHR) is the regional system responsible for monitoring, promoting, and protecting human rights in the countries that are members of the Organization of American States (OAS). Currently, it is one of the strongest regional human rights protection systems in the world. This clinic will include two components. (1) The practicum will provide students with practical experiences in advocacy for the promotion of international protection of human rights through amicus briefs before the IACtHR; drafting of legal reports, protocol proposals, and hearings before the IACHR; and the possibility of submissions to other human rights tribunals around the world. (2) The accompanying seminar will provide an overview on the study of the IASHR, including its normative framework, mechanisms, rights protected and its principal entities. Possible practicum fieldwork at the IACHR (Washington DC) or the IACtHR (San Jose, Costa Rica) during spring break. Previous course work in International Law, International Human Rights, and/or International Legal Research is not required, but may provide an enriched perspective.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8266",
    "Title": "Covid Relief Housing Clinic",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "Health Law",
    "Areas3": "x",
    "Description": "In the Covid-Relief Housing Clinic, students will provide limited representation to low-income tenants facing Covid-impacted evictions, to help them preserve their housing and avoid homelessness. In so doing, students will learn and practice a variety of lawyering skills that may include interviewing and counseling, legal research and the preparation of pleadings and motions, and oral advocacy, including negotiation. The representation may include virtual court appearances in court-led mediation sessions and hearings before housing court judges, and may be initiated by direct referrals from WATCH CDC, a Waltham-based housing advocacy organization, or participation in Lawyer for the Day programs. Resources permitting, students will also work in partnership with WATCH CDC on any legal and policy-based housing advocacy projects supporting the organization's community outreach, educational, and social justice missions. The Covid-Relief Housing Clinic is a graded, 4-credit clinic, with an expected time commitment averaging 12-16 hours/week, including a weekly seminar. Students will also be required to hold regularly scheduled virtual office hours, arranged based on the students' schedules.",
    "Semester": "2023SUMM"
  },
  {
    "Number": "LAWS8267",
    "Title": "Community Enterprise Clinic",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "Clinical & Experiential Education",
    "Description": "This course introduces students to transactional legal work on behalf of low- and moderate-income entrepreneurs, small businesses, nonprofit organizations, and first-time home buyers. The fieldwork is based at the Law Schools Legal Assistance Bureau located in the new Center for Experiential Learning on campus. Students will perform all of the legal work and interact with the clients. Students will be assigned to work with entrepreneurs with business-related legal needs; with emerging, community-based small businesses facing corporate, employment or similar legal issues; with nonprofit organizations or groups seeking assistance to establish a tax-exempt organization; and first-time home buyers. For fieldwork purposes students will be assigned seven or ten office hours per week at the clinic, depending on the number of credits chosen by the student. A weekly seminar will address substantive law, ethical issues, and legal skills. The fieldwork is complemented by a weekly seminar.",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8292",
    "Title": "Statutory Interpretation",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This two-credit course, taught by the Chief Judge of the U.S. District Court for the District of NH, offers instruction in statutory interpretation, with emphasis on its practice (advocacy in litigation, and judicial opinions), doctrines (textual and substantive canons of construction), and competing theories: textualism, intentionalism, purposivism (legal process theory), pragmatism, and \"dynamic statutory interpretation.\" Despite its theoretical aspects, this is a highly practical course.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8301",
    "Title": "BC Defenders Program (1 Semester)",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This BC Defenders program will focus on the issue of racial bias in policing and learning how to mount constitutional challenges against it within the context of indigent criminal defense. Students will take an in-depth look at an emerging area of law on how defendants can prove they were victim to racially biased policing, who should bear the burden of proof, and what types of police statistics criminal defendants should have access to. Students will represent clients in the Dorchester Division of the Boston Municipal Court in cases that involve racially biased police action. Students will collect and examine demographic statistics on police action (car stops, Terry stops, etc.), collaborate with expert witnesses, and conduct legal research and investigation to mount constitutional challenges against raciallybiased policing. 3Ls will have the opportunity to represent their clients in court in hearings ranging from arraignment and bail hearings to evidentiary motions and trial. The program is a 1 semester clinic and includes a weekly clinic seminar.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8304",
    "Title": "BC Defender Program Clinic",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The BC Defender program is a full-year criminal defense clinic and a weekly seminar class. Practicing under faculty supervision pursuant to SJC Rule 3:03, BC Defenders represent clients charged with crimes and probation violations in the Boston Municipal Court (Dorchester Division). In the course of representing their clients, students broaden their own life experiences and develop professional skills, including interviewing, counseling, investigation, legal research and writing, collaborating, negotiating, oral advocacy, case organization and management, and trial skills.",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8306",
    "Title": "BC Law Prosecution Clinic",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The Prosecution Program is a one-semester course offered only in the fall. Students enrolled in this clinic work within a local District Attorney's Office 2-3 days each week, handling a variety of misdemeanor and minor felony charges from arraignment to bench trial. Students are responsible for their own cases in court and meet weekly with a faculty supervisor for case preparation and supervision. Students' court experiences provide the basis for a close and critical examination of their role and their impact on the criminal justice system.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8308",
    "Title": "Lifer Parole and Compassionate Release Clinic",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "Prisoners who have become eligible for parole after serving at least fifteen years in prison on a life sentence (lifers) often appear before the Massachusetts Parole Board without representation. Students in teams will help prepare lifers for their parole release hearings and will represent them at the hearings. Representation entails learning about the clients life before the underlying crime, the facts of the underlying crime, and the clients institutional history contained in Department of Correction and Parole Board records. Until Covid-19 risks abate, students will conduct interviews with clients via Zoom, email, and postal correspondence rather than by visiting the prison in person. Students will prepare a memorandum in support of parole, including a re-entry plan (with the help of social work students); and prepare the client and support witnesses to testify at the hearing. The Parole Board conducts all hearings virtually during the pandemic. Students will appear virtually at the Lifer Parole Hearing with the client and will deliver an opening statement and closing argument. Under the Massachusetts Criminal Justice Reform Act, prisoners serving state sentences at the Massachusetts Department of Correction who are suffering from terminal illnesses or from irreversible physical or cognitive incapacitation may be eligible for medical release (\"compassionate release\"). Whenever such cases are referred to the Clinic, students will help prepare a petition for release and an accompanying medical parole plan with the assistance of social work students and nursing students. Students will first advocate with the Department of Correction for release. If not successful, appeal can be taken to the Superior Court. Students will learn about the clients underlying crime, the clients institutional record, the clients physical, medical, mental health condition and the clients risk to re-offend in light of the client's condition.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8313",
    "Title": "Immigration Law Clinic",
    "Areas1": "Immigration Law",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "Clinical & Experiential Education",
    "Description": "Students in the Immigration Clinic represent noncitizens in removal proceedings before the Immigration Court, which involves arguing bond motions for detained clients, conducting examination of witnesses, raising evidentiary objections, and arguing points of law. Students represent noncitizens in applications for legal status before the U.S. Citizenship and Immigration Services (CIS) office. Cases vary, but may include asylum and relief based on fear of persecution in the country of removal, waivers of deportation for long-term residents of the U.S., adjustment of status for noncitizens with U.S. citizen or permanent resident family members, visas for victims of violent crimes who have assisted in the prosecution of such crime, relief for noncitizen victims of domestic violence, and visas for juveniles who have been abused, abandoned, or neglected. Students conduct \"Know Your Rights\" presentations for noncitizens who are detained by the Immigration and Customs Enforcement (ICE).",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8316",
    "Title": "Advanced Immigration Clinic",
    "Areas1": "Immigration Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "A continuation of LAWS8313, Immigration Clinic.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8328",
    "Title": "Family Justice Litigation Clinic",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Students will advise and represent low-income clients in civil and administrative matters related to family law and child welfare. Students will be court-certified as Student Attorneys and will handle all phases of their clients cases, from client interviewing through case planning, fact investigation, discovery, client counseling, negotiation, and courtroom advocacy. Practice Areas in the clinic are family law and administrative advocacy against the state Department of Children and Families (DCF). Cases are primarily in Middlesex County. Clinical faculty provide extensive supervision, assistance and training through every stage of students work on cases, from preparation for tasks and events through retrospective reflection. Student Attorneys meet weekly in a small seminar group. Seminars will cover the practical, strategic, legal, ethical, and interpersonal tensions that are at the heart of litigation practice. In the second hour of seminar, Masters of Social Work students who are placed in the clinic will join the student attorneys for interdisciplinary rounds.",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8329",
    "Title": "Juvenile Rights Advocacy Project Clinic",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Family & Estate Law",
    "Areas3": "Clinical & Experiential Education",
    "Description": "Students will represent, as Attorney or Guardian-ad-Litem, youth involved in the justice system on legal issues related to dependency, status offense, delinquency, or special education cases. There is an emphasis on education law in JRAP cases. JRAP In-House students will be exposed to some of the following: special education advocacy (team meetings, hearings, appeals), school disciplinary proceedings, administrative advocacy with the state Departments of Youth Services (DYS) and Children and Families (DCF), and Juvenile Court advocacy. Cases are primarily in Middlesex County.",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8339",
    "Title": "Entrepreneurship and Innovation Clinic",
    "Areas1": "Business Law",
    "Areas2": "Intellectual Property & Technology Law",
    "Areas3": "x",
    "Description": "The Entrepreneurship & Innovation Clinic (EIC) is a dynamic clinic that provides free transactional legal services to under-resourced clients in the Greater Boston area on issues relating to new and emerging businesses. This innovative clinic provides students with the hands-on, practical experience needed to navigate the rapidly evolving fields of intellectual property and entrepreneurship. Law students working under the supervision of the clinic director provide a broad range of business law, intellectual property and transactional services. Clients include micro-entrepreneurs, technology entrepreneurs, social entrepreneurs, artists, authors, filmmakers and musicians, who may be individuals or for-profit businesses in the Greater Boston area who are in need of transactional legal counsel related to starting or operating their business. The EIC is for students interested in learning to work with organizational clients and learning to represent clients in transactions.",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8340",
    "Title": "Project Entrepreneur",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course is centered on using entrepreneurship to foster the successful reentry of formerly incarcerated individuals back into society, igniting a new beginning for their families, and invoking positive change in their communities. The mission of Project Entrepreneur is to equip formerly incarcerated people in the Greater Boston area with the tools necessary to be successful entrepreneurs through networking and mentorship and the completion of an important entrepreneurial fundamentals\" class focused on business development, operations, sales and marketing, and strategy. Format: First, under the supervision of Professor Gennari, you will concentrate on the development of legal knowledge and counseling skills related to the advising of new businesses. Second, you will meet with the entrepreneurs and would-be business owners, who will become clients of BCLaw's Community Enterprise Clinic for purposes of the class. Third, together with graduate student colleagues from the CSOM and the GSSW, you will coordinate an eight-week course called \"Project Entrepreneur\" for the enrolled entrepreneurs, which will be focused on the legal and business aspects of creating and managing new ventures. Fourth and finally, you will be part of a multidisciplinary team that will meet throughout the semester, and primarily after each Project Entrepreneur class and as appropriate with the would-be business owners, to work through questions, challenges, and opportunities for the new venture.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8412",
    "Title": "In House Externship Seminar",
    "Areas1": "Business Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This seminar is for students who are externing with an in-house legal department and will cover various topics such as: the role of in-house counsel, working with outside counsel, identifying ethical issues when representing an organization, intellectual property &amp; privacy concerns, communication strategies when engaging and working with business teams and other departments throughout the company or organization, etc. The faculty member will work with students to develop personal learning goals that include concrete strategies the students will use to achieve each goal and how they will measure their progress. The seminar is designed to be practical, reflective and interactive. Students will be encouraged to discuss and the faculty member will advise on common workplace challenges such as managing their time, structuring legal research for business settings, communicating with supervisors, collaborating on work assignments, and learning appropriate workplace etiquette.The seminar meets every other week throughout the semester. It is a one credit class. Students will be required to complete assigned reading, submit journal entries, and participate in class discussions.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8413",
    "Title": "The Role of In-House Counsel",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "This course will explore the unique role played by lawyers working in-house as corporate counsel. The course will be of interest for those who not only may consider a career in-house, but for those who may pursue practice at law firms; the in-house lawyer is often the voice of the client for outside counsel, so understanding the in-house lawyers role is key to building effective client relationships. The course will start with an exploration of the in-house role. Here we explore who or what is actually the client, business ethics and the relevant rules of professional responsibility, key skill sets, and frequent prerequisites for a job in-house. We will consider different contexts for in-house practice, including public companies, privately owned companies, and not-for-profit entities as well as entities both regulated and non-regulated. A discussion of corporate governance will then set the stage for sessions addressing the various types of legal work typically handled by in-house lawyers, including negotiation and drafting of agreements, conducting internal investigations, managing litigation, supporting the HR team, crisis management, and supporting the C-suite. We will consider the boundaries of various privileges and protections applicable to the lawyers communications and work product, and we will spend time on effective use of outside counsel. The course will be graded principally by way of a final examination. However, participation in class discussion will be critical and represent a meaningful portion of each students grade.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8423",
    "Title": "Amicus Brief Clinic",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Amicus Brief Clinic will provide students and faculty an opportunity to weigh in on, and attempt to influence, the development of the law and public policy in the courts. In the Amicus Brief Clinic faculty will identify an important legal issue being considered or soon to be considered by a court. Faculty will then guide a small student team in the process of researching, writing, editing, and submitting an amicus brief to the court for consideration. Although the subject matter and faculty leader of each amicus brief will be different, every Amicus Brief Clinic will include instruction and supervision on legal research and writing as well as the rules relating to submission of amicus briefs.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8425",
    "Title": "Semester in Practice",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Semester in Practice (SiP) is an externship available to students in the upper level. Students work in legal externships in placements approved and monitored by the law school. These may take place in (but are not limited to) federal, state or local agencies, not-for profit organizations or non-governmental organizations. Students also meet in a weekly accompanying seminar. Credits for the placement is determined by the number of hours worked.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8426",
    "Title": "Mediation",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "An introduction to the theory and practice of mediation necessary to understand the mediation process from the perspective of a mediator or as an advocate representing clients in the mediation process. Mediation is an assisted negotiation with the mediator acting as a third party neutral facilitator. Beginning with a review/overview of interest based negotiation, mediation theory, and the role of mediation in the legal system, then course progresses to include a skills training component of simulate cases with students participating as mediators and parties. The mediation process is examined and various skills and techniques of the mediator are taught. Understanding ethical practice and legislating related to mediation is an integral part of the course.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8429",
    "Title": "Semester in Practice D.C. Seminar",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This required seminar is a corequisite for students participating in the Semester in Practice: DC externship program.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8448",
    "Title": "SIP: Dublin Seminar",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Companion course to Semester in Practice: Dublin (LAWS844901).",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8449",
    "Title": "Semester in Practice--Dublin",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Semester in Practice (SIP): Dublin is BC Law's full-time immersion externship program for students who are interested in living and gaining International Legal experience. It will be offered during the spring semester, 2019 and is open to both 2Ls and 3Ls. SIP: Dublin provides students with the opportunity to gain full-time professional experience for an entire semester at a private firm, a corporation, a non-profit or legal services organization. In addition to the placement, students enroll in an accompanying course taught by BC Law faculty. SIP: Dublin requires that students extern at their placement for 35-40 hours/week for 12 weeks. Students receive 10 externship credits (pass/fail) and 3 seminar credits (graded). This course satisfies the Lawyering Skills/Experiential Learning and the Perspectives requirements. The course is limited to 12 students. Throughout the seminar course, students analyze the lawyering process including cross cultural lawyering, legal ethics, professional responsibility, and other topics through readings, discussion, and student presentations. Students are asked to prepare written assignments in which they reflect on their experience and readings, including a final paper in lieu of an exam. The on-site faculty member monitors individual placements to ensure the supervising attorney is providing a significant educational experience including feedback on work product, planned work assignments, and exposure to various aspects of lawyering.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8452",
    "Title": "Advanced Evidence: Trial Objections",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "Civil Litigation & Procedure",
    "Areas3": "x",
    "Description": "The goal of this course is for students to understand how the rules of evidence operate in practice by providing them with the experience of trying to admit or to keep out evidence in a mock trial setting. This is done through a problem approach with particular attention paid to laying the foundation for admission of evidence during examination of witnesses. Topics include exceptions to the hearsay rules (admitting business records, prior recollections, etc.); laying foundation for the admissibility of expert and lay opinion; impeaching witnesses through character evidence and prior inconsistent statements; authenticating physical exhibits; and using chalks, demonstrative aids and diagrams. Students will perform weekly in-class simulations .",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8472",
    "Title": "Advocacy Competitions",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This is the companion class to the national moot court teams. Enrollment and attendance in this class is mandatory for all members of a national team. The goal of the class is to help prepare students for not only for their individual competitions but also for litigation practice. The class is divided into three parts: overview of the moot court experience, appellate written advocacy and oral advocacy. The class will meet formally during the Fall semester until Oct 15. The class will reconvene in the first half of the Spring with their team coaches for oral advocacy/moot sessions until the competitions are complete. Students should expect an \"incomplete\" grade until they have completed their moot court experience (February/March).",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8550",
    "Title": "Trial Practice",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "Clinical & Experiential Education",
    "Description": "There are several sections of trial practice, which are taught by adjunct faculty who are judges or practitioners. Each instructor selects his/her own readings and exercises, but the coverage of the sections is quite similar. All require students to prepare and to perform aspects of jury trial -- opening and closing arguments, and direct and cross-examination. The course is designed to develop practical skills and to build an appreciation for the relationship between substantive law and strategy and tactics in litigation. This section includes both civil and criminal trial exercises. Students also participate in a mock trial held in a real courtroom. All sections focus on trial advocacy; some also consider some pre-trial skills, such as discovery depositions. All sections have limited enrollments. Evidence is a prerequisite.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8553",
    "Title": "Introduction to Appellate Judging",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "1L Elective. This course will provide students with a view from the bench\" by providing the opportunity to assume the role of an appellate judge in oral argument. At each class, on a rotating basis, two students will present oral argument on opposing sides of a legal issue, seeking affirmance or reversal of decisions rendered in recent state and federal cases. The legal issues will generally be taken from first year/first semester required course subjects or involve principles of statutory construction. Students not scheduled for an argument on a particular day will perform the role of an appeals court panel, probe the strengths and weaknesses of each presenting attorney, and deliver a ruling.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8667",
    "Title": "Legal Practice Externship",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "TBD",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8701",
    "Title": "Introduction to Administrative Practice",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "1L Elective. This course focuses upon the skills needed to practice law in front of administrative agencies. Much of law school focuses upon statutory interpretation and courtroom practice. But state and federal agencies make far more rules each year than legislatures, and adjudicate far more cases than the judiciary. Agencies develop much of the law that governs our daily life, including many high-profile issues such as immigration, financial reform, and environmental protection. In this course, you will learn about agency rulemaking and adjudication through simulated proceedings, which will culminate in each student filing comments in a live proceeding before a federal or state agency.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8702",
    "Title": "Introduction to Government Oversight",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "Government oversight is essential to holding public officials and government employees accountable. This course introduces students to the role of inspectors general who conduct oversight of publicly funded agencies and entities. Typically created by statute, inspectors general are charged with preventing and detecting fraud, waste and abuse in the expenditure of public funds. By any measure, this is a broad mandate. With a case study as a guide, students will learn and practice issue spotting exercises, witness interview techniques, and how to draft letters and present recommendations to government officials. Understanding the principles of government oversight will expand the knowledge base for first year law students particularly those who have an interest in criminal law, regulatory and compliance practice, and in-house counsel work.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8765",
    "Title": "International and Foreign Legal Research",
    "Areas1": "International & Comparative Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This two-credit course aims to help students build knowledge, skills, and strategy in international and foreign legal research. Students will learn to use a variety of specialized legal research tools, to research treaties, decisions of international courts and tribunals, official documents of international organizations (United Nations, European Union, WTO, etc.), and legislation and court decisions of foreign jurisdictions. Private international law, international and regional human rights systems, trade law, and other select topics will also be singled out for special attention. Students will develop their skills and receive feedback through in-class exercises and simulations. Grades will be based on graded assignments, a presentation, and in-class work. Recommended for students interested in international legal practice and topics, members of the BC Law Review, or Jessup Moot Court teams.",
    "Semester": "2024FALL"
  },
  {
    "Number": "LAWS8799",
    "Title": "Independent Study--Individual Faculty Supervised Externship",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Independent Study--Individual Faculty Supervised Externship. Individual Faculty Supervised Externship",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8800",
    "Title": "Pop-Up Clinic",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "A \"pop-up clinic\" will be a temporary clinic (less than 1 year) set to take advantage of unique opportunities for clinical teaching and student learning. Pop-up clinics are not intended to act as \"advanced\" clinical offerings, but rather to temporarily extend the scope of clinical opportunities into new areas where the Law School does not already provide students with opportunities. An example of a pop-up clinic might include a unique appellate litigation opportunity that falls outside the context of an existing clinic. Like other clinics, pop-up clinics are housed within the Center for Experiential Learning. Pop-up clinics must be approved by the Associate Dean for Experiential Learning.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8804",
    "Title": "Dynamics of Law, Leadership, and Social Justice: The Public Interest Practitioner as an Agent of Change",
    "Areas1": "Ethics & Professional Responsibility",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "Satisfies Perspectives on Justice and Law Requirement TBD",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8823",
    "Title": "Life Cycle of a Chapter 11 Restructuring Case",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "x",
    "Description": "Chapter 11 cases require lawyers for troubled companies and related parties ( creditors, employees, vendors, customers, shareholders and others) to evaluate alternative strategies to maximize value and to minimize losses ( or to push those losses onto others). In this inter-active course, we'll use an actual case ( in which the professor represented the debtor) to allow students to set and critique strategy; write recommendations to the Board and motion papers from opposing sides; argue positions; negotiate a chapter 11 plan outcome; and try to reconcile some of the competing legal and social implications of corporate restructuring (for example, should poorly managed companies be left to fail? What if that means the loss of the best employer in a small town? Should 'vulture funds' be allowed to take advantage of distressed situations?).",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8830",
    "Title": "Supreme Court Experience",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "In this seminar, students will study in depth a number of the important cases of the current Supreme Court Term. All students will be responsible for reading the pertinent briefs and relevant background materials. Each student will also be required to perform a moot argument on at least one case, and class time will be dedicated to these moot arguments as well as to free form discussions. Finally, each student will be required to draft an opinion in at least one of the cases discussed.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8832",
    "Title": "Negotiations",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "This will be an interactive course on both the theory and practice of negotiation, in which students will read portions of the required texts on a weekly basis and will participate in a series of exercises and assessments (teacher, peer and self) of negotiation strategies. Through role-playing simulations, class discussions, reading assignments, and regular writing exercises, the course will examine the basic stages of a negotiation; the major tensions at play in negotiations; specific topics such as distributive bargaining, interests versus positions, and power dynamics; value-creating, active listening, empathizing with the other parties position, and problem-solving techniques; ethical issues that may arise; and the management of communication and emotional aspects of negotiations. There will also be an emphasis on effective drafting of negotiated agreements.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8833",
    "Title": "Introduction to Negotiation",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "The goal of this course is to teach you to think about negotiation as an opportunity to solve a problem that exists, or create new value where there is none, or try to make a bad situation a bit better. I hope to enhance your ability to think creatively and synthetically as well as analytically. You will also learn that planning is essential and can sometimes make up for your status as a new legal negotiator. The skills you will learn include analysis, persuasion, creativity, listening, interviewing, counseling, question framing, and the use of law and legal principle. We will also explore the moral and ethical issues implicated in negotiation--honesty, integrity, character, reputation and personal identity",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8834",
    "Title": "Judicial Process: Appeals",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This seminar will provide an opportunity to contemplate the role of intermediate appellate courts (both state and federal). Likewise, the role of a clerk to the appellate process will be discussed, including ethical implications, and useful tips for making the most of an appellate level internship, including information about writing, researching, structuring opinions, and editing. This seminar will also provide an opportunity to reflect on your experience as a judicial extern.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8838",
    "Title": "Judicial Process",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The seminar will guide discussion regarding various issues such as the judge's role, judicial decision making and discretion, judicial ethics, the role of the jury, settlement and alternative dispute resolution, and sentencing. This seminar will also provide an opportunity to reflect on your experience as a judicial extern.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8856",
    "Title": "MA Attorney General Civil Litigation Program",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "See course description at Attorney General Clinical Program Seminar.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS8876",
    "Title": "Criminal Justice Clinic Class",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The Criminal Justice Clinic class brings together students enrolled in the BC Defender Program and the BC Law Prosecution Program for a weekly class in which they share their insights and experiences, compare professional roles, and examine the functioning of the criminal justice system and measure it against conceptions of fairness and justice. Students and faculty from both programs participate together in skills training simulations, presentations, field trips, and conversations with experienced criminal justice professionals. In addition to readings and other assignments, students write weekly journals reflecting on and integrating their clinical and classroom experiences.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8890",
    "Title": "Advanced Criminal Evidence",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will take a hands on approach to advanced criminal evidence practice. The course will develop advanced skills in a range of evidentiary issues that arise during courtroom practice, from the rules surrounding hearsay, to the logistics of introducing physical evidence, to making and responding to objections and evidentiary issues arising from relevant topics such as DNA and Eye Witness Identification. This practical simulation class will allow students to delve into both the prosecution and defense sides of motion practice to admit or exclude both testimonial and physical evidence. Students will be encouraged to participate in the class activities from both a prosecution and defense approach in the mock arguments, written motion practice, as well as roundtable discussions.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8899",
    "Title": "Introduction to Landlord Tenant Practice",
    "Areas1": "Real Estate Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "This course is a one semester course combining substantive law surrounding the relationship between residential real estate owners and/or lessors and their lessees with practical applications including a wide range of lawyering skills such as how to prepare for and conduct an initial client meeting, client communications, court hearings with an emphasis on ethical issues, research and investigations, strategic counseling, and courtroom performance. Students will examine strategic approaches to: (1) eviction bench trials with defenses and counterclaims including discrimination, retaliation, breach of warranty, breach of contract, and violations of the Massachusetts Consumer Protection Law (Chapter 93A), (2) injunctions seeking to void the tenancy based upon criminal conduct, and (3) temporary restraining orders seeking to compel landlords to remedy health code violations or stop a move out. This class will provide students with the practical skills needed for engaging in mediation and alternative dispute resolution, preparing for an eviction bench trial, evidentiary hearings and motions. We will examine the development of Housing Law during the current pandemic and legislative moratorium on certain evictions, virtual hearings/trials, access to justice, pro se litigants, and the legalization of marijuana in the areas of reasonable accommodation and federally subsidized housing.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8900",
    "Title": "Real Estate Transactions, Development and Finance",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The course, clinical and practical, explores a lawyer's role and responsibilities, and the myriad of transactional documents and agreements, in residential and commercial real estate transactions from offers through acquisition and loan closing. The course examines, dissects, and teaches how to represent buyers, sellers, and lenders during the due diligence, development and permitting, and the financing phases of a real estate transaction. The course teaches practical lawyering skills such as drafting, negotiation, and problem solving. A variety of ethical issues are reviewed. Commercial leasing transactions, zoning, environmental and due authorization opinion letters, and zoning and environmental law and considerations in sale, lease, and finance transactions are taught. Case studies are presented and negotiation exercises conducted to summarize the areas of real estate law studied and to explain how the legal principles, cases, and issues work in real-life situations.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8901",
    "Title": "Municipal Law Practice",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Real Estate Law",
    "Areas3": "x",
    "Description": "The course dissects a municipality as a business organization, a Municipal Corporation; how a governmental lawyer practices law within that corporate structure, and the skills needed by a private practitioner to deal with it, municipal boards, agencies, departments and employees. Subject matter includes home rule, Charters, Ordinances and By-Laws (purposes, standards and constitutional issues), forms of municipal government, the government attorney and unique representation issues resulting from multiple clients, the Conflict of Interest common and statutory law, ethical issues, the Attorney-Client Privilege in the governmental setting, taxation, assessments and valuation, procurement, contracts, real estate acquisitions and conveyances, environmental issues, public records, open meetings, zoning and land use planning, comprehensive and master planning, inclusionary zoning, low and moderate income housing and affordable housing.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8909",
    "Title": "Litigating With An Eye Toward Trial",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Most of the work done in litigation occurs in a non-trial setting. Indeed, civil cases often involve years of work e.g., fact discovery, expert discovery, motion practice before any trial. But the most effective version of non-trial work has an eye toward trial that is, takes account of how that work could impact any trial. Tasks like document review, written discovery, and depositions are best conducted with clear trial objectives in mind. In this course, we will examine what trials look like, and review certain best practices at trial then work backwards to consider how trial imperatives impact all the earlier work in litigations. Litigating with an eye toward trial results in higher quality non-trial work, which leads to better outcomes for clients both before and at trial. This course will involve practical exercises designed to give students hands-on experience in applying the lessons. The course has no prerequisites, and is designed to be broadly applicable to all types of civil litigation.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8910",
    "Title": "Litigation Skills: Fact Development",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Instruction in the theory and fundamental skills of pre-trial advocacy in civil cases. Subjects to be covered include interviewing, fact investigation and analysis, case valuation/risk analysis, client counseling, pleading, discovery, and motion practice. Professional responsibility issues will be considered throughout the course. Grading is weighted heavily toward class participation. In addition, students must maintain a \"case file,\" consisting of a 1-inch 3 ring binder. This binder will be submitted for grading at the end of the course.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8914",
    "Title": "Introduction to Consumer Rights Litigation Practice",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "1L Elective. In this simulation course, you will use consumer protection laws to help a client who has errors on his credit report and is being harassed by a debt collector. You will learn how to read a credit report, dispute errors and how to use this knowledge to help your client. You will also learn how to communicate with the client, how to avoid ethical conflicts and how to identify claims and evidence needed to prove each claim. You will engage in mediation and discovery, including a deposition of the debt collector's witness. Finally, you will draft and argue a motion for summary judgment. Method of Evaluation: Assignments.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8930",
    "Title": "Dispute Negotiation",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This is an experiential course in which students will be active participants, negotiating cases on a weekly basis. The subject matter of the disputes will include: commercial transactions, gender bias issues, criminal plea bargaining, family law matters, personal injury cases, and other disciplines. Students will be introduced to the art of negotiating, reading body language and micro-messages, interviewing clients and reaching common ground with adversaries. The work will be critiqued as actual student negotiating sessions are taking place, all in an effort to familiarize students with various techniques, strategies, tactics, persuasive skills, and effective demeanor involved in successful negotiations. Although there will be some lectures, the emphasis of the course is \"learn by doing.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS8970",
    "Title": "Civil Rights Clinic",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "The Civil Rights Clinic is a 6-credit experiential learning course embraces a multi-pronged approach to lawyering, working with individuals and community-based organizations to address civil rights issues facing low-wage workers, immigrants, and communities of color in Massachusetts. Students work in teams and each student is assigned to one litigation matter and one community group advocacy matter, exposing them to both individual client representation, as well as community and movement lawyering. In seminar and supervision, students will be encouraged to think critically about the role of the lawyer, client, and community in these different models and the intersection of worker and immigrant rights and racial justice. On the litigation side, representative matters may include lawsuits on behalf of workers, immigrants, and incarcerated individuals who have experienced various forms of exploitation including wage theft, discrimination, and mistreatment. On the community advocacy side, the clinic provides legal, policy and other technical assistance to organizational clients that may include worker centers, local unions, or immigrant advocacy groups, in support of their legislative priorities or other organizing campaigns. Student Attorneys should plan to spend approximately 20-25 hours/week on clinic work and will be handling all phases of their client matters with the close supervision and guidance of the clinic director.",
    "Semester": "2023FALL;2023SPRG;2023SUMM"
  },
  {
    "Number": "LAWS8978",
    "Title": "Civil Litigation Clinic: Child Health and Education",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "Health Law",
    "Description": "The Child Health and Education Clinic (CHEC) is a medical-legal partnership that brings together student attorneys and community providers to address a variety of health-harming legal needs that impact children and families in the Boston area. Students participate in every aspect of the client's case, from developing the facts and theory of the case, to case planning and client counseling, to written and oral advocacy. Some of the clinic's cases are directly connected to childhood health while others address legal barriers that negatively impact child and family well-being. Advocacy may occur in a variety of legal areas including education (such as advocacy to secure appropriate special education services), public benefits (such as appealing a denial of essential benefits), or housing (such as advocacy to remediate poor housing conditions resulting in asthma or lead poisoning). Through interdisciplinary casework, close supervision, and weekly seminars students learn to engage in culturally humble client advocacy, reflecting on the structures and systems that intersect each case and developing a variety of advocacy skills while providing critical representation in an area of substantial community need.",
    "Semester": "2023FALL;2023SUMM"
  },
  {
    "Number": "LAWS8978",
    "Title": "Civil Litigation Clinic",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "This civil clinical course allows students the opportunity to practice law under the close supervision of clinical faculty at the BC Legal Assistance Bureau (LAB). Students are legally certified to advise and represent clients in every aspect of civil litigation. Practice areas are family law, landlord-tenant, and public benefits appeals. Clinical faculty provide thorough feedback about students' work at all stages in order to help them build on their skills and learn from their experiences, including written feedback at both mid-semester and end of term. Seven-credit students are expected to spend an average of 20-25 hours/week on clinic matters; ten-credit students average 30-35 hours/week. Pass/fail and variable credit options can only be exercised at the beginning of the term. Enrollment, by lottery, is limited to 18 students in the Fall, and 12 in the Spring.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS8979",
    "Title": "Civil Litigation Clinic Class",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "Students enrolled in the Civil Litigation Clinic also participate in a weekly seminar where issues related to students' actual cases are examined. The practical, legal and ethical issues of lawyering are explored in detail through discussion, simulations, and review of video recorded portions of students' meetings with their clients. In addition to class participation, students draft four reaction papers during the term, reflecting on their lawyering, systemic challenges, and social justice issues which they have observed. Students receive the same grade for both their clinic and seminar work. Pass/fail can only be exercised at the beginning of the term. Selection by lottery.",
    "Semester": "2023SUMM"
  },
  {
    "Number": "LAWS8980",
    "Title": "Civil Litigation Clinic: Housing Justice",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Clinical & Experiential Education",
    "Areas3": "x",
    "Description": "In this clinical course students advise and represent low-income clients in a variety of housing matters under close, supportive supervision by experienced clinical faculty. Clinic participants are court-certified as Student Attorneys. Their practice is based at the Boston College Legal Services LAB, a law firm within the Law School that is part of the BC Center for Experiential Learning. Student Attorneys handle all phases of their clients cases, from client interviewing through case planning, fact investigation, discovery, client counseling, negotiation, and courtroom advocacy. Through practice and confronting a series of inevitable firsts; students rapidly develop both confidence and competence as lawyers. Housing Justice is geared toward prevention of homelessness, primarily through eviction defense and public housing advocacy. The case docket also includes affirmative civil cases against notoriously unscrupulous landlords to correct deplorable housing conditions, halt discriminatory practices, and protect tenants from other forms of mistreatment. The mixture of housing matters students handle enriches their development in many ways. Students will understand the common legal, factual and ethics patterns that emerge from differenttypes of litigation matters. Courts and administrative agencies before which students appear provide informative contrast. Cases have different paces and cadences. Clients have distinctly different interests and needs. This variety contributes immeasurably to a beginning lawyers professional growth. Clinical faculty provide extensive supervision, assistance and training through every stage of students work on cases, from preparation for tasks and events through retrospective reflection. Student Attorneys receive thorough feedback on all aspects of their work to help them build core lawyering skills, learn from their experiences, and mature professionally. Informal feedback is part of each participants daily experience. Formal feedback is given both at mid-semester and end of term. Student Attorneys meet in a weekly seminar to examine their work closely. Practical, strategic, legal, ethical and interpersonal tensions are the focus of discussion aimed at deriving deepened understanding of the joys and challenges of civil litigation practice.",
    "Semester": "2023FALL;2023SUMM"
  },
  {
    "Number": "LAWS9100",
    "Title": "Race, Policing, and the Constitution",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "Constitutional Law",
    "Description": "The well documented phenomenon of police violence against African-Americans and other people of color now stands out as one of the most vexing and intractable social justice issues in the United States. Viral videos have shined a light on the pervasive brutality of racialized policing, a problem that once was visible only to the victims and the communities where it occurred. Legal scholars and practitioners have been drawn into the lively public debate about how, under a legal system ostensibly guided by principles of equal justice under the law, such behavior is allowed to continue without consequences for the perpetrators. The question central to this debate is whether the Constitution and established legal procedures provide a sufficient and reliable restraint on racialized police violence against people of color. Some activists, distrustful of a legal system that too often fails to hold police officers accountable for conduct that violates a persons civil and human rights, doubt the vitality of existing legal and policy responses to the issue. In the alternative, they tout remedies that include defunding or abolishing the police altogether. Others, advocating a more moderate approach, insist that by reforming existing law, policy and practices, the problem of police violence can be sufficiently mitigated. In this course, the readings and discussion will focus broadly on this debate over the role of the law in combating racialized policing. First, students will consider the extent to which the Fourth Amendment (which defines the rules of engagement for threshold encounters between the police and civilians) and the Equal Protection Clause (which prohibits discrimination based on race) offer viable protections from racialized police violence. For this segment of the course, the class discussion will highlight Terry v. Ohio and Whren v. United States as students consider whether neutral Fourth Amendment principles like reasonable suspicion to justify a stop and frisk may be implicated in the prevalence of racial profiling and other forms of racialized policing. In the second segment of the course, students will explore established accountability measures, including criminal prosecutions under state and federal law, departmental discipline, civil rights actions under 42 U.S.C. 1983 and federal consent decrees under 34 U.S.C. 12601, with the goal of understanding the limitations of each as a check on racialized police violence. In the last segment of the course, students will review a sampling of the post-George Floyd proposals for reimagining policing and insuring accountability for wrongful conduct. Here, the discussion will challenge students to critique the broad expanse of ideas emanating from the reform movement, the proposals for defunding the police and the demands for abolition of the police altogether.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9105",
    "Title": "Rappaport Law and Public Policy Seminar",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Administrative & Government Law",
    "Areas3": "x",
    "Description": "This seminar explores contemporary issues at the intersection of law and public policy. It connects with the Rappaport Center's Senior Fellows in Residence. This year's Fellows are Jonathan B. Miller, Legal Director of the Public Rights Project and former Chief, Public Protection and Advocacy Bureau (2015-20), and Civil Rights Division (2012-2015) Massachusetts Office of the Attorney General and Ajmel Quereshi, Senior Counsel for the NAACP Legal Defense and Educational Fund and Director of the Civil and Human Rights Clinic at Howard University. Topics include: eviction policies; oversight of police misconduct; equity in public schools, executive power in a pandemic, racial inequity in the Massachusetts criminal justice system, immigrant rights, and multi-state litigation or technology in law enforcement. The seminar meets once per week for 2 hours. Students will also be required to view each Senior Fellow's public lecture. For one academic credit, students attend and participate in all classes and write two critical reflection papers. Students may enroll for 1 or 2 additional credits. For each additional credit, students will choose a topic to explore, develop a class presentation, and write a research paper of approximately 15 pages.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS9108",
    "Title": "The United States Senate Today: How It Works; Why It Doesn't",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Legal History & Jurisprudence",
    "Areas3": "x",
    "Description": "A real time study of the day to day workings of the United States Senate with someone who has been there.Students will act as staffers for a U. S. Senator throughout the semester, being assigned to various Senate staff duties such as legislation, press and committees. Class assignments will track the 2021 spring schedule and activities of the Senate, including floor votes and committee hearings, with class time serving as the Senators weekly staff meeting.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS9109",
    "Title": "Orwell's Nightmare: United States Law and the Support of Anti-Black Racism",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "Civil & Human Rights Law",
    "Areas3": "x",
    "Description": "Who controls the past controls the future. The past is erased, the erasure was forgotten, the lie became the truth. George Orwell, 1984U.S. history is filled with great achievements and accomplishments, yet the founding, development, and enrichment of our country is tied to our colonial and constitutional embrace of enslaving Black people and our post-civil war reliance on government policies, practices and procedures reflecting a denial of the humanity and dignity of Black people in the United States.Using the documentary &#34;Who We Are: A Chronicle of Racism in America&#34; as the foundation for study, reflection, and discussion, this course will examine anti-Black racism in the legal system through four primary focus areas: the criminal legal system, education, voting, and housing. Students will divide into groups and delve into an area, reviewing historical texts, caselaw, the U.S. Constitution, and original resources. Throughout the semester, we will explore the impact of anti-Black racism on the current gap between white and Black America at virtually every socio-economic measure, and ways to apply law to effect change going forward.This course is two credits and will require a 15-page paper (exclusive of footnotes).",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9151",
    "Title": "Restorative Justice in Courts",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The objective of this course, taught by a Federal District Court Judge, is to explore the theoretical underpinnings of restorative justice, practical applications of it in criminal and civil cases, and potential ways to integrate it into the legal system. Students will first learn about the origins of restorative justice principles and then will evaluate modern applications of those principles to legal conflicts, both in and out of the courtroom. By the end of the course, students will write a paper proposing and defending a reform to the civil or criminal justice system based on the restorative justice principles discussed throughout the class. Note:Not open to those who took LAWS806501 Restorative Justice as a 1L elective",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS9155",
    "Title": "The Cradle to Prison Pipeline",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Family & Estate Law;",
    "Areas3": "x",
    "Description": "In 2012, the DOJ's Civil Rights Division formally accused the city of Meridian, Mississippi and the state's departments of youth & human services of operating \"a school-to-prison pipeline\". While it is rare that such explicit practices are alleged, the reality of the school to prison pipeline is well documented. However, the realities of systemic practices & policies that have fueled what Marian Write Edleman & others have characterized as the cradle to prison pipeline are now being scrutinized. The BBA's Cradle to Prison Pipeline Committee describes the process as the mechanism by which disparities in a wide range of arenas--including economic, health care, mental health, housing, child welfare & juvenile justice factors--\"funnel\" people of color, the poor, the LGBTQ+ community, & youth with disabilities into the system of mass incarceration. \"Unpacking\" this phenomena entails examining critical issues of race, class, geographical & educational segregation & implicates consideration of the larger frames that affect families in & out of courtrooms. As Jill Lepore notes in Baby Doe: A Political Tragedy, between 2010-12, 72% of the youth committed to the MA DYS had been involved with DCF & over half of that number has been the subject of abuse & neglect petitions. In exploring this terrain this course will consider the evolution of child welfare & juvenile justice systems, de facto v. de jure segregation & to encourage students to think about ways to chart a different course.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS9313",
    "Title": "Modern Conservative Legal Thought",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This reading group will consider the application of modern conservative thought to questions of law, regulation, and governance. We will begin with the inquiry: what is conservative thought in the United States in the twenty-first century? We will then consider alternative schools of thought, focusing mostly on progressive thought, but also considering libertarianism as well as critical legal thought. After creating a schema of schools of thought, we will apply these to legal, regulatory, and governance problems. Depending on the pace of the course, we will apply our schemas to topics including the allocation of authority in a democratic republic, constitutional and statutory interpretation, separation of powers, speech rights, association rights, separation of church and state, law and economics, antitrust law, administrative law, and the regulatory state. Enrolled students can opt to write a longer paper for an additional credit, which will satisfy the upper-level writing requirement.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS9667",
    "Title": "The War in Ukraine and the Global Legal Order",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "The War in Ukraine is a decisive historical event that impacts the political and legal landscape of the world. This seminar invites students to read, reflect and discuss its complex causes and implications. By way of background, students will read about the history of Ukraine and Russia before and during the Soviet period, and after independence. They will also read about the geopolitical restructuring of the world political order in the early twenty-first century, including Russias positioning vis--vis the EU, NATO, the US, and China, as well as ongoing developments such as trade de-coupling and security regionalization. Students will study a variety of legal aspects of the war, including the annexation of Crimea, the Minks agreements and their constitutional implications in Ukraine and the Russian Federation, the sanctions regime, war crimes prosecution and the prospect of an international tribunal, Ukraines accession to the EU, Russias recognition of Donetsk and Luhansk, the grain export deal, the UN resolutions on Ukraine, the threat of nuclear weapons, and other issues that may come up as the war unfolds. There are no pre-requisites, everyone is welcome. Students from other departments may cross-register only by permission of the instructor. The seminar meets the Perspectives requirement. Final grade is based on reaction papers or answers to questions circulated well before the end of the semester.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9918",
    "Title": "Employment Discrimination",
    "Areas1": "Civil & Human Rights Law",
    "Areas2": "Labor & Employment Law",
    "Areas3": "x",
    "Description": "Employment Discrimination Law will focus primarily on the landmark Title VII of the Civil Rights Act of 1964, forbidding workplace discrimination because of race, color, religion, gender, or national origin. Like most such legislation, the language leaves enormous discretion in the courts to interpret the prohibitions, define the terms like \"discrimination,\"\"because of,\" etc., and formulate methods of proof and a remedial structure. We will study cases, work through problems, and explore the policy implications of judicial monitoring of workplace decision-making.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS9922",
    "Title": "American Legal History",
    "Areas1": "Legal History & Jurisprudence",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course surveys major developments of American legal culture, legal institutions, and the Constitution: (1) the seventeenth-century and British colonization (founding ideas of law and legal institutions; regulation of the family; the witchcraft trials; indentured servitude and slavery; property law; and legal practice and education); (2) the founding period (the legal formation of the United States); (3) the early nineteenth-century and Civil War (antebellum legal culture; the corporation; the Cherokees cases; antislavery and the Fugitive Slave Law; the Civil War and emancipation); (4) Reconstruction to the 21st century (women's suffrage; race relations; labor, property, and the corporation; legal education and the legal profession; the rising importance of rights; Reagan conservatism).",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS9926",
    "Title": "Taxation I (Individual Income Taxation)",
    "Areas1": "Tax Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Taxation I is the basic introductory course in federal income taxation. In contrast to courses in the first year, it is principally a statutory course, dealing with the Internal Revenue Code and the Regulations. The focus of the course is divided between mastery of the technical tax principles and understanding of the basic policy judgments which are implicit in those principles. For a student who takes no additional tax courses, Taxation I should provide an overall understanding of how the federal income taxation system functions. For students desiring to continue their studies of tax, Taxation I develops the themes which will be recurring in later courses and forms the basis on which the subsequent tax courses build.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS9941",
    "Title": "Antitrust Law in a Global Context",
    "Areas1": "Business Law",
    "Areas2": "Corporate & Securities Law",
    "Areas3": "International & Comparative Law",
    "Description": "Antitrust law governs much more than just mergers and acquisitions. Businesses must be aware of antitrust law when contemplating numerous business activities including joint ventures, contracts with suppliers and distributors, how to deal with competitors, what conditions can be attached to the sale or lease of goods and services, and what actions they may take as part of trade organizations. Moreover, as business becomes evermore global, lawyers need to know not just the law in the United States, but also approaches to antitrust law in other parts of the world, like the European Union. Accordingly, while the bulk of the course will cover U.S. law, the course will also cover select areas of antitrust law in foreign jurisdictions. No prior understanding of economics or trade regulation is required. Students will be taught the basic economics needed to analyze and practice antitrust law.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9943",
    "Title": "Criminal Procedure",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This course will focus on constitutional limitations on police practices. The 4th, 5th, and 6th Amendments are examined as they affect the warrant process, searches and seizures, interrogations, confessions and identification. The course considers in depth the exclusionary rule and other legal controls on police conduct. The course presents a unique opportunity to explore and contrast various judicial philosophies within the Supreme Court regarding criminal procedural protection. Teaching methodology is a combination of lecture, discussion, videos, and Socratic dialogue.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS9957",
    "Title": "Sports Law",
    "Areas1": "Business Law",
    "Areas2": "Intellectual Property & Technology Law",
    "Areas3": "x",
    "Description": "This course offers the study of selected topics in the application of law and legal thinking to sports. Particular attention is paid to how law or legal thinking shapes the business of sports and the behavior of those who run, play in, or regulate sports. Topics include league governance, merchandising, media rights, antitrust, labor law, and tort law. The class also includes on major simulation about the movement of college football teams to new conferences. The class requires a substantial research paper on a topic of the student's choice.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9969",
    "Title": "Environmental Law",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Environmental Law",
    "Areas3": "Real Estate Law",
    "Description": "The basic course in environmental law, studying a broad range of environmental cases--from pollution and nuclear issues to parks and wetlands--and focusing upon the legal doctrines, public and private law structures, and litigation techniques that apply to environmental protection controversies. This course studies the ways in which legal rules and procedures have been drawn from every corner of the legal system from tort and constitutional law to statutory and international law to handle environmental challenges of private and public actions. The course also serves as a case study in the implementation of public policy through litigation skills and legislative process.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9971",
    "Title": "Banking Regulation",
    "Areas1": "Administrative & Government Law",
    "Areas2": "Business Law",
    "Areas3": "x",
    "Description": "This course examines why the banking industry is one of the most heavily regulated U.S. industries and how federal safety and soundness regulation works from cradle to grave. The course begins by providing a historical overview and analyzing the rationales for government intervention in banking. The remainder of the course examines the techniques used by the government to constrain the risk of bank panics, including entry controls (through chartering), activities restrictions, prohibitions against mixing banking and commerce, minimum capital and other prudential requirements, and limits on risky activities by bank conglomerates. Special attention will be devoted to federal deposit insurance and the FDIC's procedures for resolving insolvent banks. Students will consider how well these rules work and the reforms enacted after the financial crisis of 2008. This course does not cover consumer financial protection or provisions of the Uniform Commercial Code.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9975",
    "Title": "Criminal Procedure (Adjudication)",
    "Areas1": "Criminal Law & Procedure",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Through a combination of simulated courtroom presentations and readings, this course covers the law of post-arrest criminal procedure from bail and grand jury proceedings through pre-trial discovery, plea bargaining, jury selection, trial and sentencing. In addition to simulated exercises and feedback, discussion topics will range from Supreme Court cases to policy issues such as the ethics of plea bargaining and the role of race in our criminal justice system. This course provides three credits toward the experiential learning requirement.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS9981",
    "Title": "Jessup Moot Court",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "This is for a 5th member of the Jessup Moot Court, who will be responsible for research, writing, and support to 3L oralists. Specifically, this team member will draft the facts section for the memorials (briefs), research points of law for use in the memorials, help edit the memorials, draft a bench memo that will be used to prepare practice round judges, update the bench memo weekly throughout the preparation for the competition, participate in practice rounds as an additional judge for the oralists, and serve as table counsel for the oralists during the 2023 competition. In the event that one of the 3L oralists becomes unable to participate in the spring semester, the role may be converted to an oralist position.",
    "Semester": "2023SPRG"
  },
  {
    "Number": "LAWS9983",
    "Title": "U.C.C. Reporter Digest",
    "Areas1": "Business Law",
    "Areas2": "",
    "Areas3": "x",
    "Description": "Department Permission",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS9993",
    "Title": "Estate and Gift Tax",
    "Areas1": "Tax Law",
    "Areas2": "Family & Estate Law",
    "Areas3": "x",
    "Description": "Estate and Gift Tax considers the federal estate, gift and generation skipping tax provisions as they apply to transfers during life and at death. There are no prerequisites for this course, although students interested in practicing in the trusts and estates area are encouraged to also take Tax I. It is required of any student wishing to take Estate Planning. The course is taught using the Socratic and problem method and class participation is expected and encouraged.",
    "Semester": "2023FALL"
  },
  {
    "Number": "LAWS9996",
    "Title": "Evidence",
    "Areas1": "Civil Litigation & Procedure",
    "Areas2": "Criminal Law & Procedure",
    "Areas3": "x",
    "Description": "Evidence is the study of the methods by which litigants prove facts at trial. This course emphasizes the Federal Rules of Evidence and the common law from which those rules were developed. After examining the concept of relevance, the basic requirement for the admissibility of evidence, the course covers more complex topics such as hearsay, character evidence, impeachment, expert and lay opinion, and authentication of exhibits.",
    "Semester": "2023FALL;2023SPRG"
  },
  {
    "Number": "LAWS9999",
    "Title": "Law Review",
    "Areas1": "Clinical & Experiential Education",
    "Areas2": "",
    "Areas3": "x",
    "Description": "TBD",
    "Semester": "2023FALL;2023SPRG"
  }
]