[{"Number":7731,"Title":"Administrative Law","Areas1":"Administrative & Government Law","Areas2":"Environmental Law","Areas3":" ","Description":"This course will examine the legal framework for the work of administrative agencies. We will explore the sources of authority for agency action under the U.S. Constitution and will examine the accountability of agencies to the legislative and executive branches of government. The course will survey the procedures that agencies must follow when they engage in rulemaking, enforcement, and adjudication. We will study the role of the courts in overseeing agency action. This course is intended to introduce students to regulatory agencies in a variety of substantive fields of law, such as financial, environmental, healthcare, immigration, labor, to name a few."},
    {"Number":8250,"Title":"Administrative Law Externship Seminar","Areas1":"Administrative & Government Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"For students who are enrolled in a law practice externship in the administrative law area, this is the co-requisite seminar."},
    {"Number":8701,"Title":"Administrative Practice","Areas1":"Administrative & Government Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This course focuses upon the skills needed to practice law in front of administrative agencies. Much of law school focuses upon statutory interpretation and courtroom practice. But state and federal agencies make far more rules each year than legislatures, and adjudicate far more cases than the judiciary. Agencies develop much of the law that governs our daily life, including many high-profile issues such as immigration, financial reform, and environmental protection. In this course, you will learn about agency rulemaking and adjudication through simulated proceedings, which will culminate in each student filing comments in a live proceeding before a federal or state agency."},
    {"Number":7729,"Title":"Advanced Constitutional Law: The Law of the Presidency and the Trump Administration","Areas1":"Constitutional Law","Areas2":"","Areas3":"x","Description":"Over the years of constitutional development a 'Law of the Presidency' has arguably evolved. This course will examine whether we will see a more active role for the courts during the presidency of Donald Trump. President Trump has been involved in several major disputes, attacking both his policy decisions and his personal conduct. The range of issues is wide: separation of powers, federalism, the First Amendment, the Emoluments Clause, national security, immigration, and important federal jurisdiction issues. This is a two-credit course, given in seminar form. The grade is based on a substantial paper of 25-35 pages. The instruction materials are earlier cases and material from cases, articles and bills involving President Trump. These materials will be emailed as the course develops."},
    {"Number":8452,"Title":"Advanced Evidence: Trial Objections","Areas1":"Criminal Law & Procedure","Areas2":"Civil Litigation & Procedure","Areas3":"x","Description":"The goal of this course is for students to understand how the rules of evidence operate in practice by providing them with the experience of trying to admit or to keep out evidence in a mock trial setting. This is done through a problem approach with particular attention paid to laying the foundation for admission of evidence during examination of witnesses. Topics include exceptions to the hearsay rules (admitting business records, prior recollections, etc.); laying foundation for the admissibility of expert and lay opinion; impeaching witnesses through character evidence and prior inconsistent statements; authenticating physical exhibits; and using chalks, demonstrative aids and diagrams. Students will perform weekly in-class simulations."},
    {"Number":8316,"Title":"Advanced Immigration Clinic","Areas1":"Immigration Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"A continuation of LAWS8313, Immigration Clinic."},
    {"Number":8273,"Title":"Advanced Innocence Clinic","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":""},
    {"Number":8130,"Title":"Advanced Legal Research","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"Advanced Legal Research offers an in-depth, hands-on experience with the process of legal research. Students use a wide range of legal materials and devise practical techniques and strategies for using these materials competently and effectively. The goal of the course is to create self-sufficient legal researchers capable of analyzing and resolving legal problems effectively. Emphasis is placed on the types of legal sources and research not covered in the first year of law school (e.g., treatises, forms sources, administrative law, statutory research, legislative histories and legal practice materials). Both print sources and free and fee-based electronic sources are explored and critiqued. The course covers Westlaw, LexisNexis, BloombergLaw, and other electronic sources."},
    {"Number":4485,"Title":"Advanced Legal Writing","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"This course focuses on legal analysis and writing with a particular focus on the audience and purpose of written legal communications. The primary purpose of this course is to assist students in becoming practice ready attorneys. Students will continue to build on the skills gained in their First Year Legal Research and Writing course and need only an interest in bettering their writing skills, including their editing skills. Using hypothetical client problems and a simulated court record, students will write client communications, including client letters and electronic communications, as well as pretrial civil litigation documents, such as legal briefs. Students will spend course time discussing each written assignment, reviewing drafts, and collaborating on in-class exercises."},
    {"Number":4484,"Title":"Advanced Legal Writing--Employment Law","Areas1":"Labor & Employment Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"In this course, you will apply your legal research, writing, and analysis skills in the context of an employment law practice. Assignments will include pragmatic tasks such as a discrimination position statement, an advice letters concerning an employment policy, and a brief addressing an employment law issue."},
    {"Number":4441,"Title":"Advanced Local Government: Sanctuary, Climate Change, Drugs, Crime, and Social Justice","Areas1":"Constitutional Law","Areas2":"Criminal Law & Procedure","Areas3":"Environmental Law","Description":"In recent years and especially after the 2016 election, local governments have emerged as powerful antagonists to national policies. This seminar will examine the promises and dangers of this new focus by looking closely at a few areas of particularly salient and intense contestation. These areas will include policies around: immigration and "},
    {"Number":8552,"Title":"Advanced Trial Practice","Areas1":"Civil Litigation & Procedure","Areas2":"Criminal Law & Procedure","Areas3":"x","Description":"This seminar offers a dynamic view of the litigation process. Students will participate in in-class demonstrations to build skill sets in all stages of trial advocacy. The course will focus on all aspects of a trial including; opening statements, conducting direct and cross examination of witnesses, laying proper evidentiary foundations, raising and arguing objections, refreshing witness recollection, impeaching and rehabilitating witnesses and delivering closing arguments. Students will also learn 'soft skills' such as how to use movement in the courtroom, how to use volume, tone and pitch to effectively present a case to a jury, and how to best utilize evidence or other demonstrative aids during trial. The course offers a variable credit option for those students who are selected by the faculty to compete on the school's mock trial competition team as a part of the National Trial Competition."},
    {"Number":8472,"Title":"Advocacy Competitions","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"This is the companion class to the national moot court teams. Enrollment and attendance in this class is mandatory for all members of a national team. The goal of the class is to help prepare students for not only for their individual competitions but also for litigation practice. The class is divided into three parts: overview of the moot court experience, appellate written advocacy and oral advocacy.The class will meet formally during the Fall semester until Oct 15. The class will reconvene in the first half of the Spring with their team coaches for oral advocacy/moot sessions until the competitions are complete. Students should expect an 'incomplete' grade until they have completed their moot court experience (February/March)."},
    {"Number":3344,"Title":"American Legal Education","Areas1":"Legal History & Jurisprudence","Areas2":"","Areas3":"x","Description":"This seminar is designed for students who would like to examine carefully the nature of their legal education. We will commence with the English and Continental origins of legal scholarship and teaching, examine the development of formal legal education in America from the founding of the Litchfield and Harvard Law Schools to the rise of Legal Realism, and conclude with the pressing controversies facing America's law schools today. Among the topics covered will be the relationship between formal legal education and the practicing bar, the changing composition of the faculty and the student body, the early pedagogical controversies, the different methods and ends of modern legal instruction and the role played by law schools in fundamental disputes about jurisprudence political ideology, economics, and social reform. A research paper will be required rather than a final examination. Multilithed materials. Course will be taught at Harvard Law School."},
    {"Number":9922,"Title":"American Legal History","Areas1":"Legal History & Jurisprudence","Areas2":"","Areas3":"x","Description":"This course surveys major developments of American legal culture, legal institutions, and the Constitution: (1) the seventeenth-century and British colonization (founding ideas of law and legal institutions; regulation of the family; the witchcraft trials; indentured servitude and slavery; property law; and legal practice and education); (2) the founding period (the legal formation of the United States); (3) the early nineteenth-century and Civil War (antebellum legal culture; the corporation; the Cherokees cases; antislavery and the Fugitive Slave Law; the Civil War and emancipation); (4) Reconstruction to the 21st century (women's suffrage; race relations; labor, property, and the corporation; legal education and the legal profession; the rising importance of rights; Reagan conservatism)."},
    {"Number":4411,"Title":"American Legal Theory","Areas1":"Legal History & Jurisprudence","Areas2":"","Areas3":"x","Description":"This course will survey the important developments in American legal theory from 1880 to the present time. Coverage will include Legal Formalism, Legal Realism, Sociological Jurisprudence, Legal Process Theory, Theories of Natural Law, Critical Legal Studies, Feminist Legal Theory, and Critical Race Theory. The course does not require previous familiarity with jurisprudence or philosophy of law."},
    {"Number":7758,"Title":"American Pragmatism","Areas1":"Legal History & Jurisprudence","Areas2":"","Areas3":"x","Description":"Pragmatism is the most distinctive philosophical movement to arise on American soil. Its origins can be traced to a post-Civil War discussion group called the Metaphysical Club whose members included Charles Peirce, William James, Oliver Wendell Holmes, Jr., and a number of other distinguished thinkers. Their influence extended to many fields well into the twentieth century. In this class, we will consider pragmatism as a theory of meaning, a philosophy of science, and a political theory that places an on-going human community at the center of the quest for knowledge."},
    {"Number":8423,"Title":"Amicus Brief Clinic","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"The Amicus Brief Clinic will provide students and faculty an opportunity to weigh in on, and attempt to influence, the development of the law and public policy in the courts. In the Amicus Brief Clinic faculty will identify an important legal issue being considered or soon to be considered by a court. Faculty will then guide a small student team in the process of researching, writing, editing, and submitting an amicus brief to the court for consideration.Although the subject matter and faculty leader of each amicus brief will be different, every Amicus Brief Clinic will include instruction and supervision on legal research and writing as well as the rules relating to submission of amicus briefs."},
    {"Number":7744,"Title":"Anatomy of a Cross-Border Insolvency","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"The purpose of this course will be to take students through a cross-border case from beginning to end, using Montreal Maine & Atlantic Railway Ltd. ('MMA') as the primary 'hypothetical' case, but borrowing from and referring to the other recent cases as well. MMA was a unique case presenting a variety of cross-border issues; the case--precipitated by the tragic derailment at Lac Megantic, Quebec--has been described as a 'mass tort, environmental disaster cross-border chapter 11, with a railroad reorganization attached to it.' The course will illustrate the difficult legal, political & practical problems faced by practitioners in these cases. As a result of the journey through the case(s), students will be taught concepts of extraterritoriality (& its limits); jurisdiction over foreign persons & entities (& its limits); the doctrine of forum non conveniens in the international context; and comity (& its limits). Students will also learn the basics mechanics of chapter 15 (& its international counterparts) and its critical substantive and procedural components. Through the use of the MMA case study, students will be exposed to how these concepts and issues arise and are dealt with in an actual case, rather than being exposed only to the theoretical problems. Using experiential learning opportunities in the case, students will be placed in the position of the various parties & their counsel, with the attendant need to argue relevant positions and solve the problems it presented."},
    {"Number":6686,"Title":"Anglo-American Legal Heritage","Areas1":"Legal History & Jurisprudence","Areas2":"","Areas3":"x","Description":"A study of how law originates and changes, with an emphasis on some of the fundamental controversies of legal history. The course will cover Anglo-American law and legal institutions from the Anglo-Saxon period through the twentieth-century legal realist movement, and will examine closely the origins of the courts and the jury, the sources of law, the development of precedent justice, and the growth of the legal profession. No previous background will be assumed, and the course will lead into the American Legal History course."},
    {"Number":9940,"Title":"Antitrust Law","Areas1":"Administrative & Government Law","Areas2":"Business Law","Areas3":"Corporate & Securities Law","Description":"Antitrust law issues abound in many areas of law, including corporate work, litigation, and even tax law. This course covers basic U.S. antitrust law, as codified in the major federal antitrust statutes, and the body of case law interpreting these statutes. Specific topics to be covered include agreements in restraint of trade, monopolization, vertical and horizontal mergers, price discrimination, and tying. No prior understanding of economics or trade regulation is required. Students will be instructed in the basic economics of competition and monopoly needed to analyze and practice antitrust law."},
    {"Number":8471,"Title":"Appellate Advocacy","Areas1":"Clinical & Experiential Education","Areas2":"Civil Litigation & Procedure","Areas3":"x","Description":"This course will offer hands-on experience and explore in depth the craft of appellate advocacy. Topics include: the rules and mechanics of the appellate process; formulation of strategies on appeal, use of the appellate record, brief writing; and oral argument. One of the class sessions will be held at the Adams Courthouse, where the students will attend an oral argument and then meet for a post-argument discussion. Students apply what they have learned to the drafting of an appellate brief based on an actual court record. The brief is written in stages and followed by one-on-one critiques. Students also present an oral argument which will be critiqued and may be videotaped. Students will be graded on the basis of their brief, oral argument and class participation."},
    {"Number":8856,"Title":"Attorney General Clinical Program","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"See course description at Attorney General Clinical Program Seminar."},
    {"Number":8858,"Title":"Attorney General Clinical Program Seminar","Areas1":"Civil Litigation & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"The AG Clinical Program is a full-year clinical experience in civil litigation in the Massachusetts Office of the Attorney General. Students work directly with assistant attorneys general in the representation of state agencies and officials in state and federal courts. The clinic teaches includes the following types of legal work: (1) the drafting of pleadings, motions, discovery, and other litigation documents; (2) legal research and writing of briefs in the trial and appellate courts; (3) oral argument in the state courts; and (4) other litigation tasks. Students will be assigned to one of two Divisions in the Government Bureau, either the Administrative Law Division or the Trial Division. Students assigned to the Administrative Law Division will work on cases involving administrative and constitutional law, federal courts, and statutory construction. Students assigned to the Trial Division will work on cases involving employment, tort, contracts and eminent domain and land use law."},
    {"Number":4464,"Title":"Authority and Leadership in Professional Life","Areas1":"Legal History & Jurisprudence","Areas2":"Ethics & Professional Responsibility","Areas3":"x","Description":"This course focuses on the conscious and unconscious group and systemic dynamics that arise from the exercise of authority, leadership, and power. Students learn by studying their own experience and linking this to theory and class reading. Classes are intensely psychodynamic in nature, and promote powerful and often emotional interchange as students explore the dynamics of social identity and processes such as splitting, projection, and projective identification. Students experiencing a difficult period in life should speak to the professor before enrolling. Class attendance is required. Attendance at a group relations conference is strongly encouraged; one is scheduled at Boston College, March 31-April 2, 2017 (there is a registration fee). Variable credit offered for attendance at, and reflection paper on conference experience. Contact Professor Sarda for information (sarda@bc.edu). Limited enrollment."},
    {"Number":9971,"Title":"Banking Regulation","Areas1":"Administrative & Government Law","Areas2":"Business Law","Areas3":"x","Description":"This course examines why the banking industry is one of the most heavily regulated U.S. industries and how federal safety and soundness regulation works from cradle to grave. The course begins by providing a historical overview and analyzing the rationales for government intervention in banking. The remainder of the course examines the techniques used by the government to constrain the risk of bank panics, including entry controls (through chartering), activities restrictions, prohibitions against mixing banking and commerce, minimum capital and other prudential requirements, and limits on risky activities by bank conglomerates. Special attention will be devoted to federal deposit insurance and the FDIC's procedures for resolving insolvent banks. Students will consider how well these rules work and the reforms enacted after the financial crisis of 2008. This course does not cover consumer financial protection or provisions of the Uniform Commercial Code."},
    {"Number":9956,"Title":"Bankruptcy Law Research","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"Students are introduced to research methods and resources for tracking bankruptcy filings, locating court opinions, and utilizing practice materials. Course covers statutory research in bankruptcy code, use of treatises, desk books and other research sources. Emphasis is on the technology and tools used in current bankruptcy practice, e.g. electronic case filing (ECF/ECM), docket searching and specialized bankruptcy practice software. Course grade is based on several written assignments."},
    {"Number":8304,"Title":"BC Defender Program Clinic","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"The BC Defender program is a full-year criminal defense clinic and a weekly seminar class. Practicing under faculty supervision pursuant to SJC Rule 3:03, BC Defenders represent clients charged with crimes and probation violations in the Boston Municipal Court (Dorchester Division). In the course of representing their clients, students broaden their own life experiences and develop professional skills, including interviewing, counseling, investigation, legal research and writing, collaborating, negotiating, oral advocacy, case organization and management, and trial skills."},
    {"Number":6605,"Title":"BC Defender Seminar","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"The weekly defense class involves readings, discussions, role-plays, case rounds, mock trials and hearings, and reflections on the students' experiences, their clients and cases, professional ethics, the role of the public defender, and other issues relating to the criminal justice system."},
    {"Number":8308,"Title":"BC Defenders Clinic: Compassionate Release and Parole","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Under the newly enacted Criminal Justice Reform Act, inmates incarcerated at the state prison who are suffering from terminal illnesses or from irreversible physical or cognitive incapacitation may be eligible for medical release ('compassionate release'). Students will help prepare a petition for release and an accompanying medical parole plan with the assistance of a social worker or social work student. Students will advocate with the Department of Corrections and/or in the courts for release.Inmates who have become eligible for parole after serving at least fifteen years in prison appear before the Massachusetts Parole Board often without representation. Students will help prepare such inmates for their parole hearings and will represent them at the hearings."},
    {"Number":8263,"Title":"BC Innocence Clinic","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Students in BC Innocence clinic work with faculty supervision on post-conviction screening and/or litigation of cases of prisoners who assert their innocence. Case screening involves review of trial transcripts, pre-trial discovery, appellate and post-conviction briefs, and judicial opinions, as well as factual and forensic research, to determine whether scientific testing or other investigative leads could establish a strong likelihood that the prisoner is factually innocent. Students produce a memorandum analyzing the case and making a recommendation as to whether post-conviction litigation should be pursued. Students engaged in litigation research and draft motions for various types of post-conviction relief with supporting memoranda and affidavits. Class component is devoted to case-rounds and development of legal, professional, and ethical skills in the context of post-conviction innocence work. Students spend 10-12 hrs/week outside of class time on casework."},
    {"Number":8887,"Title":"BC Innocence Program Externship","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Students enrolled in the BCIP study the problem of wrongful convictions and provide pro bono legal assistance to prisoners who maintain their innocence. Students in the program choose from a menu of supervised experiential educational opportunities (including both an in-house clinic at the Law School and externship placements at the New England Innocence Project and the Committee for Public Counsel Services) and bring those experiences to bear on their studies in the spring semester Wrongful Convictions course taught by Professor Beckman."},
    {"Number":8306,"Title":"BC Law Prosecution Clinic","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"The Prosecution Program is a one-semester course offered only in the fall. Students enrolled in this clinic work within a local District Attorney's Office 2-3 days each week, handling a variety of misdemeanor and minor felony charges from arraignment to bench trial. Students are responsible for their own cases in court and meet weekly with a faculty supervisor for case preparation and supervision. Students' court experiences provide the basis for a close and critical examination of their role and their impact on the criminal justice system."},
    {"Number":4469,"Title":"BC Law Prosecution Seminar","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This weekly seminar focuses on the development of lawyering skills, the formation of professional identity, and the study of the prosecution function."},
    {"Number":3362,"Title":"Blockchain, Cryptocurrencies & Digital Assets","Areas1":"Business Law","Areas2":"Intellectual Property & Technology Law","Areas3":"x","Description":"Welcome to a course where blockchain assets meet law. This course is designed to give the students an understanding of blockchain technology as well as cryptocurrencies and other digital assets, and their interaction with law and the legal practice. The course will explore the legal issues arisen by the innovative business models utilizing peer-to-peer networks and distributed ledger technology. During the course, we will analyze several major cryptocurrency issuances (e.g., Bitcoin and Ether) and the benefits of tokenizing or digitalizing other assets, like gold, art, or equity, as well as the business and legal issues connected to trading them. Moreover, students will learn about stablecoins and central bank digital currencies."},
    {"Number":3961,"Title":"Business and Human Rights","Areas1":"Business Law","Areas2":"Civil & Human Rights Law","Areas3":"x","Description":"Human rights are traditionally thought of as a set of norms and practices to protect individuals from threats by the state as a result of a state's duty to secure the conditions necessary for people to live a life of dignity. Gradually, obligations under this regime were extended to individual persons, including heads of state, seeking to hold them to account for conduct that rises to the level of international crimes. The1990s marked an effort to expand these norms to business enterprises, particularly multinational corporations. In 2011, the United Nations Human Rights Council unanimously endorsed the UN Guiding Principles on Business and Human Rights (UNGPs). Key elements of the UNGPs have also been adopted by numerous other international and national standard setting bodies, individual companies and business associations, workers organizations and civil society actors.This course will look at the governance gap prior to the UNGPs and their emerging doctrine, along with the three pillars they present, the state duty to protect, the business responsibility to respect, and access to remedy. In addition, participants will simulate an experience in developing a human rights impact assessment and advocacy strategy for holding corporations accountable.Students will be evaluated on two projects throughout the semester and a final paper along with class participation."},
    {"Number":7733,"Title":"Business Bankruptcy","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"This course explores business reorganization under Chapter 11 of the Bankruptcy Code. It also touches on Chapter 7 liquidation for business entities. It adopts a problem-solving approach. Secured Transactions is recommended but not required. Students should take this course if they plan to practice any type of business law -- transactional as well as commercial litigation."},
    {"Number":3376,"Title":"Business Immigration Law","Areas1":"Business Law","Areas2":"Immigration Law","Areas3":"x","Description":"This course will provide an overview of the various employment-based non-immigrant and immigrant visa categories, as well as the nuts and bolts of case preparation for the most commonly pursued non-immigrant and immigrant classifications. We will review the process for becoming a lawful permanent resident of the United States through employment-based sponsorship, including the labor certification process under PERM, the I-140 immigrant petition and options for employment sponsored permanent residence petitions other than PERM, and adjustment of status or consular immigrant visa processing. The course will also include discussions regarding the practice of business immigration law in a law firm environment, touching on applicable ethical considerations, client relations, client interviewing, and tips for strategic case representation and client management for companies both large and small."},
    {"Number":8252,"Title":"Business Immigration Law Externship Seminar","Areas1":"Business Law","Areas2":"Immigration Law","Areas3":"Clinical & Experiential Education","Description":"This one credit seminar is required of students who are enrolled in an externship in the Business Immigration Law field."},
    {"Number":7708,"Title":"Business Law and Health Care Enterprises","Areas1":"Health Law","Areas2":"","Areas3":"x","Description":"This seminar focuses on the business and corporate practices of health law. It covers legal issues involving private and government insurance, managed care, tax-exempt status, health care organizations, professional contracts, and labor relations. Evaluation will be based on a substantial paper, class presentation, and class participation."},
    {"Number":8133,"Title":"Business Law Research for the Transactional Practitioner","Areas1":"Business Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Business Law Research is a simulation class in which students develop primarily their legal research skills, but also other lawyering skills such as organization and management of legal work, professional ethics, and collaboration. Students will educate themselves on critical research skills for transactional law practice through legal compliance scenarios that apply state, federal, and local law. Students in this class will also develop key business law research skills needed for drafting contracts and working on other important transactional tasks, such as due diligence for business combinations. Most initial research instruction takes place outside the classroom so that students can work on simulations in the classroom and receive guidance from the instructor. There are multiple opportunities for self-evaluation as well as extensive feedback on a regular basis from the instructor."},
    {"Number":6663,"Title":"Children's Law and Public Policy","Areas1":"Civil & Human Rights Law","Areas2":"Family & Estate Law","Areas3":"x","Description":"Children's Law and Public Policy provides an overview of U.S. law and legal systems impacting the lives of vulnerable children. The course focuses both on process, how courts, administrative agencies, and attorneys representing youth, parents, and the state process and service cases of individual youth, and on policy, how these systems are designed and connected to one another and to broader developmental and rights frameworks. Substantive legal areas will include child maltreatment and termination of parental rights, status offenses, juvenile justice, challenges to state systems and conditions for youth in custody, school exclusion and its relationship to special education law, special immigrant juvenile status, and domestic and international trafficking of minors."},
    {"Number":8150,"Title":"Children's Rights Practice","Areas1":"Family & Estate Law","Areas2":"","Areas3":"x","Description":"Children's Rights Practice is a 1L Elective designed to introduce students to the law and skills needed to represent children involved with state systems. A hypothetical case of a multi-system involved teenage girl will be carried through the semester exposing students to child welfare, delinquency and education law. Student simulations will include interviewing the adolescent client, representing her at a multi-disciplinary meeting, and negotiating a settlement of her education-based claim. In addition to relevant law and policy, guest speakers will discuss child development and how to work with an expert consultant to advance your client's case. Critical issues of professional responsibility, such as client directed representation and how to navigate family relationships while representing the child, will also be studied."},
    {"Number":6760,"Title":"China's Challenge: The Role of Law in the PRC","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"For better or worse, China impacts all our lives. She is a leading force on the global political and economic scene. At the same time, she faces epic problems concerning the environment, corruption, increasing income gap and much more. This course examines China's project of legal development since the 1980s, which is perhaps the most concerted effort in world history to build a legal order and yet one that continues to encounter difficulties in addressing the nation's many challenges. After a short review of China's pre-revolutionary legal history and an introduction to its principal modern legal institutions, this course will look at a cross-section of the most important legal questions confronting China and a world seeking to deal intelligently and effectively with it. Areas of focus will include legal questions surrounding the economy, foreign investment, intellectual property protection, the political sphere, social issues, and dispute resolution."},
    {"Number":9937,"Title":"Chinese Law Program","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"Through partnership with Indiana University- Indianapolis, BC law students enroll in the IU-Indianapolis China Law Program at Renmin University in Beijing, which runs late May-June. Students attend 2 or 4 weeks of classes taught by Chinese professors and visit legal institutions and cultural sites in the Beijing area. Students must commit by March 30. In addition to successful completion of the IU program, students will submit weekly journals to Prof. McMorrow. Students are responsible for the IU-Indianapolis program expense and all related travel and living expenses. Credit is allocated to the fall semester."},
    {"Number":8978,"Title":"Civil Litigation Clinic","Areas1":"Civil Litigation & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This civil clinical course allows students the opportunity to practice law under the close supervision of clinical faculty at Boston College Legal Services LAB, which is located in the Center for Experiential Learning on the Law School campus. Students are certified by the Massachusetts Supreme Judicial Court to advise and represent clients in every aspect of civil litigation. Practice areas are family law, housing, and public benefits appeals. Clinical faculty provide thorough feedback about students' work at all stages in order to help them build on their skills and learn from their experiences, including comprehensive feedback at both mid-semester and end of term. Six-credit students are expected to spend an average of 17-22 hours/week on clinic matters; ten-credit students average 30-35 hours/week. Pass/fail and variable credit options can only be exercised at the beginning of the term. Enrollment, by lottery, is limited to 16 students in the Fall, and 10 in the Spring."},
    {"Number":9979,"Title":"Civil Litigation Clinic Class","Areas1":"Civil Litigation & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Students enrolled in the Civil Litigation Clinic also participate in a weekly seminar where issues related to students' actual cases are examined. The practical, legal and ethical issues of lawyering are explored in detail through discussion, simulations, and review of video recorded portions of students' meetings with their clients. In addition to class participation, students draft four reaction papers during the term, reflecting on their lawyering, systemic challenges, and social justice issues which they have observed. Students receive the same grade for both their clinic and seminar work. Pass/fail can only be exercised at the beginning of the term. Selection by lottery."},
    {"Number":2120,"Title":"Civil Procedure","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"Using the Federal Rules of Civil Procedure, this course introduces rules governing the conduct of litigation. After an overview of the entire sequence of events from commencement to final disposition of a lawsuit, specific topics are considered in detail."},
    {"Number":4486,"Title":"Civil Rights Law","Areas1":"Civil & Human Rights Law","Areas2":"Constitutional Law","Areas3":"x","Description":"This course comprises an advanced constitutional and statutory study of the noncriminal statutes that Congress has enacted to protect civil rights in the United States. The course will proceed in two parts. First, we will focus on statutes passed during Reconstruction after the Civil War which authorize the enforcement of federal constitutional rights (e.g., police brutality cases), including limitations on the liability of officials and government bodies. Second, beginning with the Civil Rights Act of 1964, we will consider a wide range of substantive civil-rights violations, including due process violations, equal protection violations, denial of free speech, voting and public accommodations and discrimination, excessive force, unlawful searches and seizures, and unlawful prison conditions. Time permitting, the course will also contemplate current federal and/or state action, like Supreme Court litigation, implicating civil rights."},
    {"Number":6682,"Title":"Commercial Law: Secured Transactions","Areas1":"Real Estate Law","Areas2":"Business Law","Areas3":"x","Description":"This course explores secured financing--transactions in which a creditor, a lender, or a seller takes a security interest in collateral to secure its ability to be repaid. The course focuses principally on secured transactions involving personal property and fixtures (Article 9 of the Uniform Commercial Code). It examines the debtor-secured creditor relationship at state law and in bankruptcy. The course adopts a problem-solving approach. Class time is devoted almost exclusively to analyzing the assigned problem. This is a basic or 'primer' course for business law practice. It also provides an intense experience in interpreting statutes."},
    {"Number":8267,"Title":"Community Enterprise Clinic","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"Clinical & Experiential Education","Description":"This course introduces students to transactional legal work on behalf of low- and moderate-income entrepreneurs, small businesses, nonprofit organizations, and first-time home buyers. The fieldwork is based at the Law School's Legal Services LAB located in the Center for Experiential Learning on campus. Students will perform all of the legal work and interact with the clients. Students will be assigned to work with entrepreneurs with business-related legal needs; with emerging, community-based small businesses facing corporate, employment or similar legal issues; with nonprofit organizations or groups seeking assistance to establish a tax-exempt organization; and first-time home buyers. For fieldwork purposes students will be assigned six office hours per week at the clinic, arranged based on the student's schedule. The fieldwork is complemented by a weekly seminar. The weekly seminar will address substantive law, ethical issues, and legal skills."},
    {"Number":3336,"Title":"Community Enterprise Clinic Class","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"Clinical & Experiential Education","Description":"A weekly seminar will address substantive law, ethical issues, and legal skills."},
    {"Number":9932,"Title":"Comparative Constitutional Law","Areas1":"Constitutional Law","Areas2":"International & Comparative Law","Areas3":"x","Description":"This course will introduce students to the comparative study of constitutional law. Students will learn how to use the comparative lens to reflect on topics such as the organization of the state, the role of courts, the nature and structure of political power, forms of judicial review, the protection of fundamental rights, judicial methodology. There will be a take-home exam."},
    {"Number":7739,"Title":"Conflict of Laws","Areas1":"Legal History & Jurisprudence","Areas2":"Constitutional Law","Areas3":"x","Description":"Disputes often arise involving transactions, occurrences, or events that touch on the laws of different legal systems--a car crash in Missouri involving residents of California and New York, a contract between a U.S. purchaser and a seller in Italy, a marriage in Nevada between two Canadian citizens who reside in Massachusetts, etc. When such disputes result in litigation, how should a court determine which jurisdiction's laws govern which aspects of the parties' legal rights and responsibilities? This course examines the ways in which courts determine which substantive, procedural, and remedial law should be used to adjudicate disputes involving such multi-jurisdictional contacts. This course will be of special interest to students considering a career in litigation as the problem of conflicting law is endemic in modern litigation, and the ways in which courts resolve these conflicts is not intuitive. Topics covered will include the historical development of principles governing conflicts between the laws of different states within the U.S. legal system and modern approaches to such questions; the role of state and foreign law in federal court adjudication; constitutional limits on choice of law; and the legal effectiveness of judgments issued by courts in a different jurisdiction."},
    {"Number":4413,"Title":"Constitutional History: The Framing","Areas1":"Constitutional Law","Areas2":"Legal History & Jurisprudence","Areas3":"x","Description":"This seminar will focus on the framing period of the U.S. Constitution as a political, legal, historical, cultural, intellectual, and literary process. We will consider a range of topics using primary and secondary sources, including, e.g., the idea of a 'constitution'; the narrative of the Convention; the reliability of the sources; the various initial plans and strategies; issues of representation and slavery; the conception of the executive and judiciary; the role of committees and drafts; ratification; the process of amendment; American constitutional culture."},
    {"Number":2125,"Title":"Constitutional Law","Areas1":"Constitutional Law","Areas2":"","Areas3":"x","Description":"Constitutional Law introduces the concept of judicial review of legislation and executive action. The course also focuses on the express and implied powers of the federal government and the effect of the interstate commerce clause on federal and state power."},
    {"Number":2182,"Title":"Constitutional Law: Rights and Equality","Areas1":"Constitutional Law","Areas2":"Civil & Human Rights Law","Areas3":"x","Description":"This course continues the study of constitutional law by focusing on individual rights under the Fourteenth Amendment, particularly the protections of due process and equal protection."},
    {"Number":2181,"Title":"Constitutional Law: Speech and Religion","Areas1":"Constitutional Law","Areas2":"","Areas3":"x","Description":"In this course, students will study the First Amendment rights of free speech, religious exercise, and non-establishment of religion. The course will cover the theories of these rights, their original meaning, and how they have evolved over time. Students will also analyze how these rights overlap or conflict. The course will cover the substance of the rights in question as well as the proper claimants; including whether and when corporate entities can bring constitutional claims. Students will gain a sophisticated knowledge of existing law and develop a strong theoretical foundation for evaluating future cases."},
    {"Number":7710,"Title":"Constitutional Theory","Areas1":"Constitutional Law","Areas2":"Legal History & Jurisprudence","Areas3":"x","Description":"Great constitutional questions always evoke constitutional theory. This course focuses on the great constitutional questions of our time, from the institutional design of electoral systems to the future of the separation of powers; from the constitutionalization of the economy to the constitutionalization of the environment; from the constitutionalization of the family to the constitutionalization of entertainment; from the clash between information and privacy to the tension between constitutional stability and cultural change. Students read landmark judicial decisions as well as the most fecund constitutional scholarship. Graded on final paper. No knowledge of constitutional doctrine or of legal theory assumed. Students and auditors from across the university are welcome. No pre or co-requisites. Meets the Law School?s Perspectives Requirement."},
    {"Number":3379,"Title":"Consumer Bankruptcy","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This course studies bankruptcy relief for individual debtors under chapter 7 (liquidation) and chapter 13 (rehabilitation). Topics covered include pre-bankruptcy planning, the means test, eligibility, property of the estate, the automatic stay, exemptions, lien avoidance, non-dischargeable debts including domestic support and other marital obligations, jurisdiction issues, reaffirmation and redemption rights, the trustees avoiding powers, avoidance actions (preferences and fraudulent transfers), chapter 13 plans, and the bankruptcy discharge. The course adopts a problem-solving approach. The final grade for the course is based on an in-class final exam. Students should take this course if they plan to: 1) practice in a small firm; 2) represent consumers and small business owners; 3) practice domestic relations law; 4) apply for a bankruptcy court clerkship"},
    {"Number":3379,"Title":"Consumer Bankruptcy Seminar","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This course will focus on critical issues regarding consumer credit and consumer law, in part through inquiries into key aspects of debt collection law and the consumer bankruptcy system. This course will discuss a range of consumer credit products, including mortgages, medical debt, student loans, auto loans, credit cards, and alternative financing, such as payday loans. This course will consider consumer credit as a contributor to peoples bankruptcy filings and the role of attorneys and other actors in the consumer credit and bankruptcy systems. Readings will come from law and non-law sources, including law reviews and the work of a variety of social scientists. The course will discuss issues relevant to the legal system and the study of law generally, including the use of data to measure legal problems, the role of lawyers and non- lawyers, and the nature of modern policymaking. Satisfies Upper Level Writing Requirement."},
    {"Number":8916,"Title":"Consumer Financial Protection Seminar","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This seminar will focus on the developing law of consumer financial protection and the new Consumer Financial Protection Bureau."},
    {"Number":7766,"Title":"Consumer Law","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"Every time you use cash or credit to buy goods or services for personal use, Consumer Law governs your rights and responsibilities. This course provides a general overview of Consumer Law standards, and focuses on the tools available to attorneys representing consumers (and those defending companies) when consumer disputes arise. The course will consider the common law, statutory, and regulatory regimes that govern Consumer Law claims. We will also analyze the tactics and strategy involved in consumer protection litigation, by reviewing real examples and examining the choices available to both the businesses and consumer advocates in the ensuing court actions. Finally, we will focus on several specific substantive areas, including the sub-prime mortgage debacle, internet privacy, and credit card reform. Due to time constraints and the availability of other courses, this course will not cover personal bankruptcy. Grades will be based on an in-class examination."},
    {"Number":3231,"Title":"Contract Drafting","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This course provides a foundation for drafting contracts, a skill critical for all lawyers. Lawyers are writers. A big part of that writing consists of contracts, not just for transactional lawyers but also including litigators, family lawyers, regulatory lawyers (both government and private practice), and others. This class covers both the why of various contract parts and technical writing skills. Thus the course will examine contractual covenants, representations and warranties, conditions, remedies, choice of law and other provisions. Technical topics include structuring contracts and crisp drafting of substantive terms and definitions. To meet the upper-level writing requirement, after learning the various topics and drafting techniques, students will draft various contracts from scratch that together meet the 30-page minimum. That will be the primary component of the grading, and there will also be a significant class participation portion of the grade."},
    {"Number":2130,"Title":"Contracts","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"The concept of what constitutes a contract is followed by detailed study of the various principles that govern the enforcement of contracts. Common law rules are emphasized, but attention is also given to the statutory changes imposed by the Uniform Commercial Code."},
    {"Number":7746,"Title":"Copyright","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"This course studies the ability of authors, publishers, artists, and others to control the distribution, sale, copying, and performance of their works. Topics will include the subject matter of copyright, requirements for copyright, proof of infringement, and remedies. The course will cover the application of copyright law to music and literature as well as the rapidly developing use of copyright law to protect high technology products such as computer programs. Students interested in pursuing careers in high technology law should seriously consider taking classes in both copyright and patent law."},
    {"Number":6826,"Title":"Corporate Compliance: Building a Strong Compliance Culture","Areas1":"Corporate & Securities Law","Areas2":"Business Law","Areas3":"x","Description":"This course will provide students with an understanding of the primary aspects of designing, implementing, and maintaining effective corporate compliance programs that will withstand the test of time. The course will examine the key aspects that make up an effective program and comply with the Department of Justice (DOJ) expectations for such programs. Students will examine recent high profile case studies involving companies whose compliance programs were tested by courts, prosecutors, and the public at large. The course will also explore the public policy interests associated with giving corporations favorable consideration by prosecutors for having in place strong compliance programs in exercising prosecutorial discretion. Regular attendance, preparation, and participation in class will be required. The reading materials will be available via the course website. Class participation will count towards 20% of the final grade. There will be a take-home exam at the end of the semester."},
    {"Number":8254,"Title":"Corporate Counsel Externship Seminar","Areas1":"Corporate & Securities Law","Areas2":"Business Law","Areas3":"Clinical & Experiential Education","Description":"The Corporate Counsel Externship Program is a tethered externship. Students with participating placements will be automatically enrolled in Prof. Brian Quinns Corporations class, as well as the Corporate Counsel Externship Seminar. Students enrolled in this program will have the benefit of a doctrinal course focused on corporate law issues, a dedicated faculty member and cohort of fellow students participating in similar placements, and the opportunity to bridge theory with practice. The 1 credit Seminar meets once every other week and is intended to provide students with an opportunity to reflect on their experiences working in the setting of a corporate counsels office."},
    {"Number":7748,"Title":"Corporate Finance","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"This course will explore the legal and basic finance issues associated with the issuance and trading of the various instruments that companies use to finance their activities, including common stock, preferred stock, long- and short-term debt and derivative securities. We will look at the question of when and why these securities are utilized, how they are valued and how they interrelate to each other. The discussions will mix practice with theory and will rely on a combination of case law, statutory law and if history is any guide, the Wall Street Journal. The focus will be on the legal perspective, and although we will consider valuation and other finance topics, it will be in the context of understanding the lawyer's role."},
    {"Number":6824,"Title":"Corporate Governance and Risk","Areas1":"Corporate & Securities Law","Areas2":"Business Law","Areas3":"x","Description":"This course focuses on corporate governance practices in the U.S. and their impact on risk taking by corporations and financial institutions. Students will gain a firm grounding in the principles of corporate governance including the role of state corporate law, securities law, and oversight of the banking system. Topics covered will include the ownership structure of financial firms and professional gatekeepers, executive compensation practices, the role of directors, securities fraud liability, corporate recruitment policies, and shareholder activism. While exploring these topics we will review recent regulatory reforms including the Dodd-Frank Act. The only prerequisite is the basic corporate law course."},
    {"Number":7750,"Title":"Corporations","Areas1":"Corporate & Securities Law","Areas2":"Business Law","Areas3":"x","Description":"This is the basic course in corporation law. It focuses on the governance structure of the corporation and the allocation of power and responsibility among shareholders, directors and officers. Topics covered will include corporate formation, choice of entity, shareholder voting fiduciary duties of officers and directors, insider trading, and the role of the corporation in society."},
    {"Number":3347,"Title":"Criminal Civil Rights Litigation","Areas1":"Civil & Human Rights Law","Areas2":"Criminal Law & Procedure","Areas3":"x","Description":""},
    {"Number":4424,"Title":"Criminal Justice Clinic Class","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"The Criminal Justice Clinic class brings together students enrolled in the BC Defender Program and the BC Law Prosecution Program for a weekly class in which they share their insights and experiences, compare professional roles, and examine the functioning of the criminal justice system and measure it against conceptions of fairness and justice. Students and faculty from both programs participate together in skills training simulations, presentations, field trips, and conversations with experienced criminal justice professionals. In addition to readings and other assignments, students write weekly journals reflecting on and integrating their clinical and classroom experiences."},
    {"Number":2135,"Title":"Criminal Law","Areas1":"Criminal Law & Procedure","Areas2":"","Areas3":"x","Description":"This course examines the elements of crimes, defenses that the accused may assert, and the method and rationales for punishing criminal conduct. Attention is given to the common law of crime as well as to the Model Penal Code."},
    {"Number":9943,"Title":"Criminal Procedure","Areas1":"Criminal Law & Procedure","Areas2":"","Areas3":"x","Description":"This course explores the constitutional rules that govern the range of actions taken by government officials (primarily law enforcement officers) in the course of investigating criminal activity. We will critically examine the way that courts regulate invasive actions 'such as frisks, searches, detentions, arrests, interrogations, and uses of force' through the use of balancing tests that weigh the social benefits of crime prevention and criminal apprehension against the costs of individual liberty and privacy."},
    {"Number":9975,"Title":"Criminal Procedure (Adjudication)","Areas1":"Criminal Law & Procedure","Areas2":"","Areas3":"x","Description":"Through a combination of simulated courtroom presentations and readings, this course covers the law of post-arrest criminal procedure from bail and grand jury proceedings through pre-trial discovery, plea bargaining, jury selection, trial and sentencing. In addition to simulated exercises and feedback, discussion topics will range from Supreme Court cases to policy issues such as the ethics of plea bargaining and the role of race in our criminal justice system. This course provides three credits toward the experiential learning requirement."},
    {"Number":7740,"Title":"Current Topics in Regulatory Reform Seminar/Advanced Administrative Law","Areas1":"Administrative & Government Law","Areas2":"","Areas3":"x","Description":"Environmental Law"},
    {"Number":4455,"Title":"Cyberlaw","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"With the rise of the Internet, we can store and transmit vast amounts of digital data across the globe at little to no cost. This digital revolution raises fundamental questions about how, if at all, existing legal rules should apply online. This course explores the legal and policy issues that arise in cyberspace, including issues of sovereignty and jurisdiction, regulation of online speech, peer-to-peer networking, cybersquatting, and virtual property. It also addresses regulation of the physical architecture of the Internet, including net neutrality. The course examines the broader jurisprudential and policy questions that apply to issues arising on the network, and in the process uses cyberlaw to reexamine the way that law operates in the offline world."},
    {"Number":4466,"Title":"Cybersecurity Policy: Privacy & Legal Requirements","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"Course provides a comprehensive examination of the laws, regulations, and Executive Orders concerning data protection and privacy, including PCI, HIPAA, GLBA, SOX, FISMA, NIST, FISA, CFAA, and their overseas counterparts, and the roles of federal, state, and local regulators and law enforcement officials. The course also examines data protection and national security issues governed by various Federal agencies (e.g., SEC, FTC, FCC, DOE, DOJ, DHS, NSA, Treasury), including suspicious activity reporting (SAR) requirements under the Patriot Act. Additionally, the course addresses intellectual property protection, security classifications, data location requirements, audits, compliancy assessments, and individual, class-action, and shareholder derivative litigation and liability."},
    {"Number":3393,"Title":"Death Penalty","Areas1":"Criminal Law & Procedure","Areas2":"Civil & Human Rights Law","Areas3":"Constitutional Law","Description":"This seminar will examine legal issues surrounding the death penalty in America from a variety of perspectives. After a review of the goals of punishment and their relation to capital punishment, the course will explore: constitutional challenges to the imposition of the death penalty, focusing on claims relating to equal protection, due process and cruel and unusual punishment; race; special offenders, including juveniles, the mentally retarded; modes of punishment and ethical issues; and the impact of international law. A major focus of the course will include the procedural issues in trials for capital offenses, as well as post-conviction proceedings with a particular emphasis on federal habeas litigation. Materials for the seminar will include a collection of essays providing diverse views of the death penalty, as well as central Supreme Court case law in this area. Seminar requirements will include a final paper, a presentation on the paper; and class participation."},
    {"Number":6842,"Title":"Defamation Law and Litigation","Areas1":"Civil Litigation & Procedure","Areas2":"Constitutional Law","Areas3":"x","Description":"This course offers an in-depth study of First Amendment media and defamation law, together with a clinical component designed to develop litigation skills. The seminar will cover such issues as the evolving concept of what constitutes defamation, the public figure doctrine, the opinion defense, confidential sources, burden of proof, Internet and social media, and related issues. Students will draft pleadings in a hypothetical case and take the depositions of the parties, witnesses and an expert. Heavy emphasis will be placed on class participation. In lieu of a final exam, students will be required to prepare a summary judgment memorandum based on both the case law and the discovery information developed during the course, using transcripts of the depositions."},
    {"Number":8207,"Title":"Department of Revenue Tax Externship","Areas1":"Tax Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"An intensive externship experience at the Legal Division of the MA Dept. of Revenue (DOR). Students will handle cases involving state taxation of individuals, corporations, and other entities and related federal issues. The goal is to provide in-depth exposure to the practice of state tax law, including principles of administrative, constitutional, and federal tax law."},
    {"Number":8930,"Title":"Dispute Negotiation","Areas1":"Civil Litigation & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This is an experiential course in which students will be active participants, negotiating cases on a weekly basis. The subject matter of the disputes will include: commercial transactions, gender bias issues, criminal plea bargaining, family law matters, personal injury cases, and other disciplines. Students will be introduced to the art of negotiating, reading body language and micro-messages, interviewing clients and reaching common ground with adversaries. The work will be critiqued as actual student negotiating sessions are taking place, all in an effort to familiarize students with various techniques, strategies, tactics, persuasive skills, and effective demeanor involved in successful negotiations. Although there will be some lectures, the emphasis of the course is 'learn by doing.'"},
    {"Number":4476,"Title":"Domestic Violence and the Law","Areas1":"Family & Estate Law","Areas2":"Criminal Law & Procedure","Areas3":"x","Description":"Courts have increasingly become the forum for responding to issues of domestic violence. This course provides the historical and social context of battering, explains the dynamics of battering relationships and the psychological effects of trauma on battered women and children, discusses civil and criminal law issues arising out of battery, and examines the use of expert testimony as a method of presenting battered women's claims in court."},
    {"Number":8480,"Title":"Domestic Violence Externship","Areas1":"Family & Estate Law","Areas2":"Criminal Law & Procedure","Areas3":"Clinical & Experiential Education","Description":"This externship opportunity provides a placement at Greater Boston Legal Services for students who are enrolled in or have previously taken Domestic Violence & the Law. The externship is limited to 6 students who will extern 12 hours/wk & are required to participate in a separate 1 credit bi-weekly seminar after class. Those who commit to a full year externship will receive preference. Apply through Sage & provide a resume & cover letter explaining interest in the externship. Students, supervised by Prof. Merryman, will represent victims of domestic violence in civil cases & will engage in client-centered legal representation of victims of violence, often representing clients in two or more areas of law (e.g., family & immigration). As economic stability is a key factor in overcoming domestic violence, cases will be those that increase a victim's economic independence (e.g., attaining child & spousal support & equitable property division in Family Court, obtaining secure immigration status through U visa & VAWA self-petitions, and accessing & preserving child-care vouchers, food stamps, health care, & housing). Students will assist clients who are witnesses with ongoing criminal court involvement to understand their rights & options as well as interview & counsel clients, undertake factual investigation through discovery, develop case theories, draft pleadings & motions, negotiate with opposing counsel, interact with courts & administrative agencies, & argue cases in court."},
    {"Number":8804,"Title":"Dynamics of Law, Leadership, and Social Justice: The Public Interest Practitioner as an Agent of Change","Areas1":"Ethics & Professional Responsibility","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This seminar is for those interested in learning through experience about systemic dynamics surrounding leadership, change, and social justice work. Students design a change project & work either in teams or individually (if in a SIP placement). Semester work includes class attendance, exercises, short papers and journals, & culminates in a presentation & final paper. Using their experiences as data and linking experience to theory, students consider how their professional training both assists them in & deters them from achieving social justice goals. Students examine relationships between (and relatedness of) clients & professionals (particularly lawyers) pursuing individual & community goals, systemic barriers to justice, and historical & current efforts by lawyers to partner with communities. Students study their own leadership and group dynamics and link these to larger systemic dynamics that exist in the world. The course is interdisciplinary & open to graduate students in the Law School, Lynch School of Education, the Graduate School of Social Work & others. Attending a group relations conference is strongly encouraged; the working title for the March 2020 BC conference is Intersectionality: Exploring Relatedness and Dividedness in Self and Systems, March 27-29, 2020, Stokes Hall, Boston College (registration fee required). Variable credit offered for attendance at, and reflection paper on, conference experience. Contact Prof. Sarda (sarda@bc.edu) for more information."},
    {"Number":7703,"Title":"Education Law and Public Policy","Areas1":"Administrative & Government Law","Areas2":"","Areas3":"x","Description":"This course addresses the political and legal aspects of the role of education in our democratic society. Provides an introductory survey of public policy issues and laws governing preschool, elementary, secondary, and higher education. Included are such topics as religious freedom, free speech, and due process; the liability of educational institutions and educators; the legal distinctions between private and public institutions; student and parent privacy rights; disability rights; and the promotion of educational equity among all groups regardless of gender, sexual orientation, language, race, religion, ethnicity, or socioeconomic background."},
    {"Number":7645,"Title":"Election Law","Areas1":"Administrative & Government Law","Areas2":"","Areas3":"x","Description":"This course focuses on issues relating to the franchise. The franchise is central to a democratic republic. Voting not only determines who will be in the government, it establishes the legitimacy of any government that flows from accountability to the governed. Thus, a government must establish and protect a franchise that is fairly available and fairly administered. However, this seemingly simple goal masks a wide range of problems. Some examples are redistricting and gerrymandering (both partisan and racial), questions of voter suppression, including voter ID and 'purging' of rolls, campaign finance, and bribery of candidates. The course is given in seminar form for 2 credits. The grading instrument is a paper of 25-30 pages in length. Students work closely with the instructor in developing and researching a topic."},
    {"Number":4430,"Title":"Employee Benefits Law","Areas1":"Labor & Employment Law","Areas2":"Business Law","Areas3":"Health Law","Description":"Retirement plans, health insurance, and other employee benefit plans are central features of the employer-employee relationship in the United States. The legal regulation of such plans is highly relevant for the practice of corporate, labor, tax, trust, domestic relations, and health care law, and is at the forefront of current policy debates about health and retirement security for U.S. workers. The course will survey the main types of health and retirement plans and examine the rules governing coverage, vesting, funding, fiduciary standards, integration with Social Security, claims administration, remedies, and preemption of state law. It will also consider how the decline of traditional pension plans and the recent healthcare reform impact the existing regulatory scheme for employee benefits in both the private and public sectors."},
    {"Number":9918,"Title":"Employment Discrimination","Areas1":"Civil & Human Rights Law","Areas2":"Labor & Employment Law","Areas3":"x","Description":"Employment Discrimination Law will focus primarily on the landmark Title VII of the Civil Rights Act of 1964, forbidding workplace discrimination because of race, color, religion, gender, or national origin. Like most such legislation, the language leaves enormous discretion in the courts to interpret the prohibitions, define the terms like 'discrimination,''because of,' etc., and formulate methods of proof and a remedial structure. We will study cases, work through problems, and explore the policy implications of judicial monitoring of workplace decision-making."},
    {"Number":4403,"Title":"Employment Law","Areas1":"Labor & Employment Law","Areas2":"","Areas3":"x","Description":"This course addresses the legal regulation of employment of those without any form of collective representation, including executives, hourly and contingent employees. It addresses three major areas: (1) The common law regulation of the employment relationship. This includes formation of the employment relationship; common law exceptions to the at-will rule; privacy and dignitary protections (including electronic media); trade secrets and other intellectual property concerns; restrictions on competition; the use of arbitration as a means to avoid jurisdiction of common law courts. (2) The second area covered is federal regulation of wages and hours pursuant to the terms of the Fair Labor Standards Act (an area of substantial growth and litigation). (3) The law under the Occupational Safety and Health Act. This is a dynamic and controversial area of the law. Consideration of current developments and trends, economic and social, as well as comparative legal approaches, are included."},
    {"Number":4474,"Title":"Energy Law and Deregulation","Areas1":"Environmental Law","Areas2":"Administrative & Government Law","Areas3":"x","Description":"This survey course focuses on the law and public policy of electricity and natural gas, with discussion of both market and environmental regulation. The course will examine the frequent tensions between economic and environmental regulation. There will also be analysis of the Constitutional law applicable to the energy industries, including Commerce Clause and Supremacy Clause limitations upon state energy policies. Class time will also involve review of ongoing political and industry developments. There will be particular focus upon the development and financing of renewable energy resources."},
    {"Number":7789,"Title":"Entertainment Law","Areas1":"Business Law","Areas2":"Intellectual Property & Technology Law","Areas3":"x","Description":"Most entertainment law practitioners agree 'Entertainment Law' has no set definition, but includes a hybrid of distinct areas of the law, including but not limited to, copyright, trademark, contracts, wills, estate planning, real estate, bankruptcy and intellectual property. Course focuses on the protection of IP and the contractual relationships between various parties in the Entertainment and Music Industry. A major focus will be analysis of the Copyright Act of 1976, as amended, the Digital Millennium Copyright Act, and the protection of IP and contractual rights in TV, film, music, books, etc. The relationship between the artist and his/her manager, agent, lawyer, and record company will be explored in great detail. Course will cover representation of artists and music labels and the problems they encounter. Students will participate in a group exercise where they negotiate a record deal on behalf of either the artist or the record label, and report back their terms to instructors."},
    {"Number":8339,"Title":"Entrepreneurship and Innovation Clinic","Areas1":"Business Law","Areas2":"Intellectual Property & Technology Law","Areas3":"x","Description":"The Entrepreneurship & Innovation Clinic ('EIC') is a dynamic clinic that provides free transactional legal services to under-resourced clients in the Greater Boston area on issues relating to new and emerging businesses. This innovative clinic provides students with the hands-on, practical experience needed to navigate the rapidly evolving fields of intellectual property and entrepreneurship. Law students working under the supervision of the clinic director provide a broad range of business law, intellectual property, and transactional services. Clients include micro-entrepreneurs, technology entrepreneurs, social entrepreneurs, artists, authors, filmmakers and musicians, who may be individuals or for-profit businesses in the Greater Boston area who are in need of transactional legal counsel related to starting or operating their business. The EIC is for students interested in learning to work with organizational clients and learning to represent clients in transactions."},
    {"Number":6609,"Title":"Environmental Corporate Lawyering:Regulatory Compliance","Areas1":"Environmental Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":""},
    {"Number":9969,"Title":"Environmental Law","Areas1":"Administrative & Government Law","Areas2":"Environmental Law","Areas3":"Real Estate Law","Description":"The basic course in environmental law, studying a broad range of environmental cases--from pollution and nuclear issues to parks and wetlands--and focusing upon the legal doctrines, public and private law structures, and litigation techniques that apply to environmental protection controversies. This course studies the ways in which legal rules and procedures have been drawn from every corner of the legal system from tort and constitutional law to statutory and international law to handle environmental challenges of private and public actions. The course also serves as a case study in the implementation of public policy through litigation skills and legislative process."},
    {"Number":3322,"Title":"Environmental Law Seminar (Advanced)","Areas1":"Environmental Law","Areas2":"","Areas3":"x","Description":"This seminar uses an innovative format: the seminar addresses, and?week-by-week, chapter-by-chapter?analyzes draft chapters of a particular book-in-progress chosen at the start of the semester by seminar members from a list of books-in-progress nominated by law professors around the nation who ask for our confidential help in shaping their work. Books are typically proposed for selection in a wide range of land and environment subject areas. We work with the author on the book throughout the Spring semester; members of the seminar prepare weekly chapter commentaries and a final individual paper summarizing their analyses of the book. (Individual research project papers, which in previous years were part of the seminar, now are available separately via Independent Study.) Two or three credits, variable."},
    {"Number":4450,"Title":"Environmental Law, Advanced: Teaching Seminar","Areas1":"Environmental Law","Areas2":"","Areas3":"x","Description":"A seminar providing law students the opportunity to teach a University course in Environmental Law to graduate and undergraduate non-law students. Enrollment limited to eight law students selected from three area law schools -- BC, BU, and Harvard. Teachers are given Boston College faculty status [but unsalaried!]. With the professor?s advisory participation, two-person teams of law students teach a Spring semester course in Environmental Law and legal process, each team?s class enrollment comprising fifteen to thirty-five students from a wide variety of majors. A weekly law school seminar in the Spring semester coordinates the research and teaching preparation. (Six preparatory sessions are required during the Fall semester.) 3 pass-fail credits, awarded in Spring semester; plus option for 1 graded credit in Fall or Spring semester."},
    {"Number":3339,"Title":"Environmental Law: Clean Water Act","Areas1":"Environmental Law","Areas2":"Administrative & Government Law","Areas3":"x","Description":"Given recent Supreme Court decisions, the law of clean water may well be the bellwether for the future of all federal environmental protection. This course is important to students interested in gaining experience in working with statutes, regulatory requirements, land use issues and working for or against governmental agencies. The course will cover the history, development, and implementation of the federal Clean Water Act, related provisions, policies and case law and state analogues. It will go beyond classic waste water treatment permitting and enforcement issues to include wetlands, oceanic and overall ecosystem considerations. The course work will include in-class exercises in practical regulatory analysis and client advice, much as would be expected of an associate in a law firm or a staff attorney in an administrative or enforcement agency. Grades will be based upon a final take home exam and class participation."},
    {"Number":8118,"Title":"Environmental Legal Research","Areas1":"Environmental Law","Areas2":"Administrative & Government Law","Areas3":"x","Description":"This course is designed as an in-depth look at the legal resources and research techniques used in the practice of environmental law. Strong emphasis on administrative law and the rulemaking process, legislative history, and government documents. Course will also review basic case law and statutory research. Students are exposed to strategies for using these materials competently, effectively, and economically in the research process to enable them to develop research skills necessary to be a successful environmental lawyer. Ungraded exercises allow students to track their progress in learning the materials. Class is completed in the first two-thirds of the semester so that students are able to apply knowledge gained in this class to more easily and effectively research papers for other classes and to journal work."},
    {"Number":9993,"Title":"Estate and Gift Tax","Areas1":"Tax Law","Areas2":"Family & Estate Law","Areas3":"x","Description":"Estate and Gift Tax considers the federal estate, gift and generation skipping tax provisions as they apply to transfers during life and at death. There are no prerequisites for this course, although students interested in practicing in the trusts and estates area are encouraged to also take Tax I. It is required of any student wishing to take Estate Planning. The course is taught using the Socratic and problem method and class participation is expected and encouraged."},
    {"Number":7743,"Title":"Estate Planning","Areas1":"Family & Estate Law","Areas2":"Tax Law","Areas3":"x","Description":"This course provides a practical approach to estate planning, the process by which lawyers work with their clients to provide for the transfer property during life and upon death. Estate planning involves wills as well as trusts to provide for the care of minor children, establish charitable bequests and obtain favorable tax treatment. It also involves planning for succession of businesses and planning for retirement benefits and life insurance. We will be focusing on practical estate planning techniques as well as how an estate planner prepares documents to create a complete estate plan. Estate and Gift Tax is recommended; however, students can also take course with permission of the professor."},
    {"Number":4439,"Title":"European Union Law","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"This course provides a general overview of the legal architecture of the European Union. It introduces students to the complex relationship between the European legal order and the national legal systems of Member States. Students will study the Union's major institutions and decision-making mechanisms as well as substantive legal matters that include fundamental rights, free movement of persons and goods, non-discrimination. This course is a prerequisite for participation in the SIP Dublin but is open to any student interested in the present and future of Europe."},
    {"Number":9996,"Title":"Evidence","Areas1":"Civil Litigation & Procedure","Areas2":"Criminal Law & Procedure","Areas3":"x","Description":"Evidence is the study of the methods by which litigants prove facts at trial. This course emphasizes the Federal Rules of Evidence and the common law from which those rules were developed. After examining the concept of relevance, the basic requirement for the admissibility of evidence, the course covers more complex topics such as hearsay, character evidence, impeachment, expert and lay opinion, and authentication of exhibits."},
    {"Number":9735,"Title":"Faith, Morality & Law","Areas1":"Legal History & Jurisprudence","Areas2":"Ethics & Professional Responsibility","Areas3":"x","Description":"Looks at the relationship between faith, morality, and law at key points in the Christian tradition and in relationship to contemporary issues. Section One examines the relationship between moral law and Christian life by looking at key passages from the New Testament in their historical context and classic Protestant and Catholic views of the subject. Section Two considers the relationship of law and morality in a pluralistic society. Section Three looks at responsibilities of Christians who find themselves in an unjust legal system. We will consider the possibilities and limits of civil disobedience and the call to martyrdom."},
    {"Number":7747,"Title":"Family Law","Areas1":"Family & Estate Law","Areas2":"","Areas3":"x","Description":"The practice of family law applies rights and duties to people who are in relationship to one another, either through love, obligation, or blood. Social norms, customs, and practices are constantly reimagining how and with whom these relationships are formed. This course looks at historical and contemporary ways by which families are formed, maintained, dissolved, and defined by law. The course in particular provides an overview of marriage, divorce, child custody, parental rights, and adoption."},
    {"Number":9980,"Title":"Family Law Seminar","Areas1":"Family & Estate Law","Areas2":"","Areas3":"x","Description":"This research seminar is devoted to writing a paper on a current issue in family law. For 2013-14 the issues will pertain to Parenthood. Under discussion will be issues pertaining to paternity, child custody in divorce, adoption and assisted reproductive technologies."},
    {"Number":7792,"Title":"Federal Courts","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"The Constitution assures that the separate powers conferred upon each of the branches of the federal government serve as a check and balance to prevent abuse of power by any single branch, and that the aggregate of federal power, while supreme, is limited in scope, thereby serving to bind the union and simultaneously respect state sovereignty. This course will explore these two themes as they relate to the role of federal courts. Among the topics to be covered: separation of powers, federalism, congressional power to curtail federal jurisdiction, the case and controversy requirements as it relates to doctrines of standing, ripeness, and mootness, sovereign immunity, Congressional power to abrogate Eleventh Amendment immunity, Ex Parte Young doctrine, section 1983 litigation, absolute and qualified immunity in suits against state and federal officers, abstention doctrines, inter-system preclusion, and Rooker-Feldman doctrine. Evaluation will be by an in-class exam."},
    {"Number":7654,"Title":"Federal Health Reform: Law, Policy, and Politics","Areas1":"Health Law","Areas2":"","Areas3":"x","Description":"This course will evaluate; the reasons for the US health care system's high costs & poor outcomes; the Affordable Care Act's methods, successes & failures in expanding access to, & improving the quality & cost of health care; judicial & legislative challenges to the ACA's individual & employer mandates, Medicaid expansion, subsidized coverage & mandated benefits (including no-cost contraceptives); GOP efforts to repair, repeal or replace the ACA; & emerging challenges to the Trump Administration's use of executive orders, suspension of notice and comment rulemaking & incremental legislation to destabilize the ACA & change access to health care and coverage. We will also examine two of the nation's most urgent public health crises; gun violence & the opiod epidemic. Both increase mortality, morbidity & costs. Both illustrate the adverse impact of inconsistent laws & policies for individuals, health care providers, private industry and lobbyists, and state & fed. government. Both demonstrate the increasing importance of litigation in seeking redress for the unsustainable costs & unbearable health burdens that federal policies have shifted to states, municipalities & individuals. Both underscore the importance of law in promoting and impeding public & personal health. The course is NOT intended to instill a particular point of view but only to enable your own views, criticisms and disagreements to be informed by reality, not myth. No need for an interest in practicing health law"},
    {"Number":4400,"Title":"Feminist Legal Theory","Areas1":"Legal History & Jurisprudence","Areas2":"Civil & Human Rights Law","Areas3":"Constitutional Law","Description":"Since the late twentieth century, women have lent their own distinctive voice to the discussion of jurisprudence and to a number of substantive topics concerning sex, gender, and the law. In this seminar we will explore some of the issues that feminist scholars have raised. The seminar will begin with a historical orientation to feminist legal theory. It will then consider particular areas of law where feminist insight has been particularly strong, such as: (1) Gender equality and the constitution; and (2) Violence against women. Finally, we will consider some more theoretical issues. What is the relationship between feminist theory and other forms of critical theory that have been developed by oppressed groups? What are the problems of essentialism: Does it make sense to speak of 'women's' experience, a 'women's' viewpoint; or even of 'feminist' jurisprudence as a project that represents the interests of 'women in general'?"},
    {"Number":6267,"Title":"Fiduciary Law","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"Ethics & Professional Responsibility; Labor & Employment Law","Description":"Fiduciary obligations arise in a multitude of private relationships, including business organizations, agency, guardianships, trusts, and professional relationships of various kinds. This seminar will consider fiduciary law as a distinctive legal category and explore fiduciary principles across a wide range of legal subjects. Through the study of statutory and common law fiduciaries ? including trustees, corporate directors and officers, partners, agents, lawyers, physicians, money managers and advisers ? the seminar will explore why fiduciary duties arise and how obligations and remedies vary for different types of fiduciaries. The seminar will also assess the use of fiduciary law in financial regulation, and the challenges of fiduciary governance in a global business environment. Finally, the seminar will consider how fiduciary principles might be applied to public officials and public institutions."},
    {"Number":4431,"Title":"Foreign Relations of the U.S.","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"This course addresses the conduct of foreign relations by the United States with specific reference to domestic legal constraints, such as statutes and the Constitution. The course treats (1) the separation of powers between the Congress and the Executive in foreign affairs, specifically with respect to the war power; (2) the treaty power and the domestic law of treaties and other international agreements; and (3) the role of the judiciary, including the immunity of foreign states ('sovereign immunity'), the 'act of state' doctrine, jurisdiction to prescribe and enforce law outside the borders of the United States, and international aw in U.S. courts. The course has a particular emphasis on post-9/11 developments in the law as a result of the war on terror. There are no prerequisites and minimal overlap in subject matter with International Law, together with which this course may, but need not necessarily, be taken to form a year-long sequence."},
    {"Number":6660,"Title":"Foundations of Western Law","Areas1":"Legal History & Jurisprudence","Areas2":"","Areas3":"x","Description":"This seminar will place students into a conversation with some of the key thinkers who have shaped our modern Western legal traditions. In addition to Plato and Aristotle, the readings will be drawn from seventeenth, eighteenth, and nineteenth century English, French, and German political philosophers. Themes include: how these authors influenced common and civil law systems; the relation among religion, law, and morality and the problem of human knowing; the concepts of 'law,' 'reason,' 'human nature,' and the foundations of rights theory; the shift from the good to legitimacy; the rise of individualism and the problem of community."},
    {"Number":7078,"Title":"Global Citizenship: Interdisciplinary Seminar","Areas1":"International & Comparative Law","Areas2":"Civil & Human Rights Law","Areas3":"x","Description":"Todays world is a maelstrom of cultures, languages, races, issues, perspectives, hopes, and challenges. In this course, we will look at some burning issues of our time: e.g., poverty, ecology, migration, refugees. This exploration will be achieved in an interdisciplinary manner by combining the cross-perspectives of social work, law, and theology. Special attention will be given to 'agent' - the person called to face world issues through the existential notion of mission, values, and purpose/vocation. Consideration will be given to the situation of Haiti, where the whole class will travel over the winter break for a field trip."},
    {"Number":6611,"Title":"Global Justice and Human Rights","Areas1":"International & Comparative Law","Areas2":"Civil & Human Rights Law","Areas3":"x","Description":"This course will study the history of the idea of global justice from its early inception in Stoic law to its formulation in social contract theory in Hobbes and Locke, through Kant's idea of cosmopolitan justice, and on to its contemporary reconstruction in John Rawls, David Held, Jurgen Habermas, and Thomas Pogge. In the context of examining the status of global justice we will consider the problem of world poverty and how human rights can be defended in a global context with the ever-increasing problems associated with homelessness on a world scale."},
    {"Number":3394,"Title":"Global Risks and Regulations","Areas1":"International & Comparative Law","Areas2":"Administrative & Government Law","Areas3":"x","Description":"This course introduces participants to some of the most important areas of twenty-first century global risk and their respective regulatory frameworks: Health, Energy, Environment, Order, Economy, and Information. Students become acquainted with each of these risk areas before analyzing their current regulation. Students then learn about how the evolution of law catalyzes and structures social change. In the last part of the course, students convene as a think-tank to produce short white papers on the risk area of their choice, on which their course grade is based. The course does not assume knowledge of science or policy-making. Students and auditors from across the university and beyond are welcome to fully participate in the course. No pre- or corequisites. The course meets the Law School's Perspectives Requirement."},
    {"Number":3395,"Title":"Globalization, Law & Legal Practice","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"An interdisciplinary introduction to globalization and its effects on law and legal practice. Draws from diverse areas of international and comparative law supplemented by material from philosophy, sociology, economics, and political science. Questions considered include the nature of globalization itself and its effects on legal actors such as states, individuals and international organizations; global social policy; the global economy; the legitimacy of global institutions; global justice; and the changing nature of legal education and legal practice, among others."},
    {"Number":7769,"Title":"Health Law","Areas1":"Health Law","Areas2":"","Areas3":"x","Description":"This course will introduce students to patient care issues within the context of the U.S. health care delivery system. The course will cover both legal and policy aspects of: (1) Cost, quality, access, and health care delivery in the U.S.; (2) Medical liability and the provider/patient relationship; (3) Regulation of private health insurance and the impact of health reform; (4) Selected current issues in bioethics."},
    {"Number":7652,"Title":"Healthcare Law and Compliance","Areas1":"Health Law","Areas2":"","Areas3":"x","Description":"Healthcare Law and Compliance offers the student with a personal or professional interest in the healthcare industry and/or criminal law the opportunity to develop a basic understanding of the legal framework and ethical issues involved in today's healthcare environment. The seminar (2-credit hour once weekly) will use a practical, case-study approach to some of the issues arising in the complex world of healthcare enforcement and compliance. Emphasizing the procedural mechanisms of the False Claims Act and the substantive law of the Anti-Kickback Act, the Stark Laws, the Food and Cosmetic Act, the seminar will explore the following: how prosecutors, defense attorneys, whistleblowers, and compliance officers approach their work; the relationships between regulated industries (pharmaceuticals; hospitals; doctors; medical device companies) and government insurance companies (Medicare; Medicaid); legal and ethical issues arising from the expanding edges of healthcare technology and treatment."},
    {"Number":7862,"Title":"Human Rights and Inequality","Areas1":"Civil & Human Rights Law","Areas2":"International & Comparative Law","Areas3":"x","Description":"The law of human rights is global and rests on a vast array of international human rights conventions, customary international law, and borrowed, transplanted, or migrating constitutional or statutory fundamental rights. These two avenues--the international and the domestic--are together examined in this course, using recently advanced techniques of comparative law. Our focus is on how the law of human rights conceives of, and addresses, the problem of inequality. In particular, we will study one set of human rights--the so-called 'economic and social rights'--which include the rights to food, housing, health care, education, and water and sanitation. Of immediate interest to the American law student with a global, transnational, or comparative outlook, or to others interested in the changing idea-base of human rights law, law and political economy, law and equality, and law and social change, the course will emphasize the International Covenant on Economic, Social and Cultural Rights and its Optional Protocol, comparative legal developments in South Africa, Colombia, and India, and where and how the United States contributes to this rapidly developing field of law."},
    {"Number":7461,"Title":"Human Rights Interdisciplinary Seminar","Areas1":"International & Comparative Law","Areas2":"Civil & Human Rights Law","Areas3":"Legal History & Jurisprudence","Description":"The study of human rights defies disciplinary boundaries. This seminar, sponsored by the Center for Human Rights and International Justice (CHRIJ), provides a rare space to examine human rights from an interdisciplinary perspective. The seminar brings together faculty affiliated with the Center, students from across the university, visiting scholars, and guest speakers to examine issues of human rights and international justice. The Spring 2019 seminar will begin with an overview and brief historical review of human rights instruments and then explore a series of complexities for those seeking to engage in human rights scholarship, advocacy, and activism. We seek to engage critically with human rights discourse and actions as they intersect with gender, culture/ethnicity, race, class, and other categorizations. More details on the 2019 seminar at http://www.bc.edu/bc-web/centers/chrij/academics/seminar.html."},
    {"Number":7793,"Title":"Immigration Clinic","Areas1":"Immigration Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Students represent non-citizens in their applications for legal status, which involves interviewing, evaluating whether the client is eligible for such status, preparing the application, drafting affidavits of the client and supporting witnesses, gathering documents in support of the application, and representing the client at the interview. Students represent non-citizens in removal proceedings before the Immigration Court, which involves arguing bond motions, conducting direct examination of witnesses, raising evidentiary objections, and arguing points of law. Cases include asylum, waivers of deportation, adjustment of status, visas for victims of violent crimes, relief for noncitizen victims of domestic violence, and visas for juveniles who have been abused, abandoned or neglected. Students conduct 'Know Your Rights' presentations for communities in the Boston area and for detained noncitizens."},
    {"Number":9953,"Title":"Immigration Externship Seminar","Areas1":"Immigration Law","Areas2":"","Areas3":"x","Description":"This is the seminar component to the Immigration Law Externship. Students will be supervised by pro bono attorneys. Weekly attendance and journals are required."},
    {"Number":7749,"Title":"Immigration Law","Areas1":"Immigration Law","Areas2":"","Areas3":"x","Description":"U.S. immigration law involves such technical questions as how to obtain a visa, a 'green card,' citizenship and who is subject to deportation. It is also 'a magic mirror' in which the highest aspirations and the deepest biases of American legal culture and history are reflected. This course explores both aspects of this complex area of law: the technical/legal and the political/philosophical. It involves constitutional law, administrative law, statutory interpretation, among other disciplines. There are traditional lectures, class discussions, in-class exercises, outside speakers, films, and court visits. The three-credit course requires class attendance, participation, and a final exam. More detailed information will be available in the first class. It is a pre- or co-requisite for the Immigration Clinic."},
    {"Number":8313,"Title":"Immigration Law Clinic","Areas1":"Immigration Law","Areas2":"Civil & Human Rights Law","Areas3":"Clinical & Experiential Education","Description":"Students in the Immigration Clinic represent noncitizens in removal proceedings before the Immigration Court, which involves arguing bond motions for detained clients, conducting examination of witnesses, raising evidentiary objections, and arguing points of law. Students represent noncitizens in applications for legal status before the U.S. Citizenship and Immigration Services (CIS) office. Cases vary, but may include asylum and relief based on fear of persecution in the country of removal, waivers of deportation for long-term residents of the U.S., adjustment of status for noncitizens with U.S. citizen or permanent resident family members, visas for victims of violent crimes who have assisted in the prosecution of such crime, relief for noncitizen victims of domestic violence, and visas for juveniles who have been abused, abandoned, or neglected. Students conduct 'Know Your Rights' presentations for noncitizens who are detained by the Immigration and Customs Enforcement (ICE)."},
    {"Number":8318,"Title":"Immigration Law Externship","Areas1":"Immigration Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This externship, co-sponsored by the Boston College Center for Human Rights and International Justice, is connected to Professor Kanstroom?s Immigration Law class as a co-requisite. Students who are in that class may register for an additional 2 or 3 credits (Pass/Fail) to work on asylum, withholding of removal, Convention Against Torture or human trafficking [T Visa] cases. Students will be assigned to work with pro bono attorneys who have taken on such cases through the PAIR Project https://www.pairproject.org/ or other similar organizations.Students will meet with clients, and undertake factual and legal investigation, research and writing, etc. They will be supervised by the pro bono attorneys, by Attorney Heather Friedman and Professor Kanstroom. Requirements: 4 hours of case-related work per credit, journals, and attendance at a weekly seminar. To apply, email Tricia Gould, Director of Externship Programs, patricia.gould@bc.edu."},
    {"Number":8119,"Title":"Immigration Law Guided Research","Areas1":"Immigration Law","Areas2":"","Areas3":"x","Description":"Immigration Law Research is a two-credit optional companion course to Immigration Law. The course will teach students how to research complex immigration law issues, using specialized secondary sources, administrative agency decisions and regulations, federal constitutional law, statutes, and case law. Students will learn strategies and resources by completing pragmatic research problems. Research techniques and sources will track the course content of Immigration Law. Students will receive an introduction to international and foreign law resources used in immigration law. Weekly ungraded exercises allow students to track their progress in learning the material. Grade will be based upon class participation, two graded assignments and a final, open book, take-home examination."},
    {"Number":8045,"Title":"Immigration Practice","Areas1":"Immigration Law","Areas2":"Civil & Human Rights Law","Areas3":"x","Description":"Immigration Practice focuses on the practice of immigration law and in particular the intersection of criminal and immigration law. Students will advocate for hypothetical clients whose cases deal with cutting-edge issues of bond, the intersection of immigration law and crimes, and discretion. In-class hearings include client interview, client counseling, a bond hearing, and a portion of a removal defense case."},
    {"Number":8412,"Title":"In House Externship Seminar","Areas1":"Business Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This seminar is for students who are externing with an in-house legal department and will cover various topics such as: the role of in-house counsel, working with outside counsel, identifying ethical issues when representing an organization, intellectual property & privacy concerns, communication strategies when engaging and working with business teams and other departments throughout the company or organization, etc. The faculty member will work with students to develop personal learning goals that include concrete strategies the students will use to achieve each goal and how they will measure their progress. The seminar is designed to be practical, reflective and interactive. Students will be encouraged to discuss and the faculty member will advise on common workplace challenges such as managing their time, structuring legal research for business settings, communicating with supervisors, collaborating on work assignments, and learning appropriate workplace etiquette.The seminar meets every other week throughout the semester. It is a one credit class. Students will be required to complete assigned reading, submit journal entries, and participate in class discussions."},
    {"Number":2184,"Title":"Inequality","Areas1":"Constitutional Law","Areas2":"Civil & Human Rights Law","Areas3":"x","Description":"The relationship between law in the United States and inequality is tortured. On the one hand, we are committed to agreement with Jefferson in the Declaration of Independence and Lincoln at Gettysburg that our national character is founded on the principle that "},
    {"Number":4435,"Title":"Insurance Law","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"Health Law"},
    {"Number":8120,"Title":"Insurance Law Research","Areas1":"Civil Litigation & Procedure","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"This course is designed as an in-depth look at legal research techniques and resources used by lawyers in the insurance field and civil litigation attorneys. Course will cover sources of insurance law and insurance obligations, including contracts, common law doctrines, statutes and regulations. Course will also cover secondary sources, research tools and organizations for both insurance specialists and trial attorneys. Both print and electronic sources will be explored and utilized."},
    {"Number":6694,"Title":"Intellectual Property Licensing and Technology Transfer","Areas1":"Intellectual Property & Technology Law","Areas2":"Business Law","Areas3":"x","Description":"Licensing of intellectual property assets has become a multi-billion dollar business annually, and many of the largest technology companies derive a significant portion of their revenue from licensing income. This course will provide an introduction to the licensing of intellectual property and negotiation of related agreements. Topics covered will include IP fundamentals, the foundations of IP licensing, licensing strategies, drafting, negotiation, and enforcement. The course will include a mix of lecture and interactive workshops. No prior experience with intellectual property is strictly required, although students are strongly encouraged to take one or more IP courses either prior to enrolling or concurrently with the class. A technical background is not required."},
    {"Number":8127,"Title":"Intellectual Property Research","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"This course is designed as an in-depth look at the legal resources and research techniques used in the practice of intellectual property law. Course will cover basic legal research techniques involving the U.S. Constitution, statutes, cases, and regulations and how they relate to IP practice. IP specific research tools and techniques involved in patent and trademark practices will also be included. Students are exposed to practical techniques and strategies for using these materials competently, effectively, and economically in the research process to enable them to develop research skills necessary to be a successful lawyer in an IP practice. Grade will be based on class participation, effort on ungraded research exercises and performance on graded research exercises."},
    {"Number":4412,"Title":"Intellectual Property Survey","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"This survey course emphasizes federal copyright, trademark, and patent law and related state trade secret, rights of publicity, and unfair competition law. It is meant to provide students with a general working knowledge of the various intellectual property doctrines, and an understanding of how the individual intellectual property doctrines compare, contrast, and may be used to complement one another. This course is appropriate for the generalist who wants to understand and be able to analyze IP issues, which are ubiquitous in the modern practice of law. It is also appropriate as the first introductory course for students interested in taking a number of IP courses."},
    {"Number":4451,"Title":"International Arbitration","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"The old maxim 'where business goes, disputes soon follow' has renewed vitality in an age of globalization. As cross-border commerce follows American business abroad, and offshore foreign investment flows into the U.S., the potential for clashes in the business expectations of the parties increases. Commercial dispute resolution thus becomes an almost inescapable component of today's private international business experience. Course covers the management of the international commercial dispute process, from inception in the contractual drafting through the mechanics of the dispute resolution process to the enforcement stage. Focus of the course will be on international arbitration, with some consideration of alternative dispute resolution techniques. Original case studies and related materials are largely drawn from actual practice. Course is designed for prospective corporate attorneys as well as litigators. Optional paper of 20 pages is available to provide a third credit."},
    {"Number":7752,"Title":"International Aspects of U.S. Income Taxation","Areas1":"International & Comparative Law","Areas2":"Tax Law","Areas3":"Business Law","Description":"This course provides an introductory examination of the basic rules and policies bearing upon the taxation of international transactions. The course will cover the major U.S. income tax rules governing the taxation of foreign persons (including corporations) investing and doing business in the United States (inbound transactions) and the taxation of U.S. persons (including corporations) investing and doing business abroad (outbound transactions). The goal of the course is to provide an overview of the structure, issues, and rules pertaining to the U.S. taxation of cross border transactions. The major issues examined include jurisdiction to tax, treaties, source of income, mechanisms for reducing or preventing double taxation of income, transfer pricing, and regimes that prevent deferral of U.S. income tax on certain types of income."},
    {"Number":4488,"Title":"International Business Transactions","Areas1":"Business Law","Areas2":"International & Comparative Law","Areas3":"Corporate & Securities Law","Description":"This is a course on the globalization of private economic relationships and the global regulation of such activity. In particular, the course will focus on identifying and solving the legal problems affecting cross-border transactions in a global regulatory environment. Students will become familiar with the nature of globalization and the global economy; fundamental patterns of business activity across national boundaries; the international legal framework for regulating such activity; and the unique issues raised by sales of goods, licensing, foreign investment, and dispute resolution. Private and public law aspects of international business transactions will be examined, including conflicts of law, foreign law, and select issues in WTO, NAFTA, and EU law."},
    {"Number":6676,"Title":"International Environmental Law","Areas1":"International & Comparative Law","Areas2":"Environmental Law","Areas3":"Administrative & Government Law","Description":"This course addresses the nature, content, and structure of international environmental law. The course commences with an introduction to international environmental problems, together with basic principles of international law and environmental regulation. Specific topics include global warming, stratospheric ozone depletion, and exports of hazardous substances. Other topics may include marine pollution, transboundary pollution, trade and environment, and development and environment. The course evaluates the role of international and non-governmental organizations; the interrelationship between international legal process and domestic law; and the negotiation, conclusion, and implementation of international environmental agreements. Class meets at the Fletcher School, Graduate School of International Affairs, Tufts University."},
    {"Number":4436,"Title":"International Human Rights","Areas1":"Civil & Human Rights Law","Areas2":"International & Comparative Law","Areas3":"x","Description":"An introduction to international human rights law. We will explore: the philosophical and historical origins of the general Western idea of human rights and how that idea differs both from non-Western conceptions; the customary international law, treaties, instruments, etc. that create and protect human rights; economic and social rights; rights against racial, ethnic, religious, and gender discrimination; rights to self-determination; etc.; the institutions that monitor and enforce human rights law, including in particular regional systems such as that of Europe; the relationship between international human rights law and humanitarian laws of war, the prosecution of international war crimes, and U.S. law with particular focus on torture, anti-terrorism law, and the problems arising from Guantanamo and other U.S. government actions. All of these issues and more will be examined through close study of actual cases, films, videos, and through in-class simulations and projects."},
    {"Number":7785,"Title":"International Law","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"This course is designed to familiarize students with the operation and institutional structure of the international legal system, the law of nations that govern relations among states. The first portion of the course, consisting of somewhat more than half of the semester, will address the principal attributes of the international legal system, including (1) sources of international law; (2) subjects of international law; (3) jurisdiction of states; (4) international adjudication and dispute settlement; and (5) the law of treaties. The remainder of the course, as time permits, will be devoted to special topics, including such subject matter as the law of the sea; the international law of human rights; the use of force in international law; and diplomatic and consular immunity."},
    {"Number":5253,"Title":"International Law of Food","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"This course, one of the few if not the only in the world to address this critical subject matter, identifies and analyzes contemporary international legal and policy issues related to food including supply, safety, security, subsidies, and trade. Students will master legal and structural analytical tools for addressing these increasingly important challenges of concern to all global citizens, including in particular undergraduates potentially interested in attending law school seeking an introduction to legal method. Field trips include visits to the European Food Safety Authority and the UN Food and Agriculture Organization in Rome. The course stresses the development of skills to enable students effectively to grapple with new and emerging issues in this ever-changing and expanding field."},
    {"Number":8765,"Title":"International Legal Research","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"International Legal Research aims to provide students with in-depth and hands-on experience with the general process and sources of international and foreign legal research. Students will learn to use a variety of specialized legal research tools, both online and in print, to locate and evaluate the major sources of public international law, i.e., treaties, customary international law, and general principles of law. Decisions of international courts and tribunals, and official documents of international organizations (United Nations, European Union, WTO, etc.) will also be examined. The course will also cover special topics in international law, e.g., private international law, international human rights, international trade law and commercial arbitration. Grades will be based on 3 take-home assignments. Recommended for students interested in international legal practice, members of the Jessup Moot Court team, and the staff of the BC ICLR."},
    {"Number":6696,"Title":"International Trade and Investment Law","Areas1":"International & Comparative Law","Areas2":"","Areas3":"x","Description":"This is an integrated and comprehensive course on the law, theory and policy of international trade and foreign investment law, which together comprise international economic law (IEL). The course will introduce students to the treaty-based WTO international economic law system, its principal agreements and institutions, its core doctrines, and some of its current policy questions. The course will also introduce students to the law of foreign investment, key doctrines, and the contemporary BIT system. The course will conclude with an examination of current issues and challenges, such as IEL dispute settlement, IEL and development, IEL and the environment, and IEL and human rights."},
    {"Number":8553,"Title":"Introduction to Appellate Judging","Areas1":"Civil Litigation & Procedure","Areas2":"Criminal Law & Procedure","Areas3":"x","Description":"This course will provide students with a 'view from the bench' by providing the opportunity to assume the role of an appellate judge in oral argument. At each class, on a rotating basis, two students will present oral argument on opposing sides of a legal issue, seeking affirmance or reversal of decisions rendered in recent state and federal cases. The legal issues will generally be taken from first year/first semester required course subjects or involve principles of statutory construction. Students not scheduled for an argument on a particular day will perform the role of an appeals court panel, probe the strengths and weaknesses of each presenting attorney, and deliver a ruling."},
    {"Number":8140,"Title":"Introduction to Civil Litigation Practice","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"This course provides an introduction to civil litigation practice, with emphasis on the word 'practice.' The 1Ls enrolled will bring a basic knowledge of Civil Procedure, plus lifetime perceptions of how civil litigation is conducted, and a personal sense of morals and ethics. The course will provide an understanding of skills involved in litigating a civil case through the stages preceding trial, with an emphasis on the interrelationship of those skills with the litigator's professional responsibilities to clients, colleagues, opponents, judges and others. In addition to discussions and guest presentations by experienced litigators, students will perform litigation skills--client interviews, negotiations, depositions, and courtroom advocacy--based on a hypothetical factual scenario. The combination of teaching techniques will provide insight into the real world of civil litigation while fostering skills that are important for all practitioners to master, whatever field they choose to enter."},
    {"Number":8914,"Title":"Introduction to Consumer Rights Litigation Practice","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"Sometimes mortgage loan servicers harass borrowers by trying to collect monies that are simply not owed. This happens more times than you might think, but many times a borrower will submit to paying the extra money or even give up the home instead of fighting a large national loan servicer. In this simulation course you will use consumer protection laws to make them stop their wrongdoing and pay damages to a client who is being harassed by a mortgage loan servicer. You will engage in many simulated demonstrations including (1) counseling the client; (2) deposing the servicer's corporate representative; (3) avoiding ethical conflicts; (4) drafting and arguing a motion for summary judgment; (5) mediating; and (6) preparing for trial."},
    {"Number":7850,"Title":"Introduction to Critical Race Theory","Areas1":"Civil & Human Rights Law","Areas2":"Legal History & Jurisprudence","Areas3":"Constitutional Law","Description":"As civil rights gains were rolled back in the 1970s & 1980s, a group of scholars, beginning with the late Derrick Bell, sought to critique the notion of formal equality and colorblindness under law that pervade American conceptions of 'equality' and 'justice.' This course explores the body of theory he pioneered, now called Critical Race Theory (CRT), and some of its many interdisciplinary directions. In it, we will consider the history of race and racial inequality in the United States, in ways which recognize the tendency of both to intersect with other axes of inequality including gender, sexuality, class, and disability. We will also consider the many ways that formal equality under law obscures continuing racial inequality through purported race neutrality. Specifically, we will examine, understand, & theorize how American conceptions of liberalism, with their attendant reliance on individual responsibility and meritocracy, serve as consistent and effective alibis for racial inequality. Finally, we will consider how CRT has been taken up by non-legal disciplines and in popular culture, particularly in ways which allow us to hone strategies for achieving radical equality & social justice by building on the theoretical insights of the past. The major assignment for this writing and discussion driven course will be a substantial, analytic paper which takes the theories that we discuss and applies them to a contemporary or historical problem of formal equality under the law."},
    {"Number":6642,"Title":"Introduction to Litigation","Areas1":"Civil Litigation & Procedure","Areas2":"Ethics & Professional Responsibility","Areas3":"x","Description":"This course introduces first-year students to the joys and challenges of civil litigation practice by focusing on the specific skills needed, and ethics issues that arise. Skills covered include client interviewing, case planning, fact investigation (including discovery), client counseling, negotiating, and courtroom advocacy. The class will explore how a civil litigator's often competing ethical responsibilities naturally lead to challenges in making strategic decisions. We will cover the Model Rules of Professional Conduct for lawyers with special attention to obligations of loyalty, zeal, confidentiality, avoidance of conflicts of interest, fairness in dealing with opponents, and honesty in interactions with courts. The method of instruction will include skills exercises in which students will conduct and critique simulated interviews, case planning and strategy discussions, fact investigation, client counseling sessions, negotiations, and courtroom advocacy presentations."},
    {"Number":8055,"Title":"Introduction to Practice in the Criminal Justice System","Areas1":"Criminal Law & Procedure","Areas2":"","Areas3":"x","Description":"In this class, students will engage in various aspects of a simulated criminal trial, which will give students the opportunity to develop some of the lawyering skills inherent in criminal practice, including how to interview clients, argue motions, engage in plea negotiations, break down a statute, fact investigation, & plan for a trial. Students will also be confronted with the important ethical issues that face counsel in criminal cases. The course will begin with an overview of the Criminal Justice System, including perspectives from various system mechanisms - police, court system, prisons, defense attorneys & prosecutors. As this is an introductory course, it is necessary to introduce a variety of law school courses including professional responsibility, criminal law & criminal procedure. The goal is to have students become familiar with the criminal justice system, gain experience through simulations & think critically while performing tasks within the practice of criminal law."},
    {"Number":8016,"Title":"Introduction to Transactional Lawyering","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This course is designed to acquaint students with some of the legal issues associated with starting up and operating a business or venture, examining the role of a transactional lawyer and learning basic practice skills. The objective is to give first year students an introduction to legal issues that lawyers are likely to encounter in an entrepreneurial setting, how the process works, decisions that need to be made and all of the various legal issues during the life cycle of a start-up. These issues include choice of entity, selection of a company name and trademark, protecting the intellectual property of a new company or venture, financing arrangements, operating issues including employment and general business agreements and exit strategies. The course will use simulation and role-plays to explore the legal issues relevant to transactional lawyering."},
    {"Number":8271,"Title":"Judge and Community Court Seminar","Areas1":"Civil Litigation & Procedure","Areas2":"Administrative & Government Law","Areas3":"x","Description":"This seminar examines through participant observation the functioning of the judicial process in our first-level or community courts. Students undertake this study of judicial performance through clerkship-like fieldwork placements with judges of the Boston Municipal, District, Juvenile, Housing, and Land Courts. Students are available to assist their judges with legal research and writing. Students are expected to observe and assist their judges eight hours/week (one full day or two mornings) for which they receive two clinical (pass-fail) credits. The weekly classroom sessions cover the full range of issues which trial judges encounter on a daily basis, including judicial ethics, sentencing policy, ADR, jury management, and treatment courts. A twenty page paper describing some aspect of the judiciary's work in these courts is required and serves as the basis for the two graded credits."},
    {"Number":4498,"Title":"Judge and the Community Courts","Areas1":"Clinical & Experiential Education","Areas2":"Civil Litigation & Procedure","Areas3":"x","Description":"Students are expected to observe and assist their judges eight hours/week (one full day or two mornings) for which they receive two externship (pass-fail) credits."},
    {"Number":8838,"Title":"Judicial Process","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"Department Permission"},
    {"Number":8834,"Title":"Judicial Process: Appeals","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"Judicial Process is a course which allows a student to sit as law clerks two days per week with Massachusetts Superior Court Judges (Trial Court). Students will be assigned to individual judges. It is expected that the student will perform one day doing assignments and the second day observing. There will opportunity to work with more than one judge. Students will therefore have the opportunity to observe and work directly with different judges and thereby learn from different judicial styles and perspectives. There will be a bi-weekly two hour seminar meetings, which will be used to discuss various topics including the following: selection and discipline of judges; role of the jury; and a critique of the adversary system."},
    {"Number":6632,"Title":"Jurisprudence","Areas1":"Legal History & Jurisprudence","Areas2":"Ethics & Professional Responsibility","Areas3":"x","Description":"This course considers the nature of law, the nature of justice, the nature of the political community, and the purposes of private law. Law has been identified by some thinkers as the commands of the sovereign; the political community and its law have been accounted for based on submission to a common commander. Other approaches propose that law in its fullest sense is embedded in a community which is dedicated to justice. This course compares these approaches in a critical manner. It inquires into the nature of justice and freedom, with special attention to Aristotle, Cicero, and thinkers in the Jewish and Christian traditions."},
    {"Number":4897,"Title":"Justice and the Global Economy","Areas1":"Business Law","Areas2":"International & Comparative Law","Areas3":"x","Description":"How is globalization changing the nature of international law, international society, and global governance? What would it take to construct a just global economy? How can international economic law and institutions be reformed towards this end? These are a few of the questions considered in this seminar, through an introduction to the phenomenon of globalization and to some of the principal theoretical perspectives (i.e., political philosophy, sociology, economics, etc.) currently being applied in the study of these developments. Together we apply these and other theoretical perspectives to select issues in globalization studies and the operation of international economic law institutions, particularly the work of the WTO, IMF, and World Bank. The seminar also affords students an opportunity to research, write, and present a substantial paper (30-45 pages) of publishable quality concerning an issue of globalization and contemporary international economic law."},
    {"Number":3389,"Title":"Juvenile Rights Advocacy","Areas1":"Clinical & Experiential Education","Areas2":"Family & Estate Law","Areas3":"x","Description":"The Juvenile Rights Advocacy Project provides a five-credit/semester clinic to students either enrolled in Childrens Law & Public Policy or who have completed Childrens Law. Students will represent, as Guardian-ad-Litem, youth involved in legal issues related to their dependency, status offense, delinquency, or special education cases. Cases may include special education advocacy, school disciplinary proceedings, administrative advocacy with the Departments of Youth Services and Children & Families, and Juvenile Court advocacy in status offense cases. Students may represent youth committed to the Department of Youth Services through the post-disposition phase of their cases. Students will work on cases in-house at JRAP or be placed in a community law setting. Placements will be determined based on interest expressed in applications and meetings with the Professor. Weekly commitment for JRAP I or II is 15 hours, although that can vary depending on the demands of a particular case."},
    {"Number":8329,"Title":"Juvenile Rights Advocacy Project Clinic","Areas1":"Civil & Human Rights Law","Areas2":"Family & Estate Law","Areas3":"Clinical & Experiential Education","Description":"Students will represent, as Attorney or Guardian-ad-Litem, youth involved in the justice system on legal issues related to dependency, status offense, delinquency, or special education cases. There is an emphasis on education law in JRAP cases. JRAP In-House students will be exposed to some of the following: special education advocacy (team meetings, hearings, appeals), school disciplinary proceedings, administrative advocacy with the state Departments of Youth Services (DYS) and Children and Families (DCF), and Juvenile Court advocacy. Cases are primarily in Middlesex County."},
    {"Number":7726,"Title":"Labor and Employment Arbitration","Areas1":"Labor & Employment Law","Areas2":"Civil Litigation & Procedure","Areas3":"x","Description":"This course will examine arbitration as a dispute-resolution mechanism for disputes arising in the workplace (unionized and non-unionized). First, the course will examine the widely accepted use of arbitration to resolve disputes under public and private sector collective bargaining agreements (Labor Arbitration). Later, it will address the legal principles governing arbitration to resolve disputes arising under employment regulation statutes like Title VII of the Civil Rights Act of 1964. In addition, we'll look at disputes that arise out of individual contracts of employment in the non-unionized workplace (Employment Arbitration). The course will both study the substantive law, and, use simulations to teach the practical skills necessary to represent clients in both labor and employment cases and in arbitration generally. These practical skills include case preparation, opening and closing statements, and direct- and cross-examination of witnesses. Enrollment is limited to 15 students."},
    {"Number":7757,"Title":"Labor Law","Areas1":"Labor & Employment Law","Areas2":"Business Law","Areas3":"x","Description":"What do the NFL, Major League Baseball and other professional sport leagues, the entertainment industry, the Writers' Guild, as well as large portions of the health care, hospitality, service and manufacturing industries, to name a few, have in common? Collective bargaining and the law governing that process regulates employment relations in all these industries. This course examines the Nation's basic collective bargaining statute, the National Labor Relations Act, the statute that provides the basic model for public-sector labor relations as well. Among other issues, this course examines the legal framework for bargaining, for dispute resolution through the grievance-arbitration process, the regulation of economic pressure tactics, union organizing and a series of Constitutional issues affecting this area. Current trends are highlighted and existing doctrine is studied in light of its demonstrated or likely impact. Evaluation by examination."},
    {"Number":7759,"Title":"Land Use Law and Planning","Areas1":"Environmental Law","Areas2":"Administrative & Government Law","Areas3":"Real Estate Law","Description":"Course participants will learn land use law and planning using local, state and national statues, regulations, cases and policies which allow or disallow the built environment and what can and cannot be done in buildings and on real property, including tidelands. We will cover traditional land use planning controls (zoning, subdivision control, environmental laws, ?Chapter 91? water access rights and health and public welfare laws). We will also analyze mechanisms such as transfer of development rights, developer exactions and impact fees, and development and conservation agreements. Themes include decision makers in land use law and planning; constitutional limits and mandates; rights of abutters and ?stakeholders,? including standing; and the strengths and weaknesses of governmental authority in U.S. land use law. Participation in public land use hearings and planning forums is anticipated, virtually or in person. Guests include an engineer to help teach reading and using site plans and surveys, and a Land Court judge to address appearing in Land Court. Actual projects will be used as examples for learning practically as well as in theory."},
    {"Number":8899,"Title":"Landlord Tenant Practice","Areas1":"Real Estate Law","Areas2":"Business Law","Areas3":"x","Description":"This course is a one semester course combining substantive law surrounding the relationship between residential real estate owners and/or lessors and their lessees with practical applications including a wide range of lawyering skills such as how to prepare for and conduct an initial client meeting, client communications, court hearings with an emphasis on ethical issues, research and investigations, strategic counseling, and courtroom performance. Students will examine strategic approaches to: (1) eviction bench trials with defenses and counterclaims including discrimination, retaliation, breach of warranty, breach of contract, and violations of the Massachusetts Consumer Protection Law (Chapter 93A), (2) injunctions seeking to void the tenancy based upon criminal conduct, and (3) temporary restraining orders seeking to compel landlords to remedy health code violations or stop a move out. This class will provide students with the practical skills needed for engaging in mediation and alternative dispute resolution, preparing for an eviction bench trial, evidentiary hearings and motions. We will examine the development of Housing Law during the current pandemic and legislative moratorium on certain evictions, virtual hearings/trials, access to justice, pro se litigants, and the legalization of marijuana in the areas of reasonable accommodation and federally subsidized housing."},
    {"Number":3360,"Title":"Law and Accounting","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"A study of the basic concepts and limitations of financial accounting, our course covers the financial reporting process and the development of financial statements for external users, such as investors and creditors. In addition, techniques for analyzing financial statements and putting them to use are introduced along with the context of law, auditing, corporate governance, and globalization in which they are generated. No student who has taken undergraduate courses in accounting may register."},
    {"Number":4425,"Title":"Law of Money","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"This course is about the law of payments. It can be relevant for almost all lawyers, because a large part of what lawyers do involves 'moving money.' This not only includes specialists who work for banks, credit card companies, and financial institutions. Corporate lawyers close deals with one party sending money to the other. Private and government litigators settle civil and criminal cases for payment of money where the two sides do not trust each other. Family lawyers sometimes have to think about the mechanics of alimony and child support payments. And of course there is payment of a lawyer's own fees. Therefore this is a basic 'primer' course for all lawyers, regardless of prior experience or planned practice area.To understand this topic, we will start with the fundamental concept of money and the rights of sellers, buyers/consumers and banks regarding traditional cash, notes, bank deposits, checks and letters of credit. But the law in this area is also changing rapidly in direct response to new payment-system businesses and consumer transactions arising from the internet and financial technology ('FinTech'). So we will turn to a range of more modern payment systems: wire transfers, credit and debit cards, and electronic banking. Finally, we will use all of these tools to examine emerging legal issues for non-bank mobile payment systems such as Venmo, cryptocurrencies such as Bitcoin, and new types of government-issued money that respond to these technologies."},
    {"Number":4408,"Title":"Law of Philanthropy","Areas1":"Tax Law","Areas2":"Family & Estate Law","Areas3":"x","Description":"Millions of individual Americans, as well as foundations and corporations, donate well in excess of $300 billion, each year, in charitable gifts. Even in soft economies, that figure tends to grow annually. Philanthropy has become a key part of the U.S. economy, fully 2.2% of GDP and, increasingly, a discrete and important field of the practice of law. In this course, students will explore the structure of American philanthropy, its legal history, current regulation, case law, and emerging legislation and topics on public policy. The course will introduce students to sophisticated charitable giving techniques used to convey donations and trends in the practice of law and philanthropy. Whether anticipating a practice with active engagement in philanthropy, or, volunteer service as a member of foundation or non-profit boards, this course will provide students with an in-depth orientation to the field. This course requires a paper and not a final exam."},
    {"Number":7482,"Title":"Law of Toxic Substances","Areas1":"Environmental Law","Areas2":"","Areas3":"x","Description":"This course will provide students with an in depth review of the laws and policies regarding the introduction of hazardous substances into the marketplace, the handling and release of such substances, and the storage, treatment and disposal of hazardous wastes. The course also will study the investigation and remediation of chemical releases, including examining both major cleanups at 'Superfund' sites and the cleanup and redevelopment of 'Brownfield' sites. Students also will review how these environmental issues impact purchase and sale of real property and how due diligence and allocation of liability can be handled in transactions involving contaminated property. The course will focus in particular on the TSCA, RCRA and CERCLA statutes. The course will emphasize the practical aspects of practicing environmental law. During the course students will do three papers/practical exercises in lieu of exams."},
    {"Number":2150,"Title":"Law Practice I","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"All 1L students in their first semester will be enrolled in this course for which they will receive 3 credits toward satisfaction of the requirement in ABA Standard 303 for 6 experiential course credits. The curriculum will introduce students to the role of the lawyer through legal problem solving in a simulated client context. Students will be provided with instruction in: research and analysis of binding authority; identification of legally significant facts from documents, interviews, etc.; guided instruction in how to read and synthesize the law, the presentation of analysis of the law and application of the analysis to the problem facts; and preparation of office memoranda. The course involves classroom instruction and discussion, group work, and intensive individual feedback and conferencing."},
    {"Number":2155,"Title":"Law Practice II","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"In their second semester, all 1L students will be enrolled in this 2-credit course in satisfaction of the requirement in ABA Standard 303(a)(2) for a rigorous writing experience in the first year which is faculty supervised. Building on the research, analysis, and writing experiences in Law Practice I, students will prepare documents, primarily in the context of advocacy, which involve more complex legal problems than those presented in Law Practice I. The emphasis will be on improving clarity, precision, and effectiveness of these communications for a designated audience and purpose in a simulation, with continued attention paid to a lawyer's ethical and professional responsibilities to the client and the legal system. The course involves classroom instruction and discussion, group work, and intensive individual feedback and conferencing."},
    {"Number":9999,"Title":"Law Review","Areas1":"","Areas2":"","Areas3":"x","Description":""},
    {"Number":4514,"Title":"Law, Slavery and Race","Areas1":"Civil & Human Rights Law","Areas2":"Legal History & Jurisprudence","Areas3":"x","Description":""},
    {"Number":3333,"Title":"Legal Analysis for Practice","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"This course will further develop and strengthen students' legal analysis and problem-solving skills. Using a practice-oriented approach, the class puts students in the position of new associates at a law firm working with a senior partner (the professor). The course focuses on enhancing fundamental lawyering skills such as reading comprehension, rule mastery, issue spotting, outlining, the mechanics of legal analysis, and strong writing. Throughout the course, students will have multiple opportunities for hands-on practice of these skills through focused drills, group exercises, and workbook activities. The course enhances learning by providing students with individual feedback to learn how to evaluate their work and see a clear pathway for consistent improvement. Evaluation will be based on (1) Good faith completion of a Diagnostic Exam; (2) Timely completion of all quizzes, in-class assignments, and homework assignments; (3) Class Participation; (4) Compliance with Attendance Policy; (5) Midterm Exam; and (6) Final Exam."},
    {"Number":4415,"Title":"Legal Analytics: Applying Data and Analytic Thought to Legal Problems","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"William Gibson said '[t]he future has already arrived. Its just not evenly distributed yet.' This course introduces the legal tools that have arrived, but are not yet evenly distributed, and will teach you how to use analytics to improve legal decision making. We will explore behavioral economics, data analysis and visualization, statistical methods, artificial intelligence, and game theory. Through demonstrations, in-class projects, and a semester long course project, we will apply them to solve legal problems and learn to efficiently manage, collect, explore, and analyze various forms of legal data. You do not need prior college coursework in math, statistics, data science, or economics to take this course."},
    {"Number":2814,"Title":"Legal Interviewing and Counseling","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"The special objective is to develop within the student an awareness that mastery of sound interviewing and counseling skills is crucial for the delivery of quality legal services, whether one is engaged in private practice or works for a public agency. Course grade is based on: regular class attendance; active participation in small group exercises; performance of assigned attorney, client, or observer roles in simulated interviews and mediation sessions as students working through various problem cases. Students are expected to keep a journal and submit a copy of it at the end of the term when handing in a take-home exercise."},
    {"Number":8667,"Title":"Legal Practice Externship","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":""},
    {"Number":8251,"Title":"Legal Professionalism","Areas1":"Ethics & Professional Responsibility","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"This is a seminar for students in an externship."},
    {"Number":7781,"Title":"Legal Scholarship Workshop: Regulation and Business","Areas1":"Business Law","Areas2":"Administrative & Government Law","Areas3":"Corporate & Securities Law","Description":"This workshop will feature presentations by five or six invited legal scholars of their works-in-progress concerning law, business, and the regulation of economic activity, broadly construed. Students will meet with one or more BC faculty conveners the week before each presentation to discuss the paper. (The faculty conveners are: Renee Jones, Patricia McCoy, Diane Ring, Shu-Yi Oei, and Natalya Shnitser.) Students will prepare one-page response papers for each work-in-progress presented. Response papers will be shared with the authors. This workshop is designed for students who are interested in publishing during law school and in legal scholarship more generally. It is also well suited for students with an interest in economic regulation, business, and corporate governance. 1 credit, pass/fail."},
    {"Number":8823,"Title":"Life Cycle of a Chapter 11 Restructuring Case","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"Chapter 11 cases require lawyers for troubled companies and related parties (creditors, employees, vendors, customers, shareholders and others) to evaluate alternative strategies to maximize value and to minimize losses (or to push those losses onto others). In this inter-active course, we'll use an actual case (in which the professor represented the debtor) to allow students to set and critique strategy; write recommendations to the Board and motion papers from opposing sides; argue positions; negotiate a chapter 11 plan outcome; and try to reconcile some of the competing legal and social implications of corporate restructuring (for example, should poorly managed companies be left to fail? What if that means the loss of the best employer in a small town? Should 'vulture funds' be allowed to take advantage of distressed situations?)."},
    {"Number":8910,"Title":"Litigation Skills: Fact Development","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"Instruction in the theory and fundamental skills of pre-trial advocacy in civil cases. Subjects to be covered include interviewing, fact investigation and analysis, case valuation/risk analysis, client counseling, pleading, discovery, and motion practice. Professional responsibility issues will be considered throughout the course. Grading is weighted heavily toward class participation. In addition, students must maintain a 'case file,' consisting of a 1-inch 3 ring binder. This binder will be submitted for grading at the end of the course."},
    {"Number":7798,"Title":"LLM Thesis","Areas1":"","Areas2":"","Areas3":"x","Description":"An extended independent study writing project."},
    {"Number":4444,"Title":"Local Government Law","Areas1":"Administrative & Government Law","Areas2":"Real Estate Law","Areas3":"Constitutional Law; Environmental Law","Description":"This course examines the most pervasive and complex form of public law in the United States - the law of local governments. In examining the doctrine (and lack thereof) defining local government law, the course provides a foundation for the many areas of legal practice that deal with local issues, disputes, and concerns. More broadly, the course asks whether local governments serve or impede broader commitments to equality, democracy, inclusion, and participation. We will focus on issues such as federal and state control of city decision-making, the conflict between central cities and suburbs and among the suburbs themselves, alternatives to city-delivered services and to city taxation as a source of local revenue, and the ways in which racial and ethnic division fracture American metropolitan areas. Above all, this is a course about local democracy. For that reason, among others, active class participation is an integral part of the course and will be expected of every student enrolled in it."},
    {"Number":6677,"Title":"Mergers and Acquisitions","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"This course is an introduction to the legal rules and principles governing corporate transactions including mergers and negotiated acquisitions. We will begin with an examination of the deal structures used in most common transactions, focusing on statutory requirements and relevant Federal regulations. We will then turn to questions of the Delaware common law and the fiduciary duties of selling directors in the context of mergers and acquisitions. Finally, we will turn to the merger agreement. In that setting, we will study the structure of the merger agreement and typical provisions negotiated in merger agreements. The object of this final section will be to understand the incentives addressed by each such provision and the legal limits to their use."},
    {"Number":3680,"Title":"Mindfulness and Contemplative Practices for Lawyers","Areas1":"Ethics & Professional Responsibility","Areas2":"","Areas3":"x","Description":"Health Law"},
    {"Number":8075,"Title":"Mobile Apps and Big Data: Legal Contributions","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"The focus of this interactive and experiential course is on the role the attorney can play in the development and launch of mobile applications, particularly apps that will leverage very large databases and real-time data processing. Legal issues and strategies to be covered include: contract issues, term sheet negotiations and drafting, intellectual property and data protection/privacy. While the instructor will draw on experiences at Nintendo of America Inc. and Tetris Online, Inc., the course will not be limited to game-based apps."},
    {"Number":6610,"Title":"Native Americans and the Law","Areas1":"Environmental Law","Areas2":"Legal History & Jurisprudence","Areas3":"x","Description":"This course will focus on the constitutional, statutory and jurisprudential rules that make up the field of Federal Indian Law. The course begins with the historical framework from which the rules were derived, then traces the development of the underlying legal doctrines that are prominent today, including tribal sovereignty, tribal jurisdiction, treaty rights, and state authority over tribal lands. The second half of the course focuses on subject-specific areas: hunting and fishing rights, reserved water rights, stewardship of natural resources, economic development (including tribal gaming and natural resource development), protection of tribal religious and cultural practices, and the laws related to cultural harms caused by mascots, theft of cultural belongings (including human remains), and cultural appropriation."},
    {"Number":2810,"Title":"Negotiation","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"The goal of this course is to teach you to think about negotiation as an opportunity to solve a problem that exists, or create new value where there is none, or try to make a bad situation a bit better. I hope to enhance your ability to think creatively and synthetically as well as analytically. You will also learn that planning is essential and can sometimes make up for your status as a new legal negotiator. The skills you will learn include analysis, persuasion, creativity, listening, interviewing, counseling, question framing, and the use of law and legal principle. We will also explore the moral and ethical issues implicated in negotiation--honesty, integrity, character, reputation, and personal identity."},
    {"Number":4501,"Title":"New Frontiers in Environmental Policy","Areas1":"Environmental Law","Areas2":"","Areas3":"x","Description":"This seminar explores the proposition that successfully coping with today's environmental threats requires deeper challenges to our prevailing system of political economy than mainstream environmentalism in the United States has been willing to mount. It develops the idea that a new American environmentalism is needed and with it new environmental policy and law that go beyond the traditional realm of environmental affairs. Students learn about the nature of the modern corporation and its role in politics and in an increasingly globalized marketplace; consumerism and commercialism and the lifestyles they offer; the overriding priority routinely accorded economic growth; social injustice and its links to environmental prospects; the anthropocentric, materialistic, and contempocentric values that currently dominate American culture; and the prospects for a new environmental politics. We will interrogate whether it is desirable and possible to transition to a new economic model where the priority is to sustain human and natural communities, and, if so, what new policies and politics might promote such a transition."},
    {"Number":6603,"Title":"Nonprofit Organizations","Areas1":"Labor & Employment Law","Areas2":"","Areas3":"x","Description":"This is a course in the law and theory of charities and other not-for-profit organizations. Our primary emphasis is on understanding the state and federal law governing these organizations, together with the rights and responsibilities of their members, officers, and directors. For example, we will explore what is a qualifying 'charitable' activity, limits on the commercial and political activities of nonprofits, and rules for executive compensation. Our legal discussion will be informed by an exploration of the purposes of charity, whether it has a unique social mission, and what implications those theories have for the proper governance of the sector. There will be an open-book, in-class 3-hour final exam and occasional ungraded (i.e., fun) in-semester projects."},
    {"Number":7723,"Title":"Partnership: Transactions, Planning, and Tax","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"This course will examine tax and economic issues associated with partnerships and limited liability companies. There will be occasional reference to substantive state partnership law as necessary to understand other concepts. Aimed at students interested in small business, venture finance, real estate, or general transactional work as well as taxation."},
    {"Number":7840,"Title":"Patent Law","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"This course covers the major doctrines and policies at work in modern patent law. While current law will be taught in detail (both the 1952 Act and the America Invents Act), the course will also focus on enough history and policy so that students are equipped to deal with, and make predictions about, the rapid changes in patent law that we have witnessed recently and that we will continue to see. The course also has a skills component. Students will learn to review prior art, analyze the validity and novelty of particular patents in the form of claim construction charts, and make oral arguments for summary judgment on issues of validity, novelty, and claim construction in front of patent practitioners in the field."},
    {"Number":4445,"Title":"Patent Litigation","Areas1":"Intellectual Property & Technology Law","Areas2":"Civil Litigation & Procedure","Areas3":"x","Description":"This course has two goals. First, teaching substantive patent law and the key events in patent litigations. Second, developing core litigation skills that are critical to not only patent cases, but also other types of litigations. The class will focus on three exercises: (1) a Markman argument in which each student will argue patent claim construction issues; (2) an expert deposition of a technical witness, in which the students will question the witness; and (3) summary judgment briefing and a hearing, in which each student will write a brief and present oral argument. All three exercises will involve review of substantive patent law, issues specific to patent litigations, and core litigation skills."},
    {"Number":8800,"Title":"Pop-Up Clinic","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"A 'pop-up clinic' will be a temporary clinic (less than 1 year) set to take advantage of unique opportunities for clinical teaching and student learning. Pop-up clinics are not intended to act as 'advanced' clinical offerings, but rather to temporarily extend the scope of clinical opportunities into new areas where the Law School does not already provide students with opportunities. An example of a pop-up clinic might include a unique appellate litigation opportunity that falls outside the context of an existing clinic. Like other clinics, pop-up clinics are housed within the Center for Experiential Learning. Pop-up clinics must be approved by the Associate Dean for Experiential Learning."},
    {"Number":4416,"Title":"Privacy Law","Areas1":"Intellectual Property & Technology Law","Areas2":"","Areas3":"x","Description":"Privacy Law will take a practical approach in the context of privacy theory and the evolving global web of privacy and security laws, regulations, industry standards, and best practices. We will explore, from an individual perspective, a corporate perspective, and a law enforcement perspective, the scope and nature of an individual's right to control his or her personal information held by others. We will also consider recent controversies such as those involving big data/AI, facial recognition, encryption, domestic surveillance, ad-targeting, virtual reality, cross-device matching, mobile device geolocation, social networking, video surveillance, haptic security, biometrics, and DNA databases. With the new European General Data Protection Regulation ('GDPR') taking effect in May of 2018 and authorizing fines of up to 4% of annual worldwide revenue, now is a perfect time to develop your privacy compliance expertise!"},
    {"Number":2192,"Title":"Professional and Moral Responsibility of Lawyers","Areas1":"Ethics & Professional Responsibility","Areas2":"","Areas3":"x","Description":"The first part of this course focuses on central issues of professional responsibility faced by most lawyers in the daily routine of practice, whether in a large firm, a small firm, or a legal services program. Included will be problems of client confidences, conflict of interest, behavior in court, obligations to represent unpopular clients, and other restrictions on a lawyer's own speech and actions. The second part focuses on the fundamental moral responsibility of lawyers, analyzed both in terms of the rules governing attorney conduct and the principles of ethical philosophy. There also will be a discussion of the professional organizations of the bar in a historical context, and their future challenges. Because of the amount and nature of coverage of on the fundamental moral responsibility of lawyers, this class fulfills the Perspectives requirement in addition to the Professional Responsibility requirement."},
    {"Number":2190,"Title":"Professional Responsibility","Areas1":"Ethics & Professional Responsibility","Areas2":"","Areas3":"x","Description":"This course focuses on central issues of professional responsibility faced by most lawyers in the practice of law, whether in the public or private sector. Included may be problems of client confidences, conflicts of interest, behavior in court, obligations to represent unpopular clients, and other restrictions on a lawyer's own speech and actions. Other topics focus on the fundamental moral responsibility of lawyers, analyzed in terms of the rules governing attorney conduct, principles of moral philosophy, and the pressures that create ethical blindness."},
    {"Number":8340,"Title":"Project Entrepreneur","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This course is centered on using entrepreneurship to foster the successful reentry of formerly incarcerated individuals back into society, igniting a new beginning for their families, and invoking positive change in their communities. The mission of Project Entrepreneur is to equip formerly incarcerated people in the Greater Boston area with the tools necessary to be successful entrepreneurs through networking and mentorship and the completion of an important 'entrepreneurial fundamentals' class focused on business development, operations, sales and marketing, and strategy.Format: First, under the supervision of Professor Gennari, you will concentrate on the development of legal knowledge and counseling skills related to the advising of new businesses. Second, you will meet with the entrepreneurs and would-be business owners, who will become clients of BCLaw's Community Enterprise Clinic for purposes of the class. Third, together with graduate student colleagues from the CSOM and the GSSW, you will coordinate an eight-week course called 'Project Entrepreneur' for the enrolled entrepreneurs, which will be focused on the legal and business aspects of creating and managing new ventures. Fourth and finally, you will be part of a multidisciplinary team that will meet throughout the semester, and primarily after each Project Entrepreneur class and as appropriate with the would-be business owners, to work through questions, challenges, and opportunities for the new venture."},
    {"Number":2140,"Title":"Property","Areas1":"Business Law","Areas2":"","Areas3":"Real Estate Law","Description":"This first-year course covers the substantive law of real property. Topics include initial acquisition, property theory, the right to exclude, land use regulation, servitudes, conveyancing, landlord-tenant law, zoning, and takings."},
    {"Number":4460,"Title":"Prosecutorial Ethics","Areas1":"Criminal Law & Procedure","Areas2":"Ethics & Professional Responsibility","Areas3":"x","Description":"This course addresses constraints on prosecutorial power in the United States criminal justice system. Students will study constitutional constraints on prosecutorial discretion under the 5th and 6th Amendment, and particular Model Rules of Professional Conduct that limit or curtail prosecutorial conduct during the investigation and prosecution of crime. Particular topics addressed will include the prosecutor's conduct before the grand jury, charging decisions, plea bargaining, disclosure of exculpatory evidence, trial conduct, contacting and interviewing witnesses, and relations with the media. For additional 1 credit students may write a 15 page research paper on a topic to be agreed upon with professor. There will be an in-class examination."},
    {"Number":4515,"Title":"Race Relations and the Law","Areas1":"Civil & Human Rights Law","Areas2":"Legal History & Jurisprudence","Areas3":"x","Description":"This course will examine the ways in which law has shaped, propelled, prevented, and constrained race relations throughout the United States in every area of public and private life. Drawing from a range of cases, scholarly and popular articles, statutes, and literary works, we will engage three core questions: 1) whether the law can ever be color blind; 2) whether private and public parties should follow the Justice Roberts or Justice Sotomayor approach in redressing or avoiding racial discrimination and; 3) how to address and place race in an intersectional context. This course will include an opportunity to hear from practitioners, advocates, and commentators, who will help students think through these critical questions. Satisfies Upper Level Writing Requirement."},
    {"Number":9100,"Title":"Race, Policing, and the Constitution","Areas1":"Civil & Human Rights Law","Areas2":"Criminal Law & Procedure","Areas3":"Constitutional Law","Description":"The well-documented phenomenon of racial profiling and the widely publicized police killings of African-American males have sparked a lively public debate about the viability of legal and policy responses to these issues. In this seminar, we will examine the problem from three points of view. First, we will consider the legal context in which racial profiling came to be a constitutionally permissible mode of operation for police officers. In this part of the seminar, students will examine the role of the Supreme Court?s Fourth Amendment jurisprudence in abetting racial profiling. Beginning with the Supreme Court?s decision in Terry v. Ohio, 392 U.S. 1 (1968), students will review the cases that have defined the rules of engagement for encounters between the police and the public, paying particular attention to how the application of ostensibly neutral constitutional principles have, over time, validated racial profiling. In the second part of the seminar, students will explore the legal barriers to achieving accountability for racially discriminatory police conduct that results in a deprivation of life or liberty. The last part of the seminar will challenge students to imagine doctrinal changes in the Fourth Amendment jurisprudence that potentially could nullify the legal significance now accorded to racially motivated police conduct."},
    {"Number":9105,"Title":"Rappaport Law and Public Policy Seminar","Areas1":"","Areas2":"","Areas3":"x","Description":"This seminar connects with the Rappaport Center's new initiative to invite three Senior Fellows in Residence to BC Law for one week each. This year?s Senior Fellows are: Zephyr Teachout, law professor, author, activist, and former candidate for New York Attorney General and Governor; Brittny Saunders, Deputy Commissioner for Strategic Initiatives at the NYC Human Rights Commission, and a former interim counsel for Mayor Bill de Blasio; and Lance Freeman, a Professor in the Urban Planning program at the Columbia University Graduate School of Architecture, Planning and Preservation. (Dr. Freeman has also worked as a researcher at Mathematica Policy Research, a leading social policy research firm in Washington). The reading group/seminar will meet 8 times during the semester. Students will also be required to attend each Senior Fellow's public lecture. Students will read and prepare to discuss the reading materials for each session prepared by Prof. Kanstroom and the Senior Fellows. For one academic credit, they will write a critical reflection paper of approximately 750 words based on the readings and discussions at the conclusion of each Senior Fellow's week. As an added option, students may also enroll in an Independent Study with Prof. Kanstroom. For each extra credit, students will research and write a 15-page paper on a topic of their choice; supervised y Prof. Kanstroom with input from one or more of the Fellows."},
    {"Number":8900,"Title":"Real Estate Development and Finance","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"The course, clinical and practical, explores a lawyer's role and responsibilities, and the myriad of transactional documents and agreements, in residential and commercial real estate transactions from offers through acquisition and loan closing. The course examines, dissects, and teaches how to represent buyers, sellers, and lenders during the due diligence, development and permitting, and the financing phases of a real estate transaction. The course teaches practical lawyering skills such as drafting, negotiation, and problem solving. A variety of ethical issues are reviewed. Commercial leasing transactions, zoning, environmental and due authorization opinion letters, and zoning and environmental law and considerations in sale, lease, and finance transactions are taught. Case studies are presented and negotiation exercises conducted to summarize the areas of real estate law studied and to explain how the legal principles, cases, and issues work in real-life situations."},
    {"Number":3337,"Title":"Regulatory Practice Externship","Areas1":"Administrative & Government Law","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Externship in an administrative or legislative government setting, in a regulatory field of law. Limited to students enrolled in the seminar, Current Issues in Regulatory Practice LAWS3338."},
    {"Number":8239,"Title":"Representing Inmates at Prison Disciplinary Hearings","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Representing clients at prison disciplinary hearings provides a window into the hidden world of prisons. Massachusetts is one of the only states that allow students to represent clients at these hearings. All students will meet and interview clients in maximum security prisons, conduct discovery and investigation, file motions, cross-examine witnesses, make closing arguments and file appeals when necessary. Because the hearings are relatively short, students will be able to have multiple hearings each term. Legal skills learned: mini trials in 30-60 minute hearings; administrative law; adversarial practice; client interviewing skills; witness interviews; discovery practice; motion practice (written and oral); cross-examination of witnesses; direct examination of client; closing argument; written appeals if necessary."},
    {"Number":8236,"Title":"Representing Inmates at Prison Hearings Seminar","Areas1":"Criminal Law & Procedure","Areas2":"Clinical & Experiential Education","Areas3":"x","Description":"Seminar that accompanies LAWS823901 Representing Inmates at Prison Disciplinary Hearings."},
    {"Number":4457,"Title":"Research for Criminal Law Practice","Areas1":"Criminal Law & Procedure","Areas2":"","Areas3":"x","Description":"This course is designed to provide an in-depth examination of legal research materials and techniques useful for students who are interested in becoming prosecutors or criminal defense attorneys. Course will cover basic primary sources of criminal law such as the U.S. Constitution and state constitutions, as well as federal and state statutes, cases, and administrative law. Course will cover important secondary sources in the criminal law field; legislative history research skills; how to find and use jury instructions, sentencing guidelines, dockets, and practice materials such as formbooks. Students will also learn how to find and work with criminal court rules. Both print and electronic sources are explored and critiqued. The course covers Westlaw, LexisNexis, Bloomberg Law and other electronic sources."},
    {"Number":4437,"Title":"Resistance Lawyering: The Legal Struggle to End Slavery from the Founding to the Civil War","Areas1":"Civil & Human Rights Law","Areas2":"Legal History & Jurisprudence","Areas3":"x","Description":"In this seminar, we will trace the strategies and practices of the lawyers who fought to end slavery in the United States. Abolitionist lawyers used a myriad of tools at their disposal to resist slavery in state and federal court, in state and federal legislatures, and in the public sphere. They understood slavery as a structural legal problem embedded in culture and they used law however they could to uproot it. Moving chronologically, we will examine the ways that lawyering changed the law regarding slavery and the way that lawyering changed in response to changes in the law. Throughout, we will attend to the ways in which understanding resistance lawyering in the past can inform our answers to questions about the problems and promises of resistance lawyering in the present. The primary graded work in the course will consist of weekly response papers with a short final paper. Students will also have the option to complete a longer research paper for a third credit."},
    {"Number":9151,"Title":"Restorative Justice in Courts","Areas1":"Criminal Law & Procedure","Areas2":"","Areas3":"x","Description":""},
    {"Number":8065,"Title":"Restorative Justice: Transforming the Law from Within","Areas1":"Civil & Human Rights Law","Areas2":"Ethics & Professional Responsibility","Areas3":"x","Description":"This course will train students to implement restorative justice principles in legal practice. Students will learn how to facilitate restorative justice circles & how to incorporate restorative justice into their daily lives. The course will be facilitated through an interdisciplinary framework which combines the head & heart with the aim of cultivating compassionate lawyers committed to transforming themselves & the justice system. We will identify practices which nurture & strengthen the inner life and the connection between the inner life & well-being of lawyers & the quality of legal practice. To transform the justice system through restorative justice, future lawyers must be committed to transforming themselves & their way of being in the world.We explore the roots of restorative justice, contemporary examples of its application in post-conflict settings in the US & the world, and examine its utility in addressing the pressing mass incarceration crisis, the current penal system & mode of punishment in the US. We will practice & apply Critical Race & Systems Theories to sharpen the students? ability to assess themselves, & their future clients, through a systems lens & to examine the impact of racism, sexism, gender discrimination & other systems of oppression on behavior & on the justice system. Three classes will take place at MCI Norfolk medium security prison on Sundays. Grades will be based upon attendance, participation, facilitation skills, & written assignments."},
    {"Number":7774,"Title":"Securities Regulation","Areas1":"Corporate & Securities Law","Areas2":"Administrative & Government Law","Areas3":"Business Law","Description":"This course provides an overview of the federal regulation of the issuance and trading of stocks and other securities, focusing on the Securities Act of 1933 and the Securities Exchange Act of 1934. We will analyze the regulation of the public offering of securities and discuss the structure and operation of securities trading markets. Topics covered will include the disclosure regime for public companies, exemptions from the securities laws' registration requirements, and liability under the securities laws, including sanctions for fraud and insider trading."},
    {"Number":3383,"Title":"Selected Topics in White Collar Crime","Areas1":"Criminal Law & Procedure","Areas2":"","Areas3":"x","Description":"This seminar will examine emerging issues in the prosecution and defense of white collar crimes. We will first examine the concept of white collar crime and its import on other areas of the both criminal and business law. We will next study the concepts of corporate and individual liability. Our examination of white collar crime will also include several substantive offenses including conspiracy, tax fraud, mail/wire fraud, bribery, RICO, and financial crimes (including bank fraud and securities fraud). We will also conduct a study of the grand jury system and its role in both the prosecution and defense of white collar crime. Finally, we will intertwine an analysis of federal sentencing throughout the semester."},
    {"Number":8425,"Title":"Semester in Practice","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"The Semester in Practice (SiP) is an externship available to students in the upper level. Students work in legal externships in placements approved and monitored by the law school. These may take place in (but are not limited to) federal, state or local agencies, not-for profit organizations or non-governmental organizations. Students also meet in a weekly accompanying seminar. Credits for the placement is determined by the number of hours worked."},
    {"Number":4459,"Title":"Semester in Practice Seminar","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"The SiP Seminar brings together extern students for a weekly discussion of common practice issues and seminar discussions of current issues in the the practice of law, such as changes in the US legal profession, the adversary system, and unmet legal needs. The goal of the seminar is to develop better understanding of the forces that shape a lawyer's professional identity and to learn to become a reflective legal practitioner. This course enables students to bridge the gap between law school and practice. Students keep a daily journal and share their entries weekly with the instructor. Students are required to write a substantial 20-25 page paper on a topic approved by the professor in lieu of an exam. Enrollment by lottery."},
    {"Number":8429,"Title":"Semester in Practice Seminar: BC in DC","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":""},
    {"Number":8449,"Title":"Semester in Practice--Dublin","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"Semester in Practice (SIP): Dublin is BC Law's full-time immersion externship program for students who are interested in living and gaining International Legal experience. It will be offered during the Spring semester, 2019 and is open to both 2Ls and 3Ls. SIP: Dublin provides students with the opportunity to gain full-time professional experience for an entire semester at a private firm, a corporation, a non-profit or legal services organization. In addition to the placement, students enroll in an accompanying course taught by BC Law faculty. SIP: Dublin requires that students extern at their placement for 35-40 hours/week for 12 weeks. Students receive 10 externship credits (pass/fail) and 3 seminar credits (graded). This course satisfies the Lawyering Skills/Experiential Learning and the Perspectives requirements. The course is limited to 12 students. Throughout the seminar course, students analyze the lawyering process including cross cultural lawyering, legal ethics, professional responsibility, and other topics through readings, discussion, and student presentations. Students are asked to prepare written assignments in which they reflect on their experience and readings, including a final paper in lieu of an exam. The on-site faculty member monitors individual placements to ensure the supervising attorney is providing a significant educational experience including feedback on work product, planned work assignments, and exposure to various aspects of lawyering."},
    {"Number":4492,"Title":"Seminar on Education Reform","Areas1":"Administrative & Government Law","Areas2":"","Areas3":"x","Description":"This interdisciplinary seminar addresses the role of law in education reform and the relationship between law and social science in efforts to promote educational attainment in the nations elementary and secondary schools. The primary focus will be contemporary education reform issues, including educator quality, access to meaningful opportunity to learn, curriculum control, and student, teacher, administrator, and parental rights. The focus of the course will be inquiry on the role of law in school reform, the limits of law-based education reform, and the consequences of statutory requirements for scientific evidence-based approaches to education programs."},
    {"Number":9949,"Title":"Seminar on Financial Regulation & Reform","Areas1":"Administrative & Government Law","Areas2":"Business Law","Areas3":"x","Description":"This seminar will study the U.S financial regulatory structure and recently enacted financial reforms. Students will gain a basic understanding of U.S. financial regulatory system, including banking regulation and oversight, securities regulation and corporate law. Recurrent themes will include problems stemming from regulatory overlap and gaps, regulatory arbitrage, federalism and the impact of deregulation. Guest speakers from government and practice will provide a practical perspective on these issues. The course will begin with an overview of the regulatory system that emerged as part of the New Deal. We will then focus on understanding and legal developments that emerged beginning in the 1980s, including the Gramm-Leach-Bliley Act of 1999, which dismantled significant aspects of the New Deal regulatory structure. We will examine the rapid changes in the financial industry that followed Gramm-Leach-Bliley and efforts of financial regulatory institutions to adapt."},
    {"Number":7706,"Title":"Seminar on Law and Higher Education","Areas1":"Administrative & Government Law","Areas2":"","Areas3":"x","Description":"The Law and Higher Education seminar covers a broad range of pressing contemporary topics impacting institutions of higher education. Topics range from First Amendment concerns on campus, to the business of higher educational institutions (e.g., intellectual property protections and high profile athletic programs), to the impact of government and non-governmental actors on the university, to the future prospects of the American higher education model. The legal, historical, and theoretical underpinnings of each issue are covered, but the focus of the seminar is on the practical decision-making of general counsel, administrators, students, and others who coexist in the university context."},
    {"Number":4434,"Title":"Seminar: Labor Market Regulation","Areas1":"Labor & Employment Law","Areas2":"Administrative & Government Law","Areas3":"x","Description":"This seminar will examine the scope and effect of existing public regulation of labor markets--with a primary focus on the National Labor Relations Act, Fair Labor Standards Act, Title VII, the Occupational Safety and Health Act, and the antitrust laws--to assess their strengths and limitations in effectuating workplace protections and combating economic inequality. The seminar will begin with a historical overview of the origins of existing regulation and evaluate their adaptability to current workplace realities. We will focus in particular on the adaptability of existing regulation to the gig economy, subcontracted and outsourced work, temporary work, work provided by independent contractors, and low-wage work. In analyzing the limitations of current protections, the seminar will focus both on substantive rights and obligations imposed by current law as well as the role and ability of labor market institutions--unions, governmental agencies, and corporate forms--in ensuring or undermining those rights and obligations. In tandem with specific statutes, the seminar will focus on proposed reforms generated by Congress (in draft legislation), legal academics, policy experts, and social movements like the Fight for $15."},
    {"Number":8448,"Title":"SIP: Dublin Seminar","Areas1":"Clinical & Experiential Education","Areas2":"","Areas3":"x","Description":"Companion course to Semester in Practice: Dublin (LAWS844901)."},
    {"Number":9957,"Title":"Sports Law","Areas1":"Business Law","Areas2":"Intellectual Property & Technology Law","Areas3":"x","Description":"This course offers the study of selected topics in the application of law and legal thinking to sports. Particular attention is paid to how law or legal thinking shapes the business of sports and the behavior of those who run, play in, or regulate sports. Topics include league governance, merchandising, media rights, antitrust, labor law, and tort law. The class also includes on major simulation about the movement of college football teams to new conferences. The class requires a substantial research paper on a topic of the student's choice."},
    {"Number":4438,"Title":"Start-Up Companies and Venture Capital Finance","Areas1":"Business Law","Areas2":"Corporate & Securities Law","Areas3":"x","Description":"This course deals with the legal and business issues facing start-up companies and the venture capital and other investors who provide financing to them. In particular, the course will focus on the various legal considerations typically encountered by start-up companies, including corporate formation and initial financing, middle and later stage venture capital financing, strategic alliances, employment and equity compensation matters, securities laws compliance, corporate governance and exit strategies. The course will offer an introduction to these topics through the eyes of attorneys who represent start-up companies and may also include guest presentations on various relevant topics. The course may include a written practice exercise designed to expose students to the process of counseling venture backed companies."},
    {"Number":6824,"Title":"Startup Company Governance: Taming Unicorns","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This seminar will focus on understanding and analyzing governance problems that arise at 'unicorns,' large private companies valued at $1 billion or more. We will first study the conventional financing process for startup companies, and how these practices have changed in recent years. We will examine market trends and legal reforms that have contributed to these developments. We will then focus on the challenges the new legal framework creates for unicorn founders, investors, and employees. We will also explore how the new unicorn governance model impacts consumers and society. Students will write research papers on topics of their choosing related to issues discussed in the course. The course satisfies the Upper Level Writing Requirement. Prerequisites: Corporations."},
    {"Number":4443,"Title":"State and Local Government Practice","Areas1":"Administrative & Government Law","Areas2":"","Areas3":"x","Description":"Local Government Law introduces you to the skills needed to represent a municipal corporation, its Boards, Agencies and Departments, and to represent private clients in their dealings with those Boards, Agencies and Departments. Real Estate is 'local' and begins at the City or Town Hall. This course is also an introduction to the practice of real estate transactions, development and finance. The course will be taught through case studies and simulations in which students will learn how to use the substantive law to advise and guide private and municipal clients toward a satisfactory solution in their best interests. Anticipated practice skills include drafting of local legislation (ordinances and by-laws) (e.g., adult entertainment, sign restrictions, historic districts) in light of constitutional issues, preparing for and presenting a zoning application, drafting permits, negotiating with stakeholders and municipal boards, and representing multiple and often conflicting clients as a municipal attorney. The simulations are based on actual cases of the Professor, a former City Solicitor and a current municipal law and real estate practitioner. Particular emphasis is given to awareness of conflicts of interest and ethical issues in local government law. Evaluation: Simulations and final exam."},
    {"Number":4453,"Title":"State Constitutional Law","Areas1":"Administrative & Government Law","Areas2":"Constitutional Law","Areas3":"x","Description":"Many of the most important constitutional questions of recent times are being decided by state courts interpreting state constitutions. Regularly appearing on state court dockets are novel constitutional issues regarding abortion, gay marriage, the death penalty, education, the environment, health care, privacy, property rights, search and seizure, separation of powers, and state budgeting in times of fiscal crisis. As the Roberts Court reshapes the federal constitutional landscape, we can also expect significant changes from the state supreme courts, given the dynamic relationship that has developed between state and federal constitutional law. This course will cover the fundamental principles of state constitutional interpretation and apply those principles to current cases and controversies. The course will explore the history, text and structure of state constitutions and draw comparisons to the U.S. Constitution."},
    {"Number":8292,"Title":"Statutory Interpretation","Areas1":"Legal History & Jurisprudence","Areas2":"","Areas3":"x","Description":"This two-credit course, taught by the Chief Judge of the U.S. District Court for the District of NH, offers instruction in statutory interpretation, with emphasis on its practice (advocacy in litigation, and judicial opinions), doctrines (textual and substantive canons of construction), and competing theories: textualism, intentionalism, purposivism (legal process theory), pragmatism, and 'dynamic statutory interpretation.' Despite its theoretical aspects, this is a highly practical course."},
    {"Number":9667,"Title":"Supreme Court Experience","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"In this seminar, students will study in depth a number of the important cases of the current Supreme Court Term. All students will be responsible for reading the pertinent briefs and relevant background materials. Each student will also be required to perform a moot argument on at least one case, and class time will be dedicated to these moot arguments as well as to free form discussions. Finally, each student will be required to draft an opinion in at least one of the cases discussed."},
    {"Number":8128,"Title":"Tax Law Research","Areas1":"Tax Law","Areas2":"Business Law","Areas3":"x","Description":"Students will master research sources and methods in the area of federal tax, including federal statutory and legislative history research, regulatory process and regulatory publications. Students will master techniques of state-level tax research, including state statutory and regulatory resources. Students will be introduced to international and foreign law tax research sources. Emphasis is placed on the technology and tools used by practitioners, including BloombergLaw, CCH Intelliconnect, IBFD, RIA Checkpoint, BNA Tax Portfolios, LexisNexis, Tax Analysts and Westlaw. Students will receive instructor feedback on short ungraded assignments."},
    {"Number":7780,"Title":"Tax Policy","Areas1":"Business Law","Areas2":"Tax Law","Areas3":"x","Description":"This course examines legal, economic, political, and diplomatic considerations relevant to the formulation and implementation of U.S. federal tax policy. The class will be based on readings on three sets of issues: whether to tax consumption, income and/or wealth (and transition issues); how international considerations affect business taxation policy; and whether and how to use the tax system to reduce poverty on the one hand and to provide incentives to business on the other. The course?s coverage of selected tax policy literature is intended to equip students to critically assess the post-U.S. reform tax system (including new tax law provisions that are novel in one or more respects), the effect of U.S. reforms on international tax developments, and current tax policy proposals (including a wealth tax)."},
    {"Number":9926,"Title":"Taxation I (Individual Income Taxation)","Areas1":"Tax Law","Areas2":"","Areas3":"x","Description":"Taxation I is the basic introductory course in federal income taxation. In contrast to courses in the first year, it is principally a statutory course, dealing with the Internal Revenue Code and the Regulations. The focus of the course is divided between mastery of the technical tax principles and understanding of the basic policy judgments which are implicit in those principles. For a student who takes no additional tax courses, Taxation I should provide an overall understanding of how the federal income taxation system functions. For students desiring to continue their studies of tax, Taxation I develops the themes which will be recurring in later courses and forms the basis on which the subsequent tax courses build."},
    {"Number":7777,"Title":"Taxation II","Areas1":"Tax Law","Areas2":"Corporate & Securities Law","Areas3":"Business Law","Description":"Taxation II explores the taxation of corporations. After a brief review of the other common forms for organizing a business and their distinctive tax treatments, the course focuses on the most important federal income tax issues relating to the organization, operation, liquidation and reorganization of publicly-traded corporations (and other 'C' corporations). This includes the relationship between corporations and shareholders and the treatment of dividends and redemptions. The course is important for any student thinking of practicing in the general business area, even if she or he does not intend to become a 'tax specialist.'"},
    {"Number":7778,"Title":"Taxation III (Advanced Corporate Tax)","Areas1":"Tax Law","Areas2":"Corporate & Securities Law","Areas3":"Business Law","Description":"Taxation III is the most advanced course in the tax curriculum (note that Taxation I and Taxation II are prerequisites). It deals with both taxable and tax-free corporate acquisition transactions, the treatment of net operating loss carryovers, single corporation reorganizations and an introduction to the consolidated return rules and subchapter S. Students will engage in a variety of projects including some mix of the following: negotiate the terms of an acquisition transaction, prepare drafts for a request for a private letter ruling from the IRS, and draft tax opinions letters."},
    {"Number":9951,"Title":"Technology Transactions and Licensing","Areas1":"Intellectual Property & Technology Law","Areas2":"Business Law","Areas3":"Intellectual Property & Technology Law","Description":"This course will examine, from both the licensor's and the licensee's perspectives, the legal doctrines and related business concepts surrounding the licensing of patents, copyrights, trade secrets, trademarks and other proprietary rights in technology. Through a combination of case study, problems, simulated negotiations and drafting exercises, students will learn how and why participants in the information economy depend on licensing and related transactions as a vehicle for commercial exploitation of their technology assets and building enterprise value. The course will focus on developing basic, practical negotiating, drafting and analytical skills that students should find useful when advising technology-based clients. Although the course's emphasis on drafting and contract interpretation means it is, in many ways, an advanced contracts course, its reach is much broader and will touch on many other areas of the law."},
    {"Number":6693,"Title":"Telecommunications Law","Areas1":"Intellectual Property & Technology Law","Areas2":"Administrative & Government Law","Areas3":"x","Description":"This course surveys the basic principles underpinning our nation's telecommunications laws. We will explore the legal and regulatory treatment of several related telecommunications services, including landline telephone, wireless, cable, and internet service, and how technological developments have challenged the existing legal framework. The course will focus on administrative and statutory law, paying special attention to the design and implementation of the Communications Act of 1934. The course will also address the role of antitrust, intellectual property, and constitutional law (particularly the First Amendment) in shaping our nation's telecommunications landscape. Finally, the course will consider the role played by state and federal agencies, such as state public utility commissions and the Federal Communications Commission, in developing and administering telecommunications policy."},
    {"Number":4449,"Title":"The Art of Lawyering and the Commercial Lease","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"This course is for second and third year students. It is an exercise in the art of transactional lawyering, using commercial leases in a shopping center as a centerpiece. Through the study of a textbook, cases, statutes, and commercial documents, as well as through drafting and negotiation exercises, everything the student has learned in law school will converge on the problems that fictional clients bring to the class for solution. We will explore the choice of business entity, letters of intent, percentage rent, use restrictions, anti-trust, free speech in the shopping center, restrictions on transfer of interest by landlord and tenant, relationships and contracts with abutters, environmental issues, green leases, defaults and remedies, ethical issues, and bankruptcy. The course grade will be determined 50% by performance on drafting assignments and negotiation exercises and 50% by the extent and quality of class participation. There will be no final exam."},
    {"Number":9155,"Title":"The Cradle to Prison Pipeline","Areas1":"Civil & Human Rights Law","Areas2":"Family & Estate Law;","Areas3":"x","Description":"In 2012, the DOJ's Civil Rights Division formally accused the city of Meridian, Mississippi and the state's departments of youth & human services of operating 'a school-to-prison pipeline'. While it is rare that such explicit practices are alleged, the reality of the school to prison pipeline is well documented. However, the realities of systemic practices & policies that have fueled what Marian Write Edleman & others have characterized as the cradle to prison pipeline are now being scrutinized. The BBA's Cradle to Prison Pipeline Committee describes the process as the mechanism by which disparities in a wide range of arenas--including economic, health care, mental health, housing, child welfare & juvenile justice factors--'funnel' people of color, the poor, the LGBTQ+ community, & youth with disabilities into the system of mass incarceration. 'Unpacking' this phenomena entails examining critical issues of race, class, geographical & educational segregation & implicates consideration of the larger frames that affect families in & out of courtrooms. As Jill Lepore notes in Baby Doe: A Political Tragedy, between 2010-12, 72% of the youth committed to the MA DYS had been involved with DCF & over half of that number has been the subject of abuse & neglect petitions. In exploring this terrain this course will consider the evolution of child welfare & juvenile justice systems, de facto v. de jure segregation & to encourage students to think about ways to chart a different course."},
    {"Number":5521,"Title":"The United States Legal System","Areas1":"","Areas2":"","Areas3":"x","Description":"This course is required of LL.M. students who do not hold a U.S. J.D. degree. The course has several objectives: exposing students to fundamental concepts underlying the U.S. legal system, providing survival skills for the LL.M. year, exposing students to key doctrinal areas, and offering a frame of reference for comparing the U.S. legal system with students' own. The course is divided into three units: (a) an overview of our basic legal institutions, including the adversary system, the Constitution, and the Bill of Rights; (b) a case study in product liability law, as both substantive exposure to private law and an exercise in identifying and manipulating legal doctrine; and (c) an examination of how the structure of the legal profession and different modes of lawyering contribute to the functioning of the U.S. legal system as a whole."},
    {"Number":2145,"Title":"Torts","Areas1":"Civil Litigation & Procedure","Areas2":"","Areas3":"x","Description":"This course examines non-consensual relations among individuals and emphasizes negligence law, the measure of damages, and newer developments such as products liability."},
    {"Number":4414,"Title":"Trademark and Unfair Competition Law","Areas1":"Intellectual Property & Technology Law","Areas2":"Business Law","Areas3":"x","Description":"In this course, students will undertake an in-depth study of trademark law. This course will examine the doctrine, theory, practice, and procedure concerning intellectual property rights in corporate names, symbols, logos, and identity. In particular, students will be introduced to trademark creation, registration, protection, licensing, and litigation. There will be a final examination."},
    {"Number":8550,"Title":"Trial Practice","Areas1":"Civil Litigation & Procedure","Areas2":"Criminal Law & Procedure","Areas3":"Clinical & Experiential Education","Description":"There are several sections of trial practice, which are taught by adjunct faculty who are judges or practitioners. Each instructor selects his/her own readings and exercises, but the coverage of the sections is quite similar. All require students to prepare and to perform aspects of jury trial -- opening and closing arguments, and direct and cross-examination. The course is designed to develop practical skills and to build an appreciation for the relationship between substantive law and strategy and tactics in litigation. This section includes both civil and criminal trial exercises. Students also participate in a mock trial held in a real courtroom. All sections focus on trial advocacy; some also consider some pre-trial skills, such as discovery depositions. All sections have limited enrollments. Evidence is a prerequisite."},
    {"Number":6679,"Title":"Trusts and Estates","Areas1":"Family & Estate Law","Areas2":"Tax Law","Areas3":"x","Description":"This course explores the basic law surrounding the disposition of property at death: (1) overview of the estate planning process and the policy considerations regarding inheritance law; (2) the process by which property is distributed in the absence of a will (intestacy); (3) the law of wills, examining challenges to the will, formal requirements for the execution of a valid will, revocation, and construction; (4) will substitutes and planning for incapacity; (5) the law of trusts, including revocable and pour-over trusts, and creditor and beneficiary rights; (6) brief coverage of powers of appointment, perpetuities, charitable trusts, and general tax considerations. This course does not address in detail tax-motivated estate planning (see instead Estate and Gift Tax and Estate Planning)."},
    {"Number":9983,"Title":"U.C.C. Reporter Digest","Areas1":"Business Law","Areas2":"","Areas3":"x","Description":"Department Permission"},
    {"Number":4503,"Title":"Water Law and Policy","Areas1":"Environmental Law","Areas2":"","Areas3":"x","Description":"Water is the planet's 'blue gold.' In this course, students will understand the U.S. laws and policies that have shaped how this valuable resource is shared among competing users, and explore how the law needs to evolve to meet emerging demands. Students learn about the Clean Water Act, riparian and appropriation doctrines, the public trust doctrine, the intersection of water quality and quantity as well as surface and groundwater. We also examine water institutions, transboundary compacts, and federalism. Throughout, we tie the law back to contemporary dilemmas, and the role of science and economics in shaping water law and policy."},
    {"Number":7727,"Title":"Whistleblowing and Retaliation","Areas1":"Administrative & Government Law","Areas2":"","Areas3":"x","Description":"The laws relating to whistleblowing have evolved dramatically in the last twenty years. Additionally, whistleblowers in both the private and public sector have increasingly played a more prominent role in influencing social reform and public policy. The courts, legislatures, and government agencies charged with enforcing whistleblower laws have wrestled with the degree to which whistleblowers should be protected from retaliation and under what circumstances they should be incentivized to come forward by the prospect of a monetary award. In the private sector, courts remain divided over the proper balance between whistleblower protection and enforcement of legitimate corporate business interests such as the protection of confidential and proprietary information and trade secrets. In the public sector, challenges abound to balance to competing interests in disclosing alleged wrongdoing while protecting national security. In addition to examining the dramatic evolution of the laws and social policies relating to whistleblowing, this course will also examine the many ethical issues presented such as when and under what circumstances can an attorney present as a whistleblower. Finally, this course will examine best practices from a corporate compliance perspective to foster transparency and to effectively investigate whistleblower claims as they arise."},
    {"Number":4461,"Title":"Wrongful Convictions","Areas1":"Civil & Human Rights Law","Areas2":"Criminal Law & Procedure","Areas3":"x","Description":"This seminar gives students the opportunity to study the phenomenon of wrongful convictions, including the causes of, and possible solutions to, the problem and its significance for the criminal justice system. Readings, films, guest speakers, and discussions provide students with a range of perspectives on the issues. The academic experience is enriched by the students' ability to draw on their clinical and externship experiences"}]