[
  {
    "DisplayName": "Phillip Aldrich, M.S.",
    "area1": "Business Law",
    "area2": "Corporate & Securities Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/phillip-aldrich.html",
    "Image": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/phillip-aldrich/_jcr_content/profileImage.img.png",
    "SortName": "Aldrich, Phillip",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Phil Aldrich has over 10 years experience building and leading enterprise governance, risk and compliance (GRC) programs at Fortune 500 companies. Currently, he is the Director of Enterprise Risk Management (ERM) at EMC; responsible for the development and implementation of EMC’s GRC and ERM programs. He reports directly to EMC’s chief risk officer and is the Business Owner of the RSA Archer platform at EMC. He holds a B.S. (engineering) from the United States Military Academy and two M.S. degrees from Boston University: information systems (concentration security), administrative studies (concentration innovation and technology)."
  },
  {
    "DisplayName": "Lisa Alexander",
    "area1": "Civil & Human Rights Law",
    "area2": "Real Estate Law",
    "area3": "Property",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/lisa-alexander.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/lisa-alexander/_jcr_content/profileImage.img.png",
    "SortName": "Alexander, Lisa",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Lisa Alexander's workfocuses on the centrality of law in making housing markets both moreefficient and more equitable. She has done extensive scholarship inlegal and extra-legal rights to property, housing, and urban space,including, most recently, in the study of tiny houses, providing insights to policymakers on how to reimagine housing options andproperty rights for today's world. Alexander received her BA from Wesleyan University and her JD from Columbia University School of Law. She was a professor at University of Wisconsin Law from 2006 to 2017 before moving to Texas A&M University School of Law. At Texas A&M, she held a joint appointment as professor in the Department of Landscape Architecture and Urban Planning. She was also a Co-founder and a Co-Director of Texas A&M's Program in Real Estate and Community.Her fellowships and awards include being named a 2018 Texas A&M University Presidential Impact Fellow, the first person in the history of the School of Law selected for the honor. Her article on tiny houses is forthcoming in the Harvard Law & Policy Review, and she has published in the Minnesota Law Review, William & Mary Business Law Review and Fordham Urban Law Journal, among many others. Professor Alexander was a Summer Honors Program attorney at the U.S. Department of Justice, Civil Rights Division, Housing Section; an Equal Justice Works Fellow; an Earl Warren Civil Rights Scholar; and a Coro Fellow in Public Affairs. She is a former Associate Editor of the ABA Journal of Affordable Housing & Community Development Law, the premiere scholarly publication in the field of affordable housing and community development law, and was also appointed to the Wisconsin State Advisory Committee for the U.S. Commission on Civil Rights."
  },
  {
    "DisplayName": "Kimberly Ang",
    "area1": "Corporate & Securities Law",
    "area2": "Tax Law",
    "area3": "Criminal Law & Procedure",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/kimberly-ang.html",
    "Image": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/kimberly-ang/_jcr_content/profileImage.img.png",
    "SortName": "Ang, Kimberly",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Kimberly Ang currently serves as an Enforcement Counsel with the Public Company Accounting Oversight Board, investigating public auditing firms for violations of the Sarbanes-Oxley Act, the rules of the Board, and various provisions of the federal securities laws. Previously, she served for more than eight years as a federal criminal prosecutor with the U.S. Department of Justice, first with the Tax Division Criminal Enforcement Section in Washington, D.C., and later as an Assistant U.S. Attorney with the U.S. Attorney's Office for the District of Vermont.\n\nAng graduated cum laude from the University of Michigan Law School, where she served as Editor-in-Chief of the Michigan Law Review. Ang also clerked for Judge Gerald Bruce Lee of the U.S. District Court for the Eastern District of Virginia and Judge David McKeague of the U.S. Court of Appeals for the Sixth Circuit."
  },
  {
    "DisplayName": "Filippa Anzalone",
    "area1": "Legal Research",
    "area2": "Art Law",
    "area3": "Intellectual Property & Technology Law; Business Law; Ethics & Professional Responsibility",
    "acfacAreas": "Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/filippa-anzalone.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/filippa-anzalone/_jcr_content/profileImage.img.png",
    "SortName": "Anzalone, Filippa",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Filippa Marullo Anzalone has served as Professor of Law and Associate Dean for Library and Technology Services at Boston College Law School since August 2002. Professor Anzalone teaches an Art Law seminar and also teaches Advanced Legal Research. Besides Art Law, legal education, higher education management, and law library leadership are of particular interest to her. Before joining Boston College Law School, Filippa Marullo Anzalone was at Northeastern University School of Law School for almost eleven years. When she left Northeastern University School of Law School Library, Filippa was Professor of Law and Director of Information and Research Services. Professor Anzalone had served as Acting Dean of the Northeastern University Libraries for the 2000/2001 academic year. Prior to entering academic law librarianship, Filippa Marullo Anzalone was director of the law library at the Boston law firm of Bingham, Dana and Gould (now Bingham McCutcheon). She has also worked as a research librarian at Dike, Bronstein, Roberts, Cushman & Pfund, as a public library administrator at the Cambridge Public Library, and as the head children's librarian in the Medford Public Library. Before her academic career, Professor Anzalone spent time working summers in the Medford Public Library during her undergraduate years. Her other jobs have included working as a counter girl in an Italian bakery, as a nursing home aide, and as a babysitter. Her favorite job (pre-library) was, without a doubt, working in the bakery. Professor Anzalone has published many articles, book chapters, book reviews and opinion pieces. She is active in the both the Law School and University communities. Professor Anzalone has served as a panelist and chaired several programs at recent AALL and AALS conferences and she has participated in numerous ABA, AALS, and NEASC site evaluations of law schools. She has served as a consultant to a number of law school libraries and she has lectured both in the United States and abroad on leadership and management issues. Professor Anzalone received an A.B. from Smith College in 1975, a M.S.L.S. from Simmons College Graduate School of Library Science in 1977, and a J.D. from Suffolk University Law School in 1985."
  },
  {
    "DisplayName": "Hugh J. Ault",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/hugh-ault.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/hugh-ault/_jcr_content/profileImage.img.png",
    "SortName": "Ault, Hugh J.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Hugh Ault retired from active teaching duties in the spring of 2012. Professor Ault is a specialist in taxation with an emphasis on international tax issues. He has been visiting professor at a number of foreign universities in Europe, Asia and Australia. He was a Fulbright Exchange Professor at the University of Stockholm, where he received an honorary Juris Doctor degree in 1994. In 2003 he also received an honorary doctor of laws degree from Katholieke Universiteit Leuven, Belgium, in recognition of his academic contributions in international and comparative tax law. He taught courses in business and international taxation as well as tax policy. Professor Ault has written numerous books and articles on tax issues. The third revised edition of his book Comparative Income Taxation: A Structural Analysis (Kluwer/Aspen) appeared in 2010 and a Chinese translation was published by Peking University Press in 2013. Professor Ault was formerly Senior Advisor to the Organization for Economic Cooperation and Development (OECD) Centre for Tax Policy and Administration in Paris (1997-2012). He is currently Visiting Research Scholar at the Max Planck Institute for Tax Law and Public Finance in Munich and Senior Visiting Fellow at the University of Stockholm Centre for Commercial Law. He is also serving as a Consultant to the United Nations Financing for Development Office (FfDO), involved in work on strengthening developing country tax systems."
  },
  {
    "DisplayName": "Thomas A. Barnico",
    "area1": "Administrative & Government Law",
    "area2": "Clinical & Experiential Education",
    "area3": "Ethics & Professional Responsibility",
    "acfacAreas": "Administrative & Government Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-barnico.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/thomas-barnico/_jcr_content/profileImage.img.png",
    "SortName": "Barnico, Thomas A.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Mr. Barnico is a visiting faculty member at Boston College Law School, teaching Administrative Law, the Legal Externship Seminar, and the Attorney General Clinical Progam and Seminar. He has directed the AG Program since 1989. In 2010-2011 and 2012-2013, he was a visiting professor at the Law School, teaching Federal Courts and Administrative Law in addition to the Attorney General Clinical Program. He also coaches the BC Law team in the Braxton Craven Constitutional Law Moot Court Competition at the University of North Carolina Law School. Mr. Barnico served as an Assistant Attorney General for the Commonwealth of Massachusetts from 1981 to 2010. He represented the state and its officers in civil cases involving constitutional law, administrative law, and business regulation. He has argued three cases in the United States Supreme Court, 18 cases in the United States Court of Appeals for the First Circuit, and 72 cases in the Supreme Judicial Court of Massachusetts. Mr. Barnico received his A.B. degree from Dartmouth College in 1977.l He received his J.D. degree from Boston College Law School in 1980. He served as an Assistant District Attorney in Essex County (MA) in 1980 and 1981."
  },
  {
    "DisplayName": "Charles H. Baron",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/charles-baron.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/charles-baron/_jcr_content/profileImage.img.png",
    "SortName": "Baron, Charles H.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Professor Baron, recently retired from active teaching, has written extensively here and in Europe about constitutional law and patients' rights. He has taught courses in federal, state, and comparative constitutional law, health law, and law and bioethics. Among the faculties abroad where he has held visiting positions are Oxford University, the University of Paris X, the Hebrew University of Jerusalem, the University of Aix-Marseilles III, and the European University Institute in San Domenico di Fiesole. He is a member of the Scientific Committee of the European Centre for Life Sciences, Health, and the Courts, a member of the Board of Directors of the Death with Dignity National Center, and a Past President of the American Civil Liberties Union of Massachusetts."
  },
  {
    "DisplayName": "Paulo Barrozo",
    "area1": "Criminal Law & Procedure",
    "area2": "Legal History & Jurisprudence",
    "area3": "International & Comparative Law; Civil & Human Rights Law; Ethics & Professional Responsibility; Family & Estate Law;",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paulo-barrozo.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/paulo-barrozo/_jcr_content/profileImage.img.png",
    "SortName": "Barrozo, Paulo",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Paulo Barrozo is a theorist whose work has offered new understandings of rights, punishment, cruelty, structural mercy, the political, and the origins and nature of modern law and institutions. His current work focuses on sovereignty and reason, constructive formalism, reflective evolution and futurism, normative imagination, and the transformation of legal education. Barrozo received an S.J.D. from Harvard Law School and a Ph.D. in Political Science from the Rio de Janeiro University Research Institute. Before joining Boston College Law School, he was a Lecturer in social thought at Harvard University, where he was the first recipient of the Stanley Hoffman Prize for Excellence in Teaching. Barrozo is an active advocate for the rights of the neurodiverse and the unparented."
  },
  {
    "DisplayName": "Sharon Beckman",
    "area1": "Clinical & Experiential Education",
    "area2": "Criminal Law & Procedure",
    "area3": "Ethics & Professional Responsibility; Civil & Human Rights Law;",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/sharon-beckman.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sharon-beckman/_jcr_content/profileImage.img.png",
    "SortName": "Beckman, Sharon",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Sharon Beckman is Co-Director of the Boston College Criminal Justice Clinic and Director of the Boston College Innocence Project. She is an honors graduate of Harvard College and the University of Michigan Law School, where she was Editor-in-Chief of the Michigan Law Review and received the Henry M. Bates Memorial Scholarship, the Law School's top honor. She served as a law clerk to the Hon. Sandra Day O'Connor of the Supreme Court of the United States and to Hon. Frank Coffin of the United States Court of Appeals for the First Circuit. She serves on the SJC Standing Committee on Eyewitness Identification, the Board of the New England Innocence Program, and on the Criminal Justice Act Appellate Panel of the U.S. Court of Appeals for the First Circuit. A Boston College Law School faculty member since 1996, Professor Beckman is the recipient of numerous teaching awards, including the University Distinguished Teaching Award, the highest teaching honor bestowed by Boston College. She has received the Law School's Emil Slizewski Award for Faculty Excellence and the Ruth-Arlene Howe Black Law Students Association Faculty Member of the Year Award. In addition to her clinics, Professor Beckman has taught Criminal Law, Criminal Procedure, Constitutional Law, and seminars on the Supreme Court, White Collar Crime, and Punishment. Prior to joining the BC Law faculty, Professor Beckman practiced law for seven years with the Silverglate, Gertner firm in Boston and Jenner & Block in Chicago. Her practice included criminal and civil litigation in state and federal trial and appellate courts, administrative agency proceedings, and internal corporate investigations. By appointment as a member of the Equal Justice Act Panel, Professor Beckman continues to represent indigent appellants in the United States Court of Appeals for the First Circuit. The former Captain of the Harvard Women's Swimming and Water Polo teams, Beckman was the First New England woman to swim across the English Channel and was ranked first in the United States and third in the world among female marathon swimmers. She is a Nationally ranked U.S. Masters Swimmer and serves on the National Board of Review for USA Swimming."
  },
  {
    "DisplayName": "Jessica Berry",
    "area1": "Clinical & Experiential Education",
    "area2": "Health Law & Policy",
    "area3": "Ethics & Professional Responsibility",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jessica-berry.html",
    "Image": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jessica-berry/_jcr_content/profileImage.img.png",
    "SortName": "Berry, Jessica",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Jessica Berry will join Boston College Law School in January 2025 as Associate Clinical Professor where she will direct a clinic focused on representation and systemic reform that challenges harmful state intervention and promotes autonomy and opportunity in the lives of children, youth, and families. Berry comes to BC Law from the Children’s Law Center of Massachusetts (CLCM) where she has worked for 15 years representing youth ages 0-22 in state invention, education, and mental health-related matters and advocating to reform the state’s child welfare system. From 2017 until 2022 she also taught and supervised students in BC Law’s Juvenile Rights Advocacy Program (JRAP).\n\nBerry earned her BA in Public Policy from the University of Chicago and her JD and an MSW from the University of Michigan. Following law school, Berry clerked for the Honorable Nathaniel M. Gorton of the United States District Court for the District of Massachusetts, and then for the Honorable Diana Gribbon Motz of the United States Court of Appeals for the Fourth Circuit. She was then awarded a Skadden Fellowship, which began her work at CLCM."
  },
  {
    "DisplayName": "Mary Sarah Bilder",
    "area1": "Legal History & Jurisprudence",
    "area2": "Property",
    "area3": "Family & Estate Law; Constitutional Law; Real Estate Law",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mary-sarah-bilder.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mary-sarah-bilder/_jcr_content/profileImage.img.png",
    "SortName": "Bilder, Mary Sarah",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Mary Sarah Bilder teaches in the areas of property, trusts and estates, and American legal and constitutional history at Boston College Law School. She received her B.A. with Honors (English) and the Dean's Prize from the University of Wisconsin at Madison, her J.D. (magna cum laude) from Harvard Law School, and her A.M. (History) and Ph.D. from Harvard University in the History of American Civilization/American Studies. She was a law clerk to the Hon. Francis Murnaghan, Jr., U.S. Court of Appeals, Fourth Circuit. Her recent work has focused on the history of the Constitution, James Madison and the Founders, the history of judicial review, and colonial and founding era constitutionalism. Professor Bilder is a member of the American Law Institute, the Colonial Society of Massachusetts, the Massachusetts Historical Society, and a Fellow of the American Bar Foundation. She is member of the Massachusetts Bar Association (inactive status) and the State Bar of Wisconsin (inactive status). She was given the Emil Slizewski Faculty Teaching Award in 2007 and was named Michael and Helen Lee Distinguished Scholar in 2009. She was named the Founders Professor of Law in 2016. Her most recent book, Madison's Hand: Revising the Constitutional Convention, was awarded the 2016 Bancroft Prize in American History and Diplomacy, and was named a finalist for the George Washington Book Prize. Richard Beeman, author of Our Lives, Our Fortunes and Our Sacred Honor, called it 'an exceptionally important piece of work that will have a profound impact on all future work on the Constitutional Convention.' Read more reviews. She is the author of The Transatlantic Constitution: Colonial Legal Culture and the Empire (Harvard University Press, 2004), awarded the Littleton-Griswold Award from the American Historical Association. Her articles appear in several important collected volumes of essays and a wide variety of journals, including the Yale Law Journal, the Stanford Law Review, the Yale Journal of Law and the Humanities, the George Washington Law Review, Law and History Review, Law Library Journal, and the Journal of Policy History. She co-edited Blackstone in America: Selected Essays of Kathryn Preyer (Cambridge University Press, 2009). She has received a William Nelson Cromwell Foundation Grant, the Boston College Annual Prize for Scholarship, a Boston College Distinguished Research Award, a Mellon Fellowship in the Humanities, and was a Boston College Law School Fund Scholar. She currently serves on the Editorial Board of Law and History Review, and The Journal of Legal Education, the Board of The New England Quarterly, and is a member of the American Law Institute, the Colonial Society of Massachusetts, and the Massachusetts Historical Society. She was the Lucy G. Moses Visiting Professor at Columbia Law School in 2001 and was a visiting professor at Harvard Law School in the spring of 2008. Professor Bilder is the author of a renowned blog entry on how to teach the Rule Against Perpetuities in one class hour, has been interviewed by The Documentary Group and History Channel, and served as a legal history consultant to Steven Spielberg on Amistad."
  },
  {
    "DisplayName": "Robert Bloom",
    "area1": "Criminal Law & Procedure",
    "area2": "Civil Litigation & Procedure",
    "area3": "Civil & Human Rights Law",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/robert-bloom.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/robert-bloom/_jcr_content/profileImage.img.png",
    "SortName": "Bloom, Robert",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Robert M. Bloom, Professor of Law, has had legal experience in legal services, civil rights law, and as a criminal attorney, both a defense lawyer and prosecutor. He also has been a court-appointed master on complicated civil cases. He is the author of numerous publications in the area of criminal procedure and civil procedure. Professor Bloom has received the Public Interest Law Foundation Faculty Member of the Year Award (2010); the Emil Slizewski Teacher of the Year Award (2009); and the Ruth Arlene Howe Faculty Member of the Year award from the Black Law Students Association (2003)."
  },
  {
    "DisplayName": "E. Joan Blum",
    "area1": "Clinical & Experiential Education",
    "area2": "Legal Research",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joan-blum.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/joan-blum/_jcr_content/profileImage.img.png",
    "SortName": "Blum, E. Joan",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "E. Joan Blum received her B.A. degree summa cum laude from Harvard University in 1975, where she was elected to Phi Beta Kappa. In 1978 she received her J.D. from Columbia Law School, where she was a Harlan Fiske Stone Scholar and a member of the Law Review. She was admitted to practice in Massachusetts in 1978, and in 1978-79 she was Law Clerk to Justice Robert Braucher on the Massachusetts Supreme Judicial Court. Between 1979 and 1984, she was an associate at Palmer & Dodge in Boston, where she practiced primarily in the area of tax-exempt financing. She joined the faculty of Boston College Law School in 1985, and currently is an Associate Professor of Legal Reasoning, Research & Writing. In addition to teaching in the first-year LRR&W course, Professor Blum for several years taught an upper-level seminar in Legal Drafting and has consulted with Boston law firms on legal writing issues."
  },
  {
    "DisplayName": "Cheryl S. Bratt",
    "area1": "",
    "area2": "Family & Estate Law",
    "area3": "Clinical & Experiential Education",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/cheryl-bratt.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/cheryl-bratt/_jcr_content/profileImage.img.png",
    "SortName": "Bratt, Cheryl S.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Before joining the Boston College Law School faculty, Cheryl Bratt worked at Harvard Law School as a Lecturer on Law and the Assistant Director of Harvard's Child Advocacy Program. Previously, she was a fellow at the University of Michigan Law School's Pediatric Advocacy Clinic, where she taught courses and supervised students litigating family, special education, and domestic violence cases.Before entering academia, she was a litigation senior associate at WilmerHale LLP in Boston, Massachusetts where she represented parties at the trial, appellate, and U.S. Supreme Court level in securities actions and pro bono education and family law matters. She clerked for the Honorable Norman H. Stahl on the U.S. Court of Appeals for the First Circuit and for the Honorable Mary A. McLaughlin on the U.S. District Court for the Eastern District of Pennsylvania. She is admitted to practice in Massachusetts and Michigan. Professor Bratt graduated with high distinction from the University of Michigan in 2001 and magna cum laude from the University of Michigan Law School in 2008. Before law school, she taught eighth grade language arts in New Orleans, Louisiana, through Teach For America and later worked for the organization as a regional director.She was also a paralegal for the Legal Advisor to the Government of Eritrea."
  },
  {
    "DisplayName": "Mark S. Brodin",
    "area1": "Civil Litigation & Procedure",
    "area2": "Criminal Law & Procedure",
    "area3": "Labor & Employment Law; Civil & Human Rights Law;",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mark-brodin.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mark-brodin/_jcr_content/profileImage.img.png",
    "SortName": "Brodin, Mark S.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Mark S. Brodin is Professor of Law, Michael and Helen Lee Distinguished Scholar, and former Associate Dean for Academic Affairs at Boston College Law School. A graduate of Columbia College and Columbia Law School (where he served on the Law Review), Professor Brodin clerked for United States District Judge Joseph L. Tauro from 1972 to 1974. He was Staff Counsel with the Lawyers' Committee for Civil Rights Under Law of the Boston Bar Association from 1974 to 1980, representing plaintiffs in civil rights actions including DeGrace v. Rumsfeld, 614 F. 2d 796 (1st Cir. 1980); N.A.A.C.P. Boston Chapter v. Harris, 607 F. 2d 514 (1st Cir. 1979); Harris v. White, 479 F. Supp. 996 (D. Mass. 1979); Cooke v. Sarni Original Dry Cleaners, 2 M.D.L.R. 1012 (1980), aff'd 388 Mass. 611 (1983) (trial counsel). Professor Brodin has published extensively in the areas of employment discrimination, constitutional criminal procedure, evidence and litigation. He is the author of numerous law review articles and co-author of Handbook of Massachusetts Evidence (Sixth, Seventh, and Eighth Editions) with Hon. Paul J. Liacos and Michael Avery (Aspen, 2007), Criminal Procedure: Examples and Explanations (First, Second, Third, Fourth, Fifth and Sixth Editions) with Robert M. Bloom (Aspen, 2009) and Civil Procedure: Doctrine, Practice and Context (First, Second and Third Editions) (with Stephen Subrin, Martha Minow, and Thom Main) (Aspen 2008). Professor Brodin has served for brief periods as an appellate attorney with the Massachusetts Defenders Committee (now the Committee for Public Counsel) and as a special assistant district attorney with the Norfolk County District Attorney. His latest book, William P. Homans Jr.: A Life In Court, is a biography of the well-known Boston lawyer and activist. Professor Brodin was named BC Law's 2002-2003 Faculty Member of the Year by the Law Students Association. The Black Law Students Association awarded him the Ruth Arlene Howe Award in both 2005 and 2006, and the Anthony P. Farley Excellence in Training Award in 2008-2009."
  },
  {
    "DisplayName": "Christopher L. Brown",
    "area1": "Business Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/christopher-brown.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/christopher-brown/_jcr_content/profileImage.img.png",
    "SortName": "Brown, Christopher L.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Chris Brown is a graduate of Colgate University and Boston College Law School. While at BC Law, Mr. Brown was a member of the Boston College Third World Law Journal and participated in the Moot Court and Mock Trial Competitions. He also served as a Student Law Clerk for the Hon. Jonathan Brant in the Middlesex County District Court and was a Student Prosecutor in the Middlesex County District Attorney's Office, Appellate Division. Mr. Brown also serves as an Adjunct Professor of Entertainment Law and Sports Law at Boston College Law School and is a Certified Players Representative with the National Basketball Association Players Union. Mr. Brown has represented various artists, producers and entertainment personalities. Some of Mr. Brown's present and former clients include Octagon Sports, Major League Baseball pitcher David Wells and R&B Singer Freddie Jackson. Mr. Brown concentrates his practice in Intellectual Property, Corporate Litigation, Product Liability, Negligence Defense, Construction Law, Election Law and Sports and Entertainment Law at Brown & Rosen LLC. He will teach Entertainment Law in the Fall."
  },
  {
    "DisplayName": "George D. Brown",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/george-brown.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/george-brown/_jcr_content/profileImage.img.png",
    "SortName": "Brown, George D.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "George Brown is the Robert Drinan, S.J., Professor of Law. Most recently he served as Interim Dean of the Law School, 2010-2011. He is a specialist in the field of federal-state relations and government ethics. In both areas he draws on his extensive experience in state government. He has served as Legislative Assistant to the Governor of Massachusetts and as Assistant Attorney General of Massachusetts. In 1994, Governor William Weld appointed him Chair of the Massachusetts State Ethics Commission. In the field of federal-state relations, Professor Brown is best known for his articles on the jurisdiction of federal courts and on the federal grant-in-aid system. He has also served as Chair of the Section on Federal Courts of the Association of American Law Schools. In the field of government ethics, Professor Brown has written several articles on recent judicial developments. His current research focuses on the role of the courts in the War on Terror."
  },
  {
    "DisplayName": "Andrew M. Buttaro",
    "area1": "Corporate & Securities Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Andrew-Buttaro.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Andrew-Buttaro/_jcr_content/profileImage.img.png",
    "SortName": "Buttaro, Andrew M.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Andrew M. Buttaro advises clients on sophisticated legal issues in complex litigation and appellate matters. A former law clerk to two appellate courts, he has successfully briefed and argued cases before the federal courts of appeals and state courts of last resort. Mr. Buttaro has drafted winning briefs on high-stakes issues in securities cases, shareholder disputes, and commercial litigation matters. An experienced writer, he has been widely published and his legal scholarship has been cited in merits briefing before the US Supreme Court. Mr. Buttaro also has experience with issues at the intersection of law and public policy. He has worked on the legal team of a presidential campaign, evaluated nominees to the federal bench for the Senate Judiciary Committee, and provided research for a leading political action committee. Before attending law school, Mr. Buttaro worked in the speechwriting office of the White House and led a cross-country bicycle trip that raised money for affordable housing charities. He received his bachelor's degree in political science and history from Boston Colllege in 2007 before receiving both his master's in legal history and J.D. from the University of Virgina in 2012."
  },
  {
    "DisplayName": "Catharine Byrne",
    "area1": "Civil Litigation & Procedure",
    "area2": "Criminal Law & Procedure",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/catharine-byrne.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/catharine-byrne/_jcr_content/profileImage.img.png",
    "SortName": "Byrne, Catharine",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Hon. Catherine K. Byrne is a circuit justice of the Massachusetts District Court. She was appointed to the bench by former Governor Deval Patrick in 2012. During her tenure on the bench, Byrne has sat by designation in the Boston Municipal Court.Byrne began her legal career as an associate at Bowmar, Larkin, Lilly & Barton in 1985 before serving as a law clerk with the Massachusetts Superior Court the following year. Upon completion of her clerkship, Byrne became a staff attorney for the Committee for Public Counsel Services in 1987 and held that position until 2001 when she joined the Federal Defender's Office as an assistant federal public defender. Byrne was serving in that capacity at the time of her appointment to the bench in 2012.Her memberships include the Boston Bar Association, the Massachusetts Bar Association, the Massachusetts Association of Criminal Defense Lawyers (director), and the Greater Lowell Bar Association (director)."
  },
  {
    "DisplayName": "Sergio Campos",
    "area1": "Civil Litigation & Procedure",
    "area2": "Labor & Employment Law",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sergio-campos.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sergio-campos/_jcr_content/profileImage.img.png",
    "SortName": "Campos, Sergio",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Sergio J. Campos joined the Boston College Law School faculty in 2023. His research and teaching interests include civil procedure, federal courts, and comparative law, with a special focus on complex litigation. Before joining BC Law, he served on the faculty of the University of Miami School of Law, where he was director of the SJD Program and a co-director of the Seminario en Latinoamérica de Teoría Constitucional y Política (SELA), a consortium of law schools in the U.S., Latin America, the Caribbean, and Spain focused on hemispheric legal scholarship. He clerked for the Honorable Juan R. Torruella of the United States Court of Appeals for the First Circuit and the Honorable Patti B. Saris of the United States District Court for the District of Massachusetts. He received his A.B. from Harvard College and his JD from Yale Law School."
  },
  {
    "DisplayName": "Tom Carey",
    "area1": "Clinical & Experiential Education",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-carey.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/thomas-carey/_jcr_content/profileImage.img.png",
    "SortName": "Carey, Tom",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Tom Carey is an attorney at Hogan Lovells. He currently teaches in the Amicus Brief Clinic and coaches the School's National Moot Court Team. He has been on the Adjunct Faculty for more than a decade, teaching a seminar in Appellate Advocacy and working with various moot court programs. He has had a long association with the school as a student, faculty member, and active alumnus. After earning an AB in government, Carey took his LLB (J.D.) from Boston College Law School in 1965, receiving several academic awards. He also holds an LLM degree from Harvard Law School. Following clerkships with Judge Caffrey and Judge Murray in the United States District Court for the District of Massachusetts, he spent a decade in full-time law teaching at Suffolk and Boston College Law Schools, teaching a wide variety of courses and working with the advocacy programs. He has coached BC national championship teams in the National Moot Court Competition and the National Constitutional Law Moot Court Competition. Carey is active across many of Hogan Lovell's practice areas, having handled numerous civil and criminal appeals in state and federal courts in more than four decades of service as an appellate advocate. He is acquainted with issues arising out of virtually every possible sector of commerce and industry, successfully briefing and arguing cases on appeal to the Massachusetts Supreme Judicial Court, the Massachusetts Appeals Court, and the U.S. Court of Appeals for the 1st Circuit. He has briefed and argued appellate matters involving substantive legal issues related to many different legal disciplines, including but not limited to administrative law, banking and finance, civil rights and constitutional law, and corporate/securities matters. Additional issues include employment, governmental enforcement, healthcare, and intellectual property matters. Carey is passionate about serving others, not only as an advocate for his clients, but as a teacher and a civic volunteer. He also served as the appellate attorney for the Major Violators Division of the Suffolk County District Attorney's Office, prosecuting many violent criminals and recidivist offenders."
  },
  {
    "DisplayName": "Gerry Caron",
    "area1": "Corporate & Securities Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Gerry-Caron.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Gerry-Caron/_jcr_content/profileImage.img.png",
    "SortName": "Caron, Gerry",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Mr. Caron received his B.A. from Boston College in 1984 before earning his J.D. from Boston College Law School in 1988. He currently serves as Chief Counsel SH&E at Cabot Corporation. Prior to working for the Cabot Corporation Mr. Caron was an associate at Goodwin Proctor LLP from 1989-1997 and a partner from 1997-1998. He also worked as a judicial law clerk at the US District Court for the District of Massachusetts from 1998-1999 before transitioning to his role with the Cabot Corporation."
  },
  {
    "DisplayName": "Eugenia Carris",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/eugenia-carris.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/eugenia-carris/_jcr_content/profileImage.img.png",
    "SortName": "Carris, Eugenia",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Eugenia M. Carris received her bachelor's degree with honors from Harvard University and is a proud graduate of Boston College Law School.Following law school, she clerked for The Honorable Mark L. Wolf of the District of Massachusetts.She worked as a litigation associate at Goodwin Procter.She has extensive litigation and trial experience, having worked as a Special Assistant District Attorney and for the Massachusetts Attorney General's Office.She has been an Assistant United States Attorney in the District of Massachusetts since 2002, handling both civil and criminal cases on behalf of the United States."
  },
  {
    "DisplayName": "R. Michael Cassidy",
    "area1": "Criminal Law & Procedure",
    "area2": "Civil Litigation & Procedure",
    "area3": "Ethics & Professional Responsibility",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/michael-cassidy.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/michael-cassidy/_jcr_content/profileImage.img.png",
    "SortName": "Cassidy, R. Michael",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor R. Michael Cassidy teaches and writes in the areas of Criminal Law, Evidence, and Professional Responsibility. He is considered an expert on the subject of prosecutorial ethics, and provides training nationally to public sector attorneys on their responsibilities under the Rules of Professional Conduct. He is quoted frequently by the media on subjects relating to criminal law and ethics, including appearing in the New York Times, the Boston Globe, and the Boston Herald. He is the Faculty Director of the Rappaport Center for Law and Public Policy. During his extensive career as a government lawyer prior to joining the BC community, Professor Cassidy prosecuted hundreds of serious felony cases involving narcotics trafficking, organized and white collar crime, and public corruption. He has also briefed and argued numerous high-profile criminal matters before the Massachusetts Supreme Judicial Court. From 1993 to 1996, Professor Cassidy served as Chief of the Criminal Bureau in the Massachusetts Attorney General's Office under then Attorney General Scott Harshbarger. Among his many professional and community activities, Professor Cassidy has served as a member of the Massachusetts State Ethics Commission, as Editor-in-Chief of the Massachusetts Law Review, as a member of the Governor's Commission on Corrections Reform, as a hearing officer for the Massachusetts Board of Bar Overseers, as a member of the Criminal Justice Section Council of the Boston Bar Association, as an Advisor to the National District Attorneys' Association, and as a member of the Massachusetts Judicial Nominating Commission. Professor Cassidy was recently appointed to serve a three year term on the Supreme Judicial Court's Standing Advisory Committee on the Rules of Professional Conduct. He is active in local government, youth sports and religious education in his hometown of Winchester, Massachusetts. Professor Cassidy was elected to the American Law Institute in 2012. Professor Cassidy received his B.A. degree, magna cum laude, from the University of Notre Dame, and his J.D. degree, magna cum laude, from Harvard Law School. Following law school he served as law clerk to the Honorable Edward F. Hennessey, Chief Justice of the Massachusetts Supreme Judicial Court, and then as a litigation associate at the Boston law firm of Foley, Hoag. Professor Cassidy served as Associate Dean for Academic Affairs from 2007-2010 and as Associate Dean for Administration and Finance from 1996 to 2002. He is currently serving as the faculty director of the Rappaport Center for Law and Public Policy. He has twice been awarded the Emil Slizewski prize for distinguished teaching by the graduating class at commencement."
  },
  {
    "DisplayName": "Mary Ann Chirba",
    "area1": "Health Law",
    "area2": "Clinical & Experiential Education",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/maryann-chirba.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/maryann-chirba/_jcr_content/profileImage.img.png",
    "SortName": "Chirba, Mary Ann",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Mary Ann Chirba holds a bachelor's degree in biology from Colgate University and a J.D., magna cum laude, from Boston College Law School. She holds a Doctorate of Science in Health Policy and Management as well as a Master's in Public Health from the Harvard School of Public Health. She is the author, along with Alice Noble and Michael Maddigan, of Health Care Reform: Law and Practice - A Comprehensive Guide to the Affordable Care Act and its Implementing Regulations, a major new treatise published by Lexis Nexis/Matthew Bender in 2013. Since 1984, Professor Chirba has taught a variety of courses at Boston College Law School, including Legal Reasoning Research & Writing, Health Care Law and Policy I and II, Advocacy Writing, Advanced Legal Writing, and Product Liability Law. In 1999, she was appointed Assistant Professor of Legal Reasoning, Research & Writing at Boston College Law School and continues to teach a variety of health law courses. Professor Chirba currently lectures on various health law issues at Harvard Medical School, Children's Hospital of Boston, and Tufts Medical School. A former litigator, she has also been certified by the American Health Law Association as a mediator and arbitrator. In past years, Professor Chirba has been an adjunct faculty member at the Harvard School of Public Health, where she taught courses on Pharmaceutical Product Safety, 'The Tobacco Wars,' Current Developments in Health Law, Managed Care Law & Regulation, and Medical Malpractice & Risk Management. Her current research interests are varied and include legal protections for disabled children, the use of law and regulation to promote medical product safety, emerging federal and international guidelines for stem cell research, and federal and state health care reform, including ERISA preemption of state efforts to regulate managed care."
  },
  {
    "DisplayName": "Jeffrey M. Cohen",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "Corporate & Securities Law",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/jeffrey-cohen.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jeffrey-cohen/_jcr_content/profileImage.img.png",
    "SortName": "Cohen, Jeffrey M.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Jeffrey M. Cohen received his J.D. from Stanford Law School. He has also received a masters degree from Oxford University in Social Anthropology. He received his B.A. from the University of Pennsylvania. His primary research interests include criminal law and procedure, especially in the areas of corporate sentencing and punishment.Jeffrey was an Assistant United States Attorney in the District of Massachusetts, where he prosecuted and tried numerous high-profile public corruption and government fraud cases. Before joining the U.S. Attorney's Office, he worked at the Department of Justice in Washington D.C. as an Honors Program Trial Attorney, where he litigated civil False Claims Act cases around the country. Jeffrey clerked at the United States District Court in Massachusetts for Judge Reginald C. Lindsay and at the Supreme Judicial Court of Massachusetts for Chief Justice Margaret H. Marshall. Jeffrey Prior to joining BC, Jeffrey was a Acting Assistant Professor at New York University School of Law.Before NYU, he was a Visiting Assistant Professor at Boston University School of Law, where he taught courses in white collar crime and criminal trial practice."
  },
  {
    "DisplayName": "Felipe Ford Cole",
    "area1": "Legal History & Jurisprudence",
    "area2": "International & Comparative Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/felipe-cole.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/felipe-cole/_jcr_content/profileImage.img.png",
    "SortName": "Cole, Felipe Ford",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Felipe Ford Cole joined BC Law as an Assistant Professor of Law in 2022. He studies how the law shapes the balance between sovereign power and the power conferred to private capital in local, national, and international contexts. As a comparative legal historian, Professor Cole's research focuses on the historical evolution of this balance in the U.S. and Latin America. Cole's current research explores the evolution of public debt markets and the theory of sovereignty in the U.S. and Latin America and reexamines of the origins of the core doctrines of international investment law. Professor Cole's work has been published or is forthcoming in the University of Chicago Law Review, the University of Chicago Law Review Online, and in edited volumes published by Cambridge University Press and Oxford University Press. Before coming to BC Law, Cole was a Sharswood Fellow at the University of Pennsylvania Carey Law School. Professor Cole earned a JD from Northwestern University School of Law and is completing a PhD in history at Northwestern University. He also earned an MPhil in Latin American Studies from the University of Cambridge and a BA in history from New York University."
  },
  {
    "DisplayName": "Jennifer Connor",
    "area1": "Clinical & Experiential Education",
    "area2": "Family & Estate Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jennifer-connor.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jennifer-connor/_jcr_content/profileImage.img.png",
    "SortName": "Connor, Jennifer",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Jennifer Connor's law practice provides individuals and families with a range of estate planning services, including wills, trusts, power of attorneys, health care proxies, guardianship documents, and tax planning. She works with clients to educate them on the estate process, advise them on their options, and counsel them on the best products to meet their needs."
  },
  {
    "DisplayName": "Daniel R. Coquillette",
    "area1": "Legal History & Jurisprudence",
    "area2": "Ethics & Professional Responsibility",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-coquillette.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/daniel-coquillette/_jcr_content/profileImage.img.png",
    "SortName": "Coquillette, Daniel R.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "The author of Lawyers and Fundamental Moral Responsibility, The Anglo-American Legal Heritage, Francis Bacon, and The Civilian Jurists of Doctor's Commons and editor of Law in Colonial Massachusetts and Moore's Federal Practice, J. Donald Monan Professor of Law Daniel R. Coquillette teaches and writes in the areas of legal history and professional responsibility. Professor Coquillette was a law clerk for justice Robert Braucher of the Supreme Judicial Court of Massachusetts and Chief Justice Warren E. Burger of the Supreme Court of the United States. He taught legal ethics on the faculty of the Boston University Law School, taught as a Visiting Professor at Cornell Law School and Harvard Law School, and became a partner for six years at the Boston law firm of Palmer & Dodge, where he specialized in complex litigation. He served as Dean of Boston College Law School from 1985-1993, and was named J. Donald Monan, S.J. University Professor in 1996. Among his many activities, Professor Coquillette is an Advisor to the American Law Institute's Restatement on Law Governing the Legal Profession, a member of the Harvard University Overseers' Committee to Visit Harvard Law School, and Reporter to the Committee on Rules of Practice and Procedure, Judicial Conference of the United States. For five years, he was Chairman of the Massachusetts Bar Association Committee on Professional Ethics and Chairman of the Task Force on Unauthorized Practice of Law. He also served on the American Bar Association Committee on Ethics and Professional Responsibility, the Board of the American Society of Legal History, the Massachusetts Task Force on Model Rules of Professional Conduct and the Massachusetts Task Force on Professionalism. He was also a member of the Special Committee on Model Rules of Attorney Conduct of the Supreme Judicial Court of Massachusetts."
  },
  {
    "DisplayName": "Daniel Crane",
    "area1": "Civil Litigation & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-crane.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/daniel-crane/_jcr_content/profileImage.img.png",
    "SortName": "Crane, Daniel",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Chopas is a BC Law graduate. After law school, she clerked for Justice William R. Johnson of the New Hampshire Supreme Court and worked as a litigation associate before becoming the assistant attorney general in Government Bureau/Trial Division of the Massachusetts Office of the Attorney General."
  },
  {
    "DisplayName": "Glenn Cunha",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/glenn-cunha.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/glenn-cunha/_jcr_content/profileImage.img.png",
    "SortName": "Cunha, Glann",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Glenn A. Cunha has been the Massachusetts Inspector General since 2012 when he was appointed to his first five-year term. In 2017, he was reappointed for a second five-year term. Glenn has worked in the public and private sectors for 30 years, building complex investigations, prosecuting cases in court and preventing and detecting fraud in many areas, including insurance, public benefits, charities and fraud by public officials. For 8 years Glenn served in the Attorney General's office, where he was chief of the Insurance & Unemployment Fraud Division. He was also the managing attorney of the Criminal Bureau, where he oversaw the management of eight divisions and supervised investigations and prosecutions relative to financial fraud, probation, lottery, fraudulently produced MBTA passes, human trafficking, child pornography and a case of complex fraud by a charity. Prior to this, Glenn worked in the Suffolk County District Attorney's Office as an Assistant District Attorney. He prosecuted serious cases, trying numerous Superior Court jury trials, from violent assaults involving children to firearm possession and drug distribution. Glenn's experience also includes serving as the Deputy Chief of the Child Abuse Unit and as an Assistant District Attorney in Norfolk County. Glenn holds a B.A. in Economics from Boston College, an M.B.A. from Bentley University Graduate School of Management and a J.D. from Suffolk University Law School. Glenn earned his Certified Inspector General (CIG) credential from the Association of Inspectors General in 2016.He became a Certified Fraud Examiner (CFE) in 2018. Glenn is an avid triathlete and former member of the Brookline School Committee. He resides in Brookline with his spouse and two children."
  },
  {
    "DisplayName": "Stephen Curran",
    "area1": "Criminal Law & Procedure",
    "area2": "Civil Litigation & Procedure",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Stephen-Curran.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/glenn-cunha/_jcr_content/profileImage.img.png",
    "SortName": "Curran, Stephen",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Stephen Curran is an adjunct faculty member at the Boston College Law School, teaching federal criminal civil rights law. Curran served as a federal prosecutor with the Civil Rights and Criminal Divisions of the U.S. Department of Justice from 1998 to 2018. For most of this period, he was a litigating attorney, deputy chief, and special litigation counsel in the Criminal Section of the Civil Rights Division, where he investigated and prosecuted cases involving bias-motivated violence, official misconduct, and involuntary servitude. He has served as the Civil Rights Division's lead prosecutor in numerous hate crime and law enforcement misconduct cases, including the 2015 race-motivated killings at the Emmanuel AME church in Charleston (US v. Roof), the 2017 bias-motivated mass car attack on anti-racism protestors in Charlottesville (US v. Fields), and the 2004 beating of a young, multi-racial man by Milwaukee police officers (US v. Bartlett).During his Justice Department tenure, Curran also served in the Criminal Division's Human Rights and Special Prosecutions Section, where he investigated and prosecuted criminal cases involving human rights and war crimes, human rights and war crimes-related immigration and naturalization fraud, international violent crimes, and international criminal travel networks. Curran also served as a civil prosecutor in the Civil Rights Division's Employment Litigation Section, where he investigated and litigated civil actions enforcing Title VII against state and local government employers, as well as cases defending federal contracting and employment-related affirmative action programs.Curran received a B.A. degree from Bates College in 1981, and a J.D. degree from Georgetown University in 1996. He also received a M.A. degree in National Security Studies from Georgetown University in 1989. Prior to his legal career, Curran served as an intelligence officer in the United States Navy, between 1982-1993."
  },
  {
    "DisplayName": "Rosemary Daly",
    "area1": "Clinical & Experiential Education",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/rosemary-daly.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/rosemary-daly/_jcr_content/profileImage.img.png",
    "SortName": "Daly, Rosemary",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Rosemary Daly is the director of BC Law's advocacy programs."
  },
  {
    "DisplayName": "Joseph B. Darby III",
    "area1": "Business Law",
    "area2": "Tax Law",
    "area3": "Family & Estate Law",
    "acfacAreas": "Business Law; Tax Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/joseph-darby.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/joseph-darby/_jcr_content/profileImage.img.png",
    "SortName": "Darby, Joseph B.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Joseph B. Darby III is a partner in Sullivan & Worcester's Boston office, focusing his practice on business and transactional tax law. Mr. Darby advises a wide variety of corporations and high-net-worth individuals on tax and legal aspects of business and real estate activities and represents these taxpayers before federal and state taxing authorities. He also works with high-net-worth individuals and business owners to organize their personal income tax and estate planning affairs in order to maximize wealth preservation and minimize tax on transfers to family members, charities and other recipients. This is accomplished through the use of the latest sophisticated estate planning strategies, including family limited partnerships, installment sales to defective grantor trusts, the formation of family charitable foundations, and other similar techniques."
  },
  {
    "DisplayName": "Claire Donohue",
    "area1": "Clinical & Experiential Education",
    "area2": "Criminal Law & Procedure",
    "area3": "Family & Estate Law; Health Law",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/claire-donohue.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/claire-donohue/_jcr_content/profileImage.img.png",
    "SortName": "Donohue, Claire",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Claire Donohue joined Boston College Law School in 2018 as an Assistant Clinical Professor. Professor Donohue coordinates social work services for the clinics in the Center for Experiential Learning. Professor Donohue's teaching within the clinic and in her classes incorporates social work methodology and theory with legal theory and practice. Professor Donohue joins the BC Law community from law clinics in the District of Columbia. Professor Donohue was a Practitioner in Residence at American University's Washington College of Law. She directed the Domestic Violence Clinic, where she taught students with a docket of family law, civil protection orders, victim witness advocacy, and immigration cases. Previously, Professor Donohue was a Friedman Fellow with the Family Justice Litigation Clinic and The George Washington University School of Law, where she also earned an LLM. Here she guided students through family law and domestic violence law practice. She has also served as part-time faculty at Montgomery College in the Criminal Justice Department. Prior to devoting her career to clinical legal education, Professor Donohue worked as a Public Defender: first, with the Committee for Public Counsel Services in Massachusetts; and then accepting appointments on post-conviction appeals out of Massachusetts and the District of Columbia. Professor Donohue attended Boston College Law School as Public Interest Scholar. She graduated with a dual degree, a Masters in Social Work from the Boston College Graduate School of Social Work and a Juris Doctorate. During this time she was a project coordinator for an emerging program of interdisciplinary legal services at the Community Legal Services and Counseling Center in Cambridge, MA. She also served on the editorial staff of the Third World Law Journal (eventually renamed the Journal of Law and Social Policy) at Boston College Law School. Upon graduation Professor Donohue worked as a judicial law clerk for the Superior Court of the Commonwealth of Massachusetts."
  },
  {
    "DisplayName": "James Dowden",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-dowden.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/james-dowden/_jcr_content/profileImage.img.png",
    "SortName": "Dowden, James",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "James P. Dowden received his Bachelor of Arts degree magna cum laude from Boston College where he was elected to Phi Beta Kappa. He received his J.D. from Boston College Law School summa cum laude, was Articles Editor of the Boston College Law Review, and won the James W. Smith Award for the highest academic achievement in his class. Following law school, Mr. Dowden clerked for the Hon. Anthony Scirca, now Chief Judge of the Third Circuit in Philadelphia Pennsylvania as well as Associate Justice Stephen Breyer during the OT 04-05 term. Following his clerkships, Mr. Dowden was an Assistant United States Attorney with the U.S. Attorney's Office for the District of Massachusetts. He is currently an Associate in the Litigation Department at Ropes & Gray."
  },
  {
    "DisplayName": "Avlana Eisenberg",
    "area1": "Criminal Law & Procedure",
    "area2": "Civil & Human Rights Law",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/avlana-eisenberg.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/avlana-eisenberg/_jcr_content/profileImage.img.png",
    "SortName": "Eisenberg, Avlana",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Avlana Eisenberg joined the Boston College Law School faculty in 2023 as an associate professor and Dean's Distinguished Scholar. Her research focuses on the law and practice of criminal punishment, and she teaches courses in criminal law, criminal procedure, and prison law and policy. Eisenberg's writing has appeared in the NYU Law Review, Michigan Law Review, Vanderbilt Law Review, Southern California Law Review, and UCLA Law Review (among other journals) and in popular media outlets such as The Atlantic and The Washington Post. Her work on the political economy of criminal law draws on original interviews with institutional stakeholders—including prosecutors, police, and corrections leaders—to investigate how the incentives of these stakeholders affect legal and policy reform. Eisenberg is an elected member of the American Law Institute.Prior to joining the BC Law faculty, Eisenberg served as the Gary & Sallyn Pajcic Professor at Florida State University College of Law. She began her law teaching career at Harvard Law School, where she served as a Climenko Fellow and Lecturer on Law and as a fellow at the Edmond J. Safra Center for Ethics. Before entering law teaching, Eisenberg was a litigation associate at Jenner & Block LLP in Washington, D.C. and a pro bono fellow at the D.C. Public Defender Service. She earned her law degree with distinction from Stanford Law School and is a member of the California State Bar."
  },
  {
    "DisplayName": "Yan Fang",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Civil & Human Rights Law",
    "area3": "Labor & Employment Law",
    "acfacAreas": "Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/yan-fang.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/yan-fang/_jcr_content/profileImage.img.png",
    "SortName": "Fang, Yan",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Yan Fang teaches and writes on privacy law, evidence, and law, technology, and society.Her scholarship focuses on how legal actors and institutions adjust to changes in their informational environments and the impact of those changes on enforcement systems. Drawing on interviews and other qualitative research methods, she theorizes the organizational processes that shape legal actors' access to and use of evidence. Fang is also part of an interdisciplinary collaboration studying federal courts' disposition of disability discrimination cases, where she examines how judges evaluate evidence produced by organizations versus individuals. She earned an A.B. from Harvard College and a J.D. from the University of California, Berkeley, School of Law, after which she clerked for the Honorable Deborah L. Cook of the U.S. Court of Appeals for the Sixth Circuit and the Honorable Nancy F. Atlas of the U.S. District Court for the Southern District of Texas. She has also served as an attorney at the Federal Trade Commission and is currently completing a doctoral dissertation in the Jurisprudence and Social Policy Program at UC Berkeley."
  },
  {
    "DisplayName": "Daniel Farbman",
    "area1": "Legal History & Jurisprudence",
    "area2": "Civil & Human Rights Law",
    "area3": "Real Estate Law; Administrative Law; Constitutional Law; Ethics & Professional Responsibility",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/dan-farbman.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/dan-farbman/_jcr_content/profileImage.img.png",
    "SortName": "Farbman, Daniel",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Dan Farbman joined the Boston College Law faculty as an Assistant Professor of Law in 2017. He teaches and writes in the areas of local government law, legal history, constitutional law, the legal profession, civil rights, and property. His work focuses on the legal history of radical reform movements in public law both from an institutional perspective and from the perspective of the practice of cause lawyering. After he graduated from Amherst College in 2001, Dan spent a few years in New York City trying (and failing) to make it as a professional actor before he enrolled at Harvard Law School. After graduating in 2007, he was a clerk for Judge Margaret Morrow on the Central District of California in Los Angeles before beginning a Skadden Fellowship at Advancement Project in Washington, D.C. At Advancement Project he worked with community organizers around the country on grassroots efforts to fight racial injustice in public education with a particular focus on the school to prison pipeline. After leaving practice, Dan pursued a Ph.D. in American Studies at Harvard. For three years prior to joining Boston College, he was a Climenko Fellow and Lecturer on Law at Harvard Law School. While at Harvard, Dan taught Legal Research and Writing and a seminar on Legal Realism."
  },
  {
    "DisplayName": "Michael T. Fatale",
    "area1": "Clinical & Experiential Education",
    "area2": "Tax Law",
    "area3": "",
    "acfacAreas": "Tax Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/michael-fatale.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/michael-fatale/_jcr_content/profileImage.img.png",
    "SortName": "Fatale, Michael T.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Michael T. Fatale is the Deputy General Counsel at the Massachusetts Department of Revenue (DOR) where he has been employed since 1992.Previously he was for nearly ten years the Chief of DOR's Rulings and Regulations Bureau, and prior to that he was a tax counsel. Mr. Fatale is the primary author of numerous state tax regulations and other DOR pronouncements, and has litigated or co-litigated several high-profile DOR cases. He is the author of several law review articles on constitutional and federal preemption law that have been cited in various state tax cases, including cases decided by the Ohio, Iowa and West Virginia Supreme Courts and the New Mexico and California Courts of Appeal. For 2015, he received “honorable mention” as the state tax government person of the year from the Tax Analysts' publication State Tax Notes.In 2012, he was awarded the Paull Mines Award for Outstanding Contribution to State Tax Jurisprudence by the Multistate Tax Commission. In 2005, The Boston Globe reported on his leadership role in obtaining a large settlement in a bankruptcy case on behalf of eighteen states (“Hooray for the Taxman”). Mr. Fatale speaks frequently at state tax conferences, has previously been a guest lecturer at Georgetown University Law School, and is an instructor of state corporate income tax in a training program offered by the Multistate Tax Commission. Mr. Fatale worked in private practice before joining DOR and holds an undergraduate degree from Columbia University and a law degree, cum laude, from Boston College Law School."
  },
  {
    "DisplayName": "Lucien Ferguson",
    "area1": "Constitutional Law",
    "area2": "Civil & Human Rights Law",
    "area3": "",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/lucien-ferguson.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/lucien-ferguson/_jcr_content/profileImage.img.png",
    "SortName": "Ferguson, Lucien",
    "facultyStatus": "Visiting Faculty",
    "priority": 3,
    "biography": "Lucien Ferguson is a 2023-2025 Drinan Scholars Visiting Assistant Professor. Ferguson joins the distinguished line of scholars to have received the honor, including, most recently, Nicole Langston and CosmasEmeziem. Ferguson is a joint JD-PhD candidate at Pritzker School of Law/Northwestern University, where he currently studies law and political science. His research has largely focused on the history of race and caste in the United States. Ferguson's dissertation, “The Spirit of Caste: Recasting the History of Civil Rights,” reframes the civil rights movement as protest against a socially restrictive caste system. The Drinan Scholars program prioritizes candidates whose research interests focus on issues of race and law.A Chicago native, Ferguson worked in special education at Chicago Public Schools after graduating from Oberlin College, an experience he credits for galvanizing his interest in civil rights law to this day. While attending Northwestern/Pritzker, Ferguson was the recipient of a University Fellowship and the Franke Fellowship, awarded to “the most accomplished doctoral students pursuing an independent humanities research project.”"
  },
  {
    "DisplayName": "John M. Flackett",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/john-flackett.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/john-flackett/_jcr_content/profileImage.img.png",
    "SortName": "Flackett, John M.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Professor Flackett retired from active teaching duties in the Spring of 2001. His previous teaching subjects included Torts, Criminal Law, Mental Health Law, and Law, Values and Professional Identity. He also served as the director of international programs at Boston College Law School from 1991-2000."
  },
  {
    "DisplayName": "Sarah Frazier",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Civil Litigation & Procedure",
    "area3": "",
    "acfacAreas": "Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sarah-frazier.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sarah-frazier/_jcr_content/profileImage.img.png",
    "SortName": "Frazier, Sarah",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Sarah Frazier is a partner at WilmerHale and focuses her practice on intellectual property litigation and appeals in patent disputes before the US Court of Appeals for the Federal Circuit. She also maintains an active pro bono practice, and regularly represents clients in housing court and unemployment hearings. From 2015–2016, Frazier served as an assistant district attorney for the Middlesex District Attorney's Office. She is also a lecturer at Harvard Law School and a member of the Boston Bar Association."
  },
  {
    "DisplayName": "Donald Frederico",
    "area1": "Civil Litigation & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/don-frederico.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/don-frederico/_jcr_content/profileImage.img.png",
    "SortName": "Frederico, Donald",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Donald Frederico has practiced law in Massachusetts and represented clients in courts nationally for more than 40 years. For more than 25 years, he has focused his practice on class action litigation. He has chaired the class action practices of two national law firms and one regional firm, and serves on the Planning Committee of the American Bar Association's National Institute on Class Actions.​Frederico has handled a wide variety of class action and other complex litigation matters for his clients in numerous state and federal courts at both the trial and appellate levels. Among his many representations, he served as lead national class action counsel for a group of 14 pharmaceutical companies in the Diet Drug ("
  },
  {
    "DisplayName": "Frank J. Garcia",
    "area1": "International & Comparative Law",
    "area2": "Business Law",
    "area3": "Legal History & Jurisprudence; Civil & Human Rights Law;",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/frank-garcia.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/frank-garcia/_jcr_content/profileImage.img.png",
    "SortName": "Garcia, Frank J.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Frank J. Garcia joined the BC Law faculty in 2001. He had been an associate professor at the Florida State University College of Law since 1993. He has served as a Visiting Professor at a number of schools around the world including the University of Paris, the University of New South Wales in Sydney, the University of the Republic in Uruguay, the University of Houston Law Center, and as the Katherine A. Ryan Distinguished Visiting Professor at the St. Mary's University School of Law/University of Innsbruck, Austria. Professor Garcia received his B.A. in Religious Studies from Reed College in 1985, and his J.D. from the University of Michigan Law School in 1989. He was a law clerk for Andrews & Kurth in Texas and Davis Wright Tremaine in Oregon , and an associate in the Oregon firm Stoel Rives Boley Jones & Grey from 1990-1993. Professor Garcia was a Fulbright Scholar, as well as a professorial fellow at the Law Institute of the Americas, SMU School of Law, and the Associate Director of the Caribbean Law Institute, FSU College of Law. He has served on the Executive Board and as Vice-Chair of the ASIL International Economic Law and International Legal Theory Interest Groups, and on the Board of the Law School Admissions Council. He currently serves as book review editor and board member of the Journal of International Economic Law, and advises the BC International & Comparative Law Review."
  },
  {
    "DisplayName": "Lawrence Gennari",
    "area1": "Clinical & Experiential Education",
    "area2": "Corporate & Securities Law",
    "area3": "Business Law;",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/lawrence-gennari.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/lawrence-gennari/_jcr_content/profileImage.img.png",
    "SortName": "Gennari, Lawrence",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "A veteran of one of Boston's largest law firms, Lawrence Gennari co-founded Gennari Aronson LLP, to serve innovative companies, entrepreneurs and the investors and venture capital firms that finance them. He advises both public and private companies on all major areas of corporate and securities law. Mr. Gennari counsels entrepreneurs and public and private companies on a wide variety of issues including business and tax planning, financing strategy, negotiation, documentation and coordination of public and private equity transactions, initial and secondary public offerings, private and public mergers, acquisitions, strategic partnerships and management buyouts. He also has significant experience in counseling public companies on proxy contests and takeover defensive measures. Mr. Gennari received a B.S. in Accounting from North Adams State College (summa cum laude) and a J.D. from the College of William and Mary, where he served as editor-in-chief of the William & Mary Law Review."
  },
  {
    "DisplayName": "Jane Kent Gionfriddo",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/janekent-gionfriddo.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/janekent-gionfriddo/_jcr_content/profileImage.img.png",
    "SortName": "Gionfriddo, Jane Kent",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Jane Kent Gionfriddo began teaching in the Legal Reasoning, Research & Writing Program at Boston College Law School in 1982 and was admitted to practice in Massachusetts the same year. In 1985, she became the director of the program and held this position for twenty-two years. In May 1999, Professor Gionfriddo was awarded the Boston College Distinguished Teaching Award for 1999-2000. She was promoted to Professor of Legal Reasoning, Research & Writing in 2012. Professor Gionfriddo has held a variety of positions with the Legal Writing Institute (http://www.lwionline.org), an organization devoted to the pedagogy and scholarship of legal analysis and writing and whose almost 2000 members come from law schools and English departments in the United States as well as from foreign countries. She served as a member of the Board of Directors for the Institute from 1995 to 2004, and served as President from 2000 through 2002 (http://www.lwionline.org/past_presidents.html). From 1994 to 2000, she also co-edited, with several LRR&W colleagues from the Law School, the Institute's semi-annual newsletter, 'The Second Draft.' Professor Gionfriddo has co-chaired many committees for the Legal Writing Institute, including the Election Committee that ran the most recent Board of Directors election and the Monograph Committee that brought forward a proposal for a monograph series to the Board of Directors. Accepting the committee's proposal, the LWI Board appointed Professor Gionfriddo as the first Editor-in-Chief of the new Monograph Series. This series includes electronic volumes published on the Institute's web site, each one of which will be devoted to a topic relevant to teaching legal analysis and writing. In August 2009, the first volume devoted to 'The Art of Critiquing Written Work' was posted to the web site at http://www.lwionline.org/monograph.html. From 2008 to 2010, Professor Gionfriddo also served on the Board of Editors of the Journal of the Legal Writing Institute, which publishes articles on legal analysis and writing issues. Professor Gionfriddo has worked as a consultant at major Boston law firms, giving presentations to and working individually with associates, and has also been a consultant at other law schools on curricular issues, including Harvard Law School. In addition, Professor Gionfriddo has presented widely, including multiple times at the Legal Writing Institute Conference, at the Association of Legal Writing Directors Conference, at the American Association of Law Schools Annual Conference, and at the American Association of Law Libraries Annual Meeting and Conference. A co-founder of the New England Consortium of Legal Writing Teachers, a regional organization that seeks to promote excellence in teaching, Professor Gionfriddo organized an interactive workshop on analytical feedback on student writing. Professor Gionfriddo's scholarship focuses on pedagogical issues concerning legal analysis and writing, including an article published in the Texas Tech Law Review on the importance of lawyers' synthesizing cases in a sophisticated manner. This article was chosen as a lead article and awarded a Texas Tech Law Review outstanding lead article award. As a member of the American Bar Association Subcommittee on Communication Skills, Professor Gionfriddo worked as a contributing author on the second edition of the Sourcebook on Legal Writing Programs, which discusses 'best practices' in the field of legal analysis, writing and research. Most recently, she and her co-author Daniel Barnett published a first-year legal analysis and writing textbook, which is titled 'Legal Reasoning and Objective Writing: A Comprehensive Approach.'"
  },
  {
    "DisplayName": "Patricia Gould",
    "area1": "Clinical & Experiential Education",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Tricia-Gould.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Tricia-Gould/_jcr_content/profileImage.img.png",
    "SortName": "Gould, Patricia",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Tricia is the Director of Externship Programs at Boston College Law School.She received her bachelor's degree from the State University of New York at Binghamton, and a Master's in Social Work degree from Boston College School of Social Work, followed by six years working in child protection services.Tricia then received her Juris Doctor degree from Loyola University of Chicago School of Law, followed by over twenty-five years dedicated to public service working in the prosecution community. Tricia worked as an Assistant District Attorney in the Massachusetts Plymouth County District Attorney's Office where she prosecuted felony and misdemeanor cases in both single justice and jury sessions in District and Superior courts, presented cases to the Grand Jury, and argued appellate matters in assigned cases. From there, she was selected by the National District Attorneys Association to spearhead the first of a kind national non-profit center to train prosecutors and law enforcement regarding legal issues in impaired driving and vehicular homicide cases.She also assisted in implementing training programs for prosecutors in the Ukraine and Russian Federation. Tricia then returned to Massachusetts to become the Director of Training for the Massachusetts District Attorneys Association where she developed and delivered training programs for prosecutors and victim-witness advocates throughout the state.She designed the first statewide trial advocacy training program for prosecutors in Massachusetts.Tricia later joined the Middlesex District Attorney's Office where she first served as the Director of District Courts, Prevention and Programs and later as the Director of Training & Professional Development for the office.In this role, Tricia was responsible for the development and delivery of training programs and resources for assistant district attorneys, victim witness advocates, paralegals and support staff.She also coordinated the outreach, recruitment and hiring process for all new employees and ran the Summer Intern Program. After nine years Tricia left the DA's Office to work as an Assistant Director at Northeastern University School of Law's Center for Co-op & Career Development.In 2019 she joined the staff at Boston College Law School's Center for Experiential Learning where she currently serves as the Externship Program Director."
  },
  {
    "DisplayName": "Kent Greenfield",
    "area1": "Constitutional Law",
    "area2": "Business Law",
    "area3": "Corporate & Securities Law; Civil Litigation & Procedure;",
    "acfacAreas": "Business Law; Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kent-greenfield.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/kent-greenfield/_jcr_content/profileImage.img.png",
    "SortName": "Greenfield, Kent",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Kent Greenfield is Professor of Law and Law Fund Research Scholar at Boston College Law School, where he teaches and writes in the areas of business law, constitutional law, decision making theory, legal theory, and economic analysis of law. He is the past Chair of the Section on Business Associations of the American Association of Law Schools. In addition, he is the author of the book The Myth of Choice, published in 2011 from Yale University Press, Prunsoop Publishing (in Korean), and BiteBack Publishing (UK). Kirkus Reviews stated in its review: 'The author deftly debunks prevailing dogma about the infallibility of free markets, especially important during a time when, as he reports, one in seven Americans are poor.' He is also the author of the book 'The Failure of Corporate Law' published by University of Chicago Press. The book has been called 'simply the best and most well-reasoned progressive critique of corporate law yet written,' and the Law and Politics Book Review said that 'it merits a place alongside Berle and Means, [and] Easterbrook and Fischel.' Greenfield also has had journal articles published in the Yale Law Journal, the Virginia Law Review, the Boston College Law Review, the George Washington Law Review, and Constitutional Commentary, among others. His articles are widely cited, and he has been called 'the leading figure' and 'the most creative thinker' in the progressive, stakeholder school of corporate law scholarship. Greenfield has lectured in 36 states, 9 countries, and at over 100 institutions (including Harvard, Yale, Brown, Stanford, the University of Chicago, the University of Michigan, and the London School of Economics). His opinion essays have appeared in the New York Times, the Washington Post, the Boston Globe, the Atlantic, the Washington Monthly, the American Prospect, Salon, and the Nation. Greenfield consults with litigators on issues of corporate accountability. He was instrumental in developing the theory of the cases brought against Unocal Corporation for alleged human rights violations committed by the company in Burma and against Hershey Corporation for the alleged use of child labor in West Africa. Greenfield has received teaching awards from the law school's Black Law Student Society, the Lambda Law Students' Association, and the Business Law Society. He was also named B.C. Law Teacher of the Year for 2003-04, a recognition bestowed by the Law Students Association on vote of the entire student body. He was also awarded the Emil Slizewski Award for outstanding teaching, given by the graduating class of 2004. He also received the Kevin Larkin Memorial Award for Public Service from the Massachusetts Lesbian and Gay Bar Association in 2005. Greenfield has been a Law Fund Research Scholar, a recognition of his scholarly contributions, since 2003. He has taught at the University of Sydney, the University of Connecticut School of Law, and the University of Hawaii School of Law, and at Brown University in the political science department. He was the founder and president of the Forum for Academic and Institutional Rights (FAIR), an association of three dozen law schools and other academic institutions organized to fight for academic freedom and against discrimination. in 2003, FAIR brought suit against Donald Rumsfeld and others to contest the Solomon Amendment, which forced universities to assist military recruiters. The Supreme Court decided the case against FAIR on March 6, 2006. Greenfield's work with FAIR was featured in numerous newspapers and media outlets, including the New York Times, the Wall Street Journal, the Boston Globe, the Chronicle of Higher Education, ABC News, CBS News, CNN, Fox News, MSNBC, CNBC, and NPR. Greenfield is a graduate of the University of Chicago Law School, where he graduated with honors and was awarded membership into the honorary society Order of the Coif. He also served as Topics and Comments Editor of the University of Chicago Law Review. He received an A.B., with highest honors, from Brown University, where he studied economics and history. Before law school, he traveled extensively in South America and Africa."
  },
  {
    "DisplayName": "Hiba Hafiz",
    "area1": "Labor & Employment Law",
    "area2": "Administrative & Government Law",
    "area3": "Business Law",
    "acfacAreas": "Administrative & Government Law; Business Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/hiba-hafiz.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/hiba-hafiz/_jcr_content/profileImage.img.png",
    "SortName": "Hafiz, Hiba",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Hiba Hafiz joined BC Law as an Assistant Professor of Law in 2018. She teaches and writes in the areas of labor and employment law, antitrust law, and administrative law. Her work focuses on legal solutions to labor market concentration and inequality. After graduating with a B.A. from Wellesley College, Hiba completed a Ph.D. in Comparative Literature at Yale University. During her doctoral program, she served as a union organizer for graduate students and enrolled in Columbia Law School to further study workers' rights. After graduating in 2010, she represented farmworker victims of trafficking as a David W. Leebron Human Rights Fellow at the International Rights Advocates.Between 2011 and 2013, Hiba clerked for Judge Juan R. Torruella of the U.S. Court of Appeals for the First Circuit and Judge José L. Linares of the U.S. District Court for the District of New Jersey. After clerking, she practiced law in the Antitrust Practice Group at Cohen Milstein Sellers & Toll PLLC in Washington, D.C., where she represented plaintiffs in antitrust class actions against pharmaceutical companies and employers. Hiba left practice to become a Harry A. Bigelow Teaching Fellow and Lecturer in Law at the University of Chicago Law School. While at the University of Chicago, Hiba taught Legal Research and Writing and a seminar on Work Law in the New Economy."
  },
  {
    "DisplayName": "Stuart Hamilton",
    "area1": "Family & Estate Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/stuart-hamilton.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/stuart-hamilton/_jcr_content/profileImage.img.png",
    "SortName": "Hamilton, Stuart",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Stuart Hamilton is an experienced attorney and business consultant who focuses on estate planning, estate administration, and probate matters. He serves as an adjunct faculty member and guest lecturer for the Estate Planning course at Boston College. His locally owned and operated practice specializes in high net worth individuals, but he handles estates of all sizes. In addition to his work as the attorney at Hamilton Law Office, Stuart has authored a chapter on retirement benefits for the book Practical Guide to Estate Planning. Prior to establishing his law practice in 2004, Stuart worked for several prominent Boston firms. His related experience includes an 18-year career in business, including running a consulting firm specializing in business and personal financing."
  },
  {
    "DisplayName": "John Hanify",
    "area1": "Business Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/John-hanify.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/John-hanify/_jcr_content/profileImage.img.png",
    "SortName": "Hanify, John",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "John Hanify has tried dozens of jury and non-jury cases on behalf of business and financial institutions in Massachusetts state and federal courts. His cases have involved federal securities laws, ERISA, lender liability, real estate developments, fiduciary duty, and mergers and acquisitions. He has appeared before federal and state agencies representing   clients in government investigations and commercial arbitrations. Hanify also has served clients in mediations and facilitated case assessments for clients seeking alternatives to litigation. He has been recognized as a leading business trial lawyer in Massachusetts.At the start of his career, Hanify served as an Assistant U.S. attorney for the District of Massachusetts, where he defended the constitutionality of various federal statutes and challenges to the Defense Department's phased array early warning systems. For these and other assignments, Hanify received the Justice Department's Outstanding Performance Award.Hanify has been ranked by Chambers USA  as among the top commercial litigators in Boston and has been named in The Best Lawyers in America and Massachusetts Super Lawyers  for many years. He has written and lectured on topics involving business   litigation and corporate risk management. He also has taught NITA negotiation   and mediation skills programs. Hanify has served as a Fellow of the American,   Boston, and Massachusetts Bar Foundations; former member, Council of the   Boston Bar Association; member of the Dean's Advisory Council, Boston College   Law School; and recipient of its Kenealy Award for Outstanding Alumni   Service."
  },
  {
    "DisplayName": "Dean M. Hashimoto",
    "area1": "Health Law",
    "area2": "Civil Litigation & Procedure",
    "area3": "Clinical & Experiential Education; Business Law; Environmental Law",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/dean-hashimoto.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/dean-hashimoto/_jcr_content/profileImage.img.png",
    "SortName": "Hashimoto, Dean M.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "The scholarship of Dean Hashimoto focuses on the interface of law, science and medicine, especially in the areas of health care policy and the role of scientific evidence in the courtroom. Educated as both an attorney and physician, he teaches torts, environmental litigation, health care law, and evidence. He has also studied the internment of citizens and aliens of Japanese heritage in World War II and written about the constitutional law cases decided in that era. Professor Hashimoto is the faculty director for the Boston College Law School's JD/MPH dual degree program with Tufts School of Medicine. Professor Hashimoto served as a Notes Editor on the Yale Law Journal and, after graduating from law school, as a law clerk to Justice William Brennan of the U.S. Supreme Court and Judge David Bazelon of the U.S. Court of Appeals in Washington, D.C. He also practiced as a litigator for the Williams & Connolly law firm in Washington, D.C. and as a health care attorney for Ropes & Gray in Boston before joining the Boston College faculty. Professor Hashimoto received his postgraduate medical training at the Brigham and Women's Hospital and the Harvard School of Public Health. He is a board-certified specialist in occupational and environmental medicine and serves as the chief of this specialty at the Massachusetts General Hospital and the Brigham and Women's Hospital."
  },
  {
    "DisplayName": "Frank R. Herrmann, S.J.",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/frank-herrmann.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/frank-herrmann/_jcr_content/profileImage.img.png",
    "SortName": "Herrmann, Frank R., S.J.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Before joining the faculty in 1991, Associate Professor Frank R. Herrmann, S.J., spent more than ten years as a criminal defense lawyer involved in both trial and appellate cases. He teaches Evidence, Advanced Criminal Procedure, Criminal Process, and Introduction to Lawyering and Professional Responsibility. He holds an A.B. from Fordham University, an M.Div. from Woodstock College and a J.D. from Boston College."
  },
  {
    "DisplayName": "Ingrid Michelsen Hillinger",
    "area1": "Business Law",
    "area2": "Real Estate Law",
    "area3": "",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ingrid-hillinger.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/ingrid-hillinger/_jcr_content/profileImage.img.png",
    "SortName": "Hillinger, Ingrid Michelsen",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Ingrid Michelsen Hillinger is a professor of law at Boston College Law School where she teaches a variety of commercial law/bankruptcy courses including Business Bankruptcy, Contracts, and Secured Transactions. She was named one of the 26 'best law teachers' in the country by the authors of What the Best Law Teachers Do (Harvard University Press, 2013), and was the 2002 winner of the Boston College Distinguished Teaching Award. She is a co-editor of Chapter 11 Theory & Practice: A Guide to Reorganization, a multi-volume bankruptcy treatise. She is co-author of an Article 9 case book, Commercial Transactions: Secured Financing: Cases, Materials & Problems, which adopts a problem-solving approach to teaching transactional law. Professor Hillinger has taught at a variety of schools during her 36-year teaching career - William & Mary, the University of Texas at Austin, Emory University, Northeastern University School of Law and the University of Connecticut School of Law. While at William & Mary, she received an Outstanding Teacher Award from the Virginia Council on Higher Education."
  },
  {
    "DisplayName": "Geraldine Hines",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/geraldine-hines.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/geraldine-hines/_jcr_content/profileImage.img.png",
    "SortName": "Hines, Geraldine",
    "facultyStatus": "Visiting Faculty",
    "priority": 3,
    "biography": "Geraldine Hines is the Rappaport Distinguished Visiting Professor for the Spring 2018 semester. She was born in Scott, Mississippi, and grew up in the Mississippi Delta. She graduated from Tougaloo College in 1968 and the University of Wisconsin Law School in 1971. Upon graduation she became a staff attorney at the Massachusetts Law Reform Institute, engaging in prisoner's rights litigation, and then, from 1973 to 1977 practiced criminal law with the Roxbury Defenders' Committee eventually becoming Director of the Committee. After an MIT fellowship researching policy initiatives to address the issue of police misconduct in communities of color, she served as co-counsel in Commonwealth v. Willie Sanders. From 1979-1982 she litigated civil rights cases relating to discrimination in education and advised on special education law while a staff attorney at the Harvard University Center for Law and Education. Justice Hines entered private practice in 1982, appearing in state and federal courts on criminal, administrative, labor and family law matters. She continued to litigate civil rights cases, including employment discrimination and police misconduct claims, as a founding partner in the first law firm of women of color in the New England region. Governor Paul Cellucci appointed Justice Hines as Associate Justice of the Superior Court in 2001. Governor Deval Patrick appointed her as an Associate Justice of the Appeals Court in 2013, and she was appointed to the MA Supreme Judicial Court a year later. Justice Hines has been active in a number of civic and community organizations, some of which include the American Civil Liberties Union, the National Lawyers Guild and the National Conference of Black Lawyers. She has also observed elections and investigated human rights abuses in Africa and the Middle East. She was appointed to serve on both the Judicial Nominating Council and the Judicial Nominating Commission. Justice Hines has been an adjunct faculty member at Northeastern University Law School since 1980, and has frequently presented educational programs for attorneys and judges, including MCLE, where she has both presented and published materials in diverse subjects such as trial advocacy, federal civil litigation and municipal torts and civil rights claims."
  },
  {
    "DisplayName": "Mary Holper",
    "area1": "Clinical & Experiential Education",
    "area2": "Immigration Law",
    "area3": "Civil & Human Rights Law",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mary-holper.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mary-holper/_jcr_content/profileImage.img.png",
    "SortName": "Holper, Mary",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Mary Holper is an Associate Clinical Professor and Director of the Immigration Clinic at Boston College Law School. Prior to joining the BCLS faculty, Professor Holper was an Associate Professor of Law at Roger Williams University School of Law in Rhode Island, where she founded and directed the Roger Williams University School of Law Immigration Clinic. Professor Holper previously worked at BCLS supervising students in the school's immigration clinics. From 2008-2009, she was a Visiting Assistant Professor at BCLS. She also was a detention fellow for the Catholic Legal Immigration Network, Inc. (CLINIC) at the Boston College Immigration and Asylum Project at BCLS from 2005-07, and a Human Rights Fellow for the Boston College Center for Human Rights and International Justice from 2007-08. She began her career as an Equal Justice Works Fellow at the Capital Area Immigrants' Rights (CAIR) Coalition in Washington, D.C. Throughout her career, she has represented immigration detainees who face removal and has participated in impact litigation challenging the overuse of mandatory detention and indefinite detention and the classification of certain crimes as 'aggravated felonies' in immigration law. In addition, Professor Holper has represented other vulnerable noncitizen populations such as refugees, juveniles, victims of domestic violence, and victims of violent crime. Professor Holper has spoken on numerous panels about immigration issues, particularly on the intersection of immigration law and crimes and removal proceedings. She also has written and co-authored articles for various handbooks, reference guides, and law reviews regarding immigration issues."
  },
  {
    "DisplayName": "Ruth-Arlene W. Howe",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ruth-arlene-howe.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/ruth-arlene-howe/_jcr_content/profileImage.img.png",
    "SortName": "Howe, Ruth-Arlene W.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Professor Ruth-Arlene W. Howe retired from active teaching duties in the Fall of 2009. Professor Howe first arrived at BC Law as a student in 1970. More than 40 years later, her hard work, passion, and commitment to diversity and social justice as a student, alumna, and faculty member have helped shape BC Law into what it is today. Professor Howe has spent much of her life working for social justice. Calling upon her life experiences as a daughter, wife, mother, and community activist, Professor Howe dedicated her career to further the best interests of children, especially African-American youth. As the first African-American female faculty member to achieve tenure and the rank of full professor in the history of BC Law, Professor Howe enjoyed a distinguished and varying academic career, teaching a variety of courses and seminars in family law, elder law, legal interviewing and counseling, and professional responsibility. Professor Howe was a founding faculty advisor to the Third World Law Journal, now the Journal of Law and Social Justice, and an advisor to the Black Law Student Association."
  },
  {
    "DisplayName": "Stuart Hurowitz",
    "area1": "Ethics & Professional Responsibility",
    "area2": "Criminal Law & Procedure",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Stuart-Hurowitz.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Stuart-Hurowitz/_jcr_content/profileImage.img.png",
    "SortName": "Hurowitz, Stuart",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Stuart M. Hurowitz has been teaching Professional Responsibility at Boston College Law School and Boston University School of Law since 2011.He has also taught Evidence, Criminal Procedure, Introduction to Criminal Practice, and has been a supervisor of students in the Criminal Practice Clinic. His 'day job' is as a Supervising Attorney with the Committee for Public Counsel Service's Office in Worcester (but has also been with CPCS in both Suffolk and Norfolk Counties), where part of his responsibilities involve resolving potential conflicts of interest and consulting with staff attorneys about ethical issues.Mr. Hurowitz began his legal career in 1992 at the New Hampshire Public Defender's Office, after having graduated from Boston University School of Law. He spent the next seven and one-half years as a New Hampshire public defender, the last three and one-half as the managing attorney of the Nashua branch office. Leaving NHPD in December 1999, Mr. Hurowitz went to Montenegro (then still a part of Yugoslavia) to work on a wide range of legal reform projects as an American Bar Association's Central and East European Law Initiative's (ABA-CEELI) criminal law liaison.Upon his repatriation, he spent a few years as a partner in his own small law firm before returning to the public defender fold in 2006."
  },
  {
    "DisplayName": "Mitchell C. Johnston",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Business Law",
    "area3": "Civil Litigation & Procedure",
    "acfacAreas": "Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mitchell-johnston.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mitchell-johnston/_jcr_content/profileImage.img.png",
    "SortName": "Johnston, Mitchell C.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Mitchell Chervu Johnston's research interests include an analysis of private law from an economics perspective, with a particular focus on remedies. His current work studies the effects of positive transaction costs on networks of transactions as well as sub-compensatory damages as a potential solution to recurring problems in tort law. Johnston previously completed a fellowship with Harvard Law School's Project on the Foundations of Private Law. The fellowship was an academic investigation of common law subjects such as property, contracts, torts, and related subjects such as intellectual property and commercial law. Johnston received his J.D. from Yale Law School and a B.S.E. in Operations Research and Financial Engineering from Princeton University. Following his graduation from law school he clerked for Chief Judge Debra Ann Livingston on the Second Circuit Court of Appeals and worked as an associate in the Supreme Court and Appellate practice at Mayer Brown LLP. Prior to law school he worked at McKinsey & Company."
  },
  {
    "DisplayName": "Renee Jones",
    "area1": "Corporate & Securities Law",
    "area2": "Business Law",
    "area3": "Administrative & Government Law",
    "acfacAreas": "Administrative & Government Law; Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/renee-jones.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/renee-jones/_jcr_content/profileImage.img.png",
    "SortName": "Jones, Renee",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Renee Jones teaches and writes in the areas of corporate and securities law. Her courses at BC Law include Corporations, Securities Regulation, Corporate Governance and a Financial Regulation Seminar. She received her AB from Princeton University's Woodrow Wilson School of Public and International Affairs and her J.D. (cum laude) from Harvard Law School. In 2005-2006, she was the Eugene P. Beard Faculty Fellow in Ethics at Harvard University's Edmund J. Safra Foundation Center for Ethics. Professor Jones is a member of the American Law Institute and a Fellow of the American Bar Foundation. She has also served as the Co-Chair of the Securities Law Committee of the Boston Bar Association. She received the Faculty Award for Inspirational Achievement from the Boston College Law Business & Law Society in 2010. Professor Jones's scholarship focuses on corporate governance and the federal-state relationship in corporate regulation. She also writes about the impact of enforcement practices on corporate ethics and integrity. Her most recent article, Toward a Public Enforcement Model for Directors' Oversight Duties (with Michelle Welsh) (Vanderbilt Journal of Transnational Law) draws lessons from the Australian model of corporate law enforcement. It recommends implementation of a system of public enforcement for fiduciary duties of corporate directors in the United States. Professor Jones has also written several articles on corporate federalism. Her article 'Rethinking Corporate Federalism in the Era of Corporate Reform' (Iowa Journal of Corporate Law) was reprinted in Corporate Practice Commentator as one of the top corporate law articles of the year. Professor Jones is a frequent commentator on corporate law, securities law and the recent financial crisis. She has appeared at conferences at law schools across the country to address corporate and securities law issues. Professor Jones has been selected to present her work at the Annual Meeting of the American Association of Law Schools in 2004, 2007 and 2010. Among her many professional and community activities, Professor Jones has served as Co-Chair of the Securities Law Committee of the Boston Bar Association. She has also served as a member of the American Bar Association House of Delegates, the editorial board of Human Rights Magazine, and the New England Committee of the NAACP Legal Defense Fund. Before joining BC Law in 2002, Professor Jones practiced for eight years at the Boston law firm Hill & Barlow where she represented private and public companies on corporate and securities matters."
  },
  {
    "DisplayName": "Gregory A. Kalscheur, S.J.",
    "area1": "Legal History & Jurisprudence",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/gregory-kalscheur.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/gregory-kalscheur/_jcr_content/profileImage.img.png",
    "SortName": "Kalscheur, Gregory A.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Father Kalscheur joined the BC Law faculty in 2003. He received his A.B. in 1985 from Georgetown University, and his J.D. in 1988 from the University of Michigan, where he served on the editorial board of the Michigan Law Review. After law school, he clerked for Judge Kenneth F. Ripple, U.S. Court of Appeals for the Seventh Circuit, and worked as a litigator at Hogan & Hartson in Washington, D.C. After entering the Society of Jesus in 1992, Father Kalscheur served as Adjunct Professor of Political Science and Assistant to the Director of the Center for Values and Service at Loyola College in Maryland (1996-98) and as Associate Pastor at St. Raphael the Archangel Church in Raleigh, N.C. (2001-02). Interdisciplinary dialogue in a setting where faith, intellect, and culture meet is an integral component of Jesuit education, and Father Kalscheur hopes to contribute to that project at BC Law. Jesuit legal education should be an essentially humanistic process of formation for responsible professional service, striving to connect legal inquiry to larger questions of meaning and value, exploring the nature of law as a vocation, and asking how faith and religious values can be integrated with public and professional life. Father Kalscheur's primary teaching and research interests include law and religion, constitutional law, civil procedure, Catholic social thought and the law, and the contributions of Ignatian spirituality to the character of legal education at a Jesuit law school."
  },
  {
    "DisplayName": "Daniel Kanstroom",
    "area1": "Immigration Law; Administrative & Government Law",
    "area2": "International & Comparative Law",
    "area3": "Civil & Human Rights Law",
    "acfacAreas": "Administrative & Government Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-kanstroom.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/daniel-kanstroom/_jcr_content/profileImage.img.png",
    "SortName": "Kanstroom, Daniel",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Daniel Kanstroom is Professor of Law, Thomas F. Carney Distinguished Scholar, Director of the International Human Rights Program, and an Associate Director of the Boston College Center for Human Rights and International Justice. He teaches Immigration and Refugee Law, International Human Rights Law, Constitutional Law, Administrative Law, and the International Human Rights Semester in Practice. Professor Kanstroom was the founder of the Boston College Immigration and Asylum clinic in which students represent indigent noncitizens and asylum-seekers. Together with his students, he has won many high-profile immigration and asylum cases and has provided counsel for hundreds of clients over more than a decade. He and his students have also written amicus briefs for the U.S. Supreme Court, organized innumerable public presentations in schools, churches, community centers, courts and prisons, and have advised many community groups. He was a co-founder of the Immigration Spring Break Trips, where students work on immigration law cases during their Spring Break. Professor Kanstroom's newest initiative, the Post-Deportation Human Rights Project, seeks to conceptualize and develop a new field of law while representing US deportees abroad and undertaking empirical study of the effects of deportation on families and communities. Professor Kanstroom has published widely in the fields of U.S. immigration law, criminal law, and European citizenship and asylum law. His most recent books are: Aftermath: Deportation Law and the New American Diaspora, (Oxford University Press 2012); and Deportation Nation: Outsiders in American History (Harvard University Press 2007). He is also a co-editor of: The New Deportations Delirium (editor, with M. Brinton Lykes); Constructing 'Illegality': Immigrant Experiences, Critiques, and Resistance, (editor, with Cecilia Menjívar) (Cambridge University Press 2013). His articles and short pieces have appeared in such venues as the Harvard Law Review, Yale Journal of International Law, UCLA Law Review, NYU Journal of International Law and Politics, Georgetown Immigration Law Journal, The New York Times, Journal of Social History, and the French Gazette du Palais. Professor Kanstroom has served on the American Bar Association's Immigration Commission and the Advisory Board of the PAIR Project. He was rapporteur for the American Branch of the Refugee Law Section of the International Law Association. He has been a visiting Professor at the University of Paris, the University of Boulogne sur Mer, Northeastern School of Law, American University, King's College, London, and Vermont Law School."
  },
  {
    "DisplayName": "M. Cathleen Kaveny",
    "area1": "Legal History & Jurisprudence",
    "area2": "Constitutional Law",
    "area3": "Ethics & Professional Responsibility",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/cathleen-kaveny.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/cathleen-kaveny/_jcr_content/profileImage.img.png",
    "SortName": "Kaveny, M. Cathleen",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Cathleen Kaveny, a scholar who focuses on the relationship of law, religion, and morality, joined the Boston College faculty in January 2014 as the Darald and Juliet Libby Professor, a position that includes appointments in both the department of theology and the law school. A member of the Massachusetts Bar since 1993, Professor Kaveny clerked for the Honorable John T. Noonan Jr. of the U.S. Court of Appeals for the Ninth Circuit and worked as an associate at the Boston law firm of Ropes & Gray in its health-law group The first faculty member to hold such a joint appointment, Professor Kaveny teaches in both the Theology Department and the Law School at Boston College. Professor Kaveny has published over a hundred articles and essays, in journals and books specializing in law, ethics, and medical ethics. She serves on the masthead of Commonweal as a regular columnist. Her book, Law's Virtues: Fostering Autonomy and Solidarity in American Society, was published by Georgetown University Press in 2012. It won a first place award in the category of 'Faithful Citizenship' from the Catholic Press Association. She is currently completing a book entitled Prophecy without Contempt: An Ethics of Religious Rhetoric in the Public Square. Professor Kaveny regularly teaches contract law to first-year law students. She also teaches a number of seminars which explore the relationship between theology, philosophy, and law, such as 'Faith, Morality, and Law,' 'Mercy and Justice,' and 'Complicity.' Professor Kaveny is the president of the Society of Christian Ethics, the major professional society for scholars of Christian ethics and moral theology in North America. It meets annually in conjunction with the Society of Jewish Ethics and the Society for the Study of Muslim Ethics. Professor Kaveny has served on a number of editorial boards including The American Journal of Jurisprudence, The Journal of Religious Ethics, the Journal of Law and Religion, and The Journal of the Society of Christian Ethics. She has been a visiting professor at Princeton University, Yale University and Georgetown University, and a visiting scholar at the University of Chicago's Martin Marty Center. From 1995 until 2013 she taught law and theology at the University of Notre Dame, where she was a John P. Murphy Foundation Professor of Law."
  },
  {
    "DisplayName": "Hon. Hélène Kazanjian",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Hon-Helene-Kazajian.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Hon-Helene-Kazajian/_jcr_content/profileImage.img.png",
    "SortName": "Kazanjian, Hélène",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Hélène Kazanjian serves as an Associate Justice of the Superior Court.She graduated from Stanford University with a B.A. in Political Science in 1982, and from Boston University School of Law in 1986.Following law school, Judge Kazanjian clerked for the Honorable William G. Young of the U.S. District Court for the District of Massachusetts and practiced at Goodwin Procter.Judge Kazanjian worked in the U.S. Attorney's Office in Washington D.C. from 1991-1994, and the U.S. Attorney's Office in Maine from 1994-2010.From 2010 until she was sworn in as an associate justice of the Superior Court in 2016, Judge Kazanjian served as Chief of the Trial Division at the Massachusetts Attorney General's Office. She currently sits in Middlesex County Superior Court and in the Business Litigation Session in Suffolk County."
  },
  {
    "DisplayName": "Robert J. Keach",
    "area1": "Business Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/robert-keach.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/robert-keach/_jcr_content/profileImage.img.png",
    "SortName": "Keach, Robert J.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Robert J. Keach is co-chair of Bernstein Shur's Business Restructuring and Insolvency Practice Group. He is a Fellow of the American College of Bankruptcy and a Past President (2009-2010) of the American Bankruptcy Institute. Keach is also the co-chair of the ABI's Commission to Study the Reform of Chapter 11.Keach focuses on the representation of various parties in workouts and bankruptcy cases, including debtors, creditors, creditors committees, lessors and third parties acquiring troubled companies and/or their assets. He has appeared as a panelist on national bankruptcy, lender liability and creditors rights programs, and is the author of several articles on bankruptcy and creditors' rights appearing in the ABI Law Review, Commercial Law Journal and ABI Journal, among other publications. Keach is a contributing author to Collier Guide to Chapter 11: Key Topics and Selected Industries (2011 Ed.).He is recognized as a “Star Individual” in Corporate M&A/Bankruptcy in Chambers USA, in Best Lawyers in America (Ten-Year Certificate), and by New England Super Lawyers (Bankruptcy and Top 100 Lawyers in New England regardless of specialty). Keach is also certified in business bankruptcy by the American Board of Certification.Currently, Keach serves as the chapter 11 trustee in the railroad reorganization case of Montreal Maine & Atlantic Railway, Ltd., a cross-border restructuring case. Keach is also the fee examiner in the Exide Technologies case in Delaware; he was also the fee examiner in In re AMR Corporation (the chapter 11 cases of American Airlines and its parent and certain affiliates). Keach has also, inter alia, represented ad hoc committees in the Homebanc Mortgage, New Century TRS Holdings, and Nortel Networks cases in Delaware, as well as a public utilities commission in the FairPoint Communications case in the Southern District of New York."
  },
  {
    "DisplayName": "Elisabeth Keller",
    "area1": "Clinical & Experiential Education",
    "area2": "Legal Research",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/elisabeth-keller.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/elisabeth-keller/_jcr_content/profileImage.img.png",
    "SortName": "Keller, Elisabeth",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Elisabeth Keller received her B.A. degree magna cum laude from Brandeis University in 1981 where she was elected to Phi Beta Kappa. In 1988, she graduated from Ohio State University with a M.A. in Higher Education and a J.D. summa cum laude where she was a member of the Law Review and Order of the Coif. She began teaching at Western New England College School of Law the following year. She joined the faculty of Boston College Law School in 1990. She is currently an Associate Professor of Legal Reasoning, Research, and Writing and the Director of the Academic Support Program. She also serves as the Law School Coordinator of the Education and Law Dual Degree program which is a joint program of the Law School and the Lynch School of Education. She has served as co-editor of The Second Draft, the semi-annual newsletter of The Legal Writing Institute."
  },
  {
    "DisplayName": "Thomas C. Kohler",
    "area1": "Legal History & Jurisprudence",
    "area2": "Labor & Employment Law",
    "area3": "Business Law",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-kohler.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/thomas-kohler/_jcr_content/profileImage.img.png",
    "SortName": "Kohler, Thomas C.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Thomas C. Kohler is the Concurrent Professor of Law and Philosophy. Professor Kohler is an internationally recognized authority on the labor and employment law of the United States and other western nations, with a special emphasis on German law. He has served as a Fulbright Professor on the Law Faculty of the Johann Wolfgang Goethe Universität (Frankfurt am Main), and has taught at the University of Texas School of Law and Columbia University's Graduate School of Business. Among other honors, he has been a Fellow of the German Marshall Fund and a Lynde and Harry Bradley Foundation Research Fellow. He has served as a member of the Advisory Board for the E.U.-sponsored European Labour Law Network (ELLN), a Consultant to the Industrial Relations section of the Department of Sociology of the University of Warsaw, a member of the International Board for the National College of Ireland, and as a Scientific Expert to the Pontifical Academy of Social Sciences at the Vatican. He also has acted as a consultant to governments, NGOs and other international organizations on labor and employment law and policy matters. Prof. Kohler has lectured and published widely in the United States, Europe and Japan. In addition to an extensive body of publications on labor and employment law issues, and in comparative law, he has written on personhood, mediating institutions and other issues in social and political theory, as well as on issues in Catholic social thought. He is only the second American to have been invited to present both the annual Hugo Sinzheimer Memorial Lecture (Univ. of Frankfurt Faculty of Law) and the Japan International Labor Law Foundation Distinguished Lectures (University of Tokyo Faculty of Law). And he has twice been invited to address the biennial meeting of the Deutscher Juristentag (the Association of German Jurists). Prof. Kohler serves on the Editorial Advisory Board of the Comparative Labor Law & Policy Journal; the American Journal of Comparative Law, and as an International Advisor to and a member of the Scientific Committee of IUSLabor, a journal sponsored by the Law Faculty of the Universitat Pompeu Fabra (Barcelona). He also serves on the National Executive Board of the International Society for Labor Law and Social Security. Recent activities include: lectures in the series, Göttingen Lectures in Foreign and International Labor Law (Law Faculty of the University of Göttingen); at the Law Faculty of the University of Jena; and at the Hugo Sinzheimer Institut in Frankfurt. Recent articles include Comparative Law in a Time of Globalization: Some Reflections, 52 Duquesne L. Rev. (forthcoming, 2014); Konrad Adenauer's Christian Vision, First Things (tracing the roots of the German social market ideas) (forthcoming, 2014), and Neutralität des Arbeitgebers im US-amerikanischem Arbeitsrecht?, in Arbeit und Recht., 60.4. Prof. Kohler is currently working on a book entitled, Solidarity Forever: the Story and Significance of an Idea (forthcoming, Yale University Press). Prof. Kohler is a member of the American Law Institute, a Fellow of the American Bar Foundation, and a member of the Association of German Jurists (Deutscher Juristentag)."
  },
  {
    "DisplayName": "Rita Kraner",
    "area1": "Business Law",
    "area2": "Civil Litigation & Procedure",
    "area3": "",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/rita-kraner.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/rita-kraner/_jcr_content/profileImage.img.png",
    "SortName": "Kraner, Rita",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Rita Kraner is an experienced litigator and has tried cases in state and federal courts, and argued before the Massachusetts Court of Appeal as lead trial and appeal counsel. Having received a business degree, she is acutely aware of the contractual, tortious, and regulatory risks facing entrepreneurs. Rita works with start-ups and women-led businesses, and her services include a variety of contract drafting, lease reviews and all aspects of litigation. Rita is a graduate of Boston College Law School where she served on the board of the Women's Law Center and the Jewish Law Students Association. She is a devoted champion of female and minority rights. Prior to founding Kraner Law, Rita practiced for seven years with the major Boston firm Riemer & Braunstein LLP."
  },
  {
    "DisplayName": "Ron Landen",
    "area1": "Business Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ron-landen.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/ron-landen/_jcr_content/profileImage.img.png",
    "SortName": "Landen, Ron",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Ron Landen is a partner, general counsel, chief compliance officer and chief administrative officer of HighVista Strategies, where he has oversight of Legal and Compliance, Finance, Operations, Information Technology and Human Resources. Prior to joining HighVista, Ron was a vice president in the Legal Department of Affiliated Managers Group, Inc. where he helped AMG manage relationships with its investment management affiliates and provided general counseling services to those affiliates. Prior to AMG, Ron spent most of his career representing corporations and venture capital, private equity, and hedge fund investment managers in acquisitions, investments, and public offerings while working as an attorney at Jones Day, Weil Gotshal and Proskauer. Ron is also a Certified Public Accountant (Texas)."
  },
  {
    "DisplayName": "Howard Levine",
    "area1": "Environmental Law",
    "area2": "Real Estate Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/howard-levine.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/howard-levine/_jcr_content/profileImage.img.png",
    "SortName": "Levine, Howard",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Mr. Levine's practice includes representation of commercial and not for profit real estate developers, retailers, and educational institutions. His work is focused in Land Use Planning, Zoning, Municipal Law, and the acquisition and sale of real estate.From 1966-1968, Mr. Levine served as an officer in the United States Army.He served in the Republic of South Vietnam from August, 1967 through August, 1968 for which he was awarded the Bronze Star Medal.He served as an attorney in the City of Newton Law Department from 1970 through 1978.He was He was the Assistant City Solicitor (1970 to 1973), and the City Solicitor, responsible for all legal matters for all City Departments, Agencies and Officials, from 1973-1978. While City Solicitor, Mr. Levine was an active member and regional officer of the National Institute of Municipal Law Offices (NIMLO), Chairman of various of its Committees, and a contributor and participant in its national seminars and publications. In 2002, Mr. Levine resigned as a K&L Gates Partner and he became Of Counsel so that he could accept an appointment as an Adjunct Professor of Law at Boston College Law School.Mr. Levine continues to teach Real Estate Development and Finance and Local Government Law at the Law School.He also supervises Independent Study Programs in Real Estate Development and Finance, and in Municipal and Local Government Law. Mr. Levine is one of the four founders and original Directors of the New England Shelter for Homeless Veterans (The Vietnam Veterans Workshop, Inc.), a non-profit charitable corporation. Located in a nine-story building at 17 Court Street in Boston, the former V.A. Outpatient Clinic, the Shelter houses 150 homeless veterans each evening and counsels, feeds and help to rehabilitate up to 500 veterans each day. The Shelter is recognized as a national model and was awarded President Bush's 142nd Point of Light. Mr. Levine served as Director of the Newton Community Service Center, is a Trustee of the Newton Cemetery Corporation, an overseer of the Newton-Wellesley Hospital, a past-chairman of the Community Advisory Board of PBS's WGBH, a member of the Board of the Newton Historical Society, and an overseer of PBS's WGBH. Mr. Levine is a graduate of Bowdoin College and Boston University Law School."
  },
  {
    "DisplayName": "Cynthia C. Lichtenstein",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/cynthia-lichtenstein.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/cynthia-lichtenstein/_jcr_content/profileImage.img.png",
    "SortName": "Lichtenstein, Cynthia C.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "A noted specialist on international banking and international transactions, Professor Cynthia C. Lichtenstein retired from active teaching duties at BCLS in the Spring of 2001. She has been a member of the faculty at Boston College Law School since 1971. Upon retirement, she was a Distinguished Visiting Professor at George Washington University Law School and a Visiting Professor at Brooklyn Law School. She occasionally teaches a Seminar in International Financial Law at BCLS. Professor Lichtenstein has lectured in numerous cities around the world including London, Paris, Buenos Aires, and Sydney, Australia. In addition to significant involvement with a major New York law firm in various capacities over the years, she served briefly with the European Economic Community. Among her many contributions to public and private international law, Professor Lichtenstein served as President of the International Law Association (American Branch) from 1986 to 1992, as an officer of the American Society of International Law, and as a member of the Board of Editors of the American Journal of International Law from 1982 to 1991. She is presently an Honorary Editor of the American Journal of International Law, Treasurer of ILSA, the International Law Students Association which administers the Jessup Competition, the international law moot court competition with participants from over 80 countries, and serves as a Vice-Chair of the International Law Association. Professor Lichtenstein is the author of many significant articles on international banking regulation and international transactions. Her most recent publication is a chapter in International Monetary Law: The Global Crisis (eds. Mario Giovanoli and Diego Devos, OUP, 2010) entitled 'Lessons for the 21st Century Central Bankers: Differences between Investment and Depositary Banking.' Other significant articles are 'The FED's New Model of Supervision for 'Large Complex Banking Organizations', 18 Transnational Lawyer 283 (2005); 'Dealing with Sovereign Liquidity Crises: New International Initiatives for the New World of Volatile Capital Flows to and From Emerging Markets,' 29 McGeorge Law Review 807 (1998) and a short version, under the title 'Innoculating Against the Asian Flu,' appears in the Boston College Law School Magazine, Fall 1998. A short viewpoint, 'Do Globalized Financial Markets Need a New Architecture of Regulation?,' appeared in the December 1998 Translex. Professor Lichtenstein graduated magna cum laude from Radcliffe College (A.B.) and magna cum laude from Yale Law School (J.D.) She also holds a Master's degree in Comparative Law from the University of Chicago Law School."
  },
  {
    "DisplayName": "Odette Lienau",
    "area1": "International & Comparative Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/odette-lienau.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/odette-lienau/_jcr_content/profileImage.img.png",
    "SortName": "Lienau, Odette",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Odette Lienau joined Boston College Law School in January 2023 as the inaugural Marianne D. Short, Esq., Dean. She previously served as a professor of law and former associate dean for faculty research and intellectual life at Cornell University Law School. Her research and teaching interests center around international economic law, international law and international relations, and political and legal theory. Dean Lienau's first book, Rethinking Sovereign Debt: Politics, Reputation, and Legitimacy in Modern Finance, won an American Society of International Law Book Award. Her research and related articles have appeared in many distinguished publications, including the Harvard International Law Journal, Yale Journal of International Law and Oxford University Press, among others. She has served as a consultant and expert for the United Nations Conference on Trade & Development (UNCTAD), the International Monetary Fund, and the World Bank, among other organizations, and is a life member of the Council on Foreign Relations. As associate dean at Cornell, Dean Lienau focused on raising the scholarly profile of the faculty, launching new research workshops and an annual report highlighting faculty scholarly activity, among other initiatives. As chair of the Academic Programs & Planning Committee (2020–2021), she spearheaded development of a new concentration in Law, Inequity, and Structural Exclusion. As chair of the Upper-Level Curriculum & Transition Committee during the COVID-19 pandemic, she facilitated effective hybrid and remote learning. Dean Lienau also worked closely with school leadership on rankings and reputation initiatives, remote work policies and procedures, academic certification, global exchanges, and developing online programming. Dean Lienau practiced with the Financial Restructuring and Insolvency group at Shearman & Sterling in New York City prior to joining Cornell Law School and has taught at Harvard and Yale Law Schools.She received her A.B. from Harvard College and J.D. from NYU School of Law. She earned a Ph.D. in political science at Harvard University, where her dissertation received the University's Charles Sumner Prize."
  },
  {
    "DisplayName": "Joseph P. Liu",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Business Law",
    "area3": "",
    "acfacAreas": "Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-liu.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/joseph-liu/_jcr_content/profileImage.img.png",
    "SortName": "Liu, Joseph P.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Joseph P. Liu is a Professor of Law at Boston College Law School, where he writes and teaches in the areas of copyright, trademark, property, and internet law. His main area of academic research is on the impact of digital technology on copyright law and markets, with a particular focus on how digital technology is changing the way individuals interact with copyrighted works. Professor Liu has published extensively on copyright law issues in many law journals, including the Michigan Law Review, North Carolina Law Review, Boston College Law Review, and Indiana Law Journal. He has lectured extensively in the U.S. and in Asia, at institutions such as Harvard, Columbia, U.C. Berkeley, Georgetown, M.I.T., and Tsinghua University in Beijing. He is the co-author (with Professor Alfred Yen) of the casebook, Copyright Law: Essential Cases and Materials (West 2008). Prior to joining the Boston College Law School faculty in 2001, Professor Liu was an Assistant Professor at U.C. Hastings College of Law (2000-01) and a Climenko Teaching Fellow at Harvard Law School (1997-98). Professor Liu previously practiced in Boston at Foley Hoag & Eliot, where he specialized in intellectual property litigation, securities litigation, and white collar criminal defense. He also served for several years as Vice President and General Counsel to BuyerZone.com, a venture-backed, business-to-business internet start-up company. He has consulted on a number of cases involving copyright law and digital technology. Professor Liu clerked for the Honorable Levin H. Campbell of the U.S. Court of Appeals for the First Circuit (1994-95). He received his B.A. in Physics and Philosophy in 1989 from Yale University, and his J.D. in 1994 from Columbia Law School, where he was Editor-in-Chief of the Columbia Law Review. He also earned an L.L.M. from Harvard University in 1999."
  },
  {
    "DisplayName": "Jane Lovins",
    "area1": "Clinical & Experiential Education",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Jane-lovins.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Jane-lovins/_jcr_content/profileImage.img.png",
    "SortName": "Lovins, Jane",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Jane is the career law clerk for United States District Court Judge George A. O'Toole, Jr. She recently served as the law clerk dedicated to the proceedings in United States v. Tsarnaev (Boston Marathon bombings case). Previously, she was a senior associate at Wilmer Cutler Pickering Hale and Dorr LLP. Her practice included complex commercial litigation and securities litigation and enforcement. She also maintained an active pro bono practice focusing on juvenile justice, education, and family law. While in law school, Jane served as Note Editor of the Boston College Law Review, was a Rappaport Fellow in Law and Public Policy at the Office of the Governor's Legal Counsel, and helped found the Pro Bono Pledge Program. Prior to attending law school, she taught in the South Bronx as a Teach for America corps member and in the Boston area as a research teacher at Tufts University. Jane is a graduate of the University of Pennsylvania, Columbia University, and Boston College Law School, where she graduated summa cum laude and was the recipient of the Richard G. Huber Award, Equal Justice America Fellowship, and Pro Bono Excellence Award."
  },
  {
    "DisplayName": "Jack Lu",
    "area1": "Criminal Law & Procedure",
    "area2": "Civil Litigation & Procedure",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jack-lu.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jack-lu/_jcr_content/profileImage.img.png",
    "SortName": "Lu, Jack",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Judge Jack Lu (ret.) is the principal of Essex Mediation and Arbitration, LLC, and was a Massachusetts Superior Court judge for 16 years and a Boston Municipal Court judge for five years. From 2014 to 2018 he chaired the Massachusetts Sentencing Commission in promulgating the first overhaul of the Massachusetts Sentencing Guidelines in 21 years. Judge Lu has participated in many initiatives on sentencing.Judge Lu is an experienced teacher, having taught at New England Law, Boston, Boston University School of Law, and the University of Massachusetts Lowell where he received the 2021 Haskell Distinguished Teaching Award, based 100% on student nominations. Judge Lu continues to teach at the University of Massachusetts Lowell School of Criminology and Justice Studies.Judge Lu was formerly a faculty member at the National Judicial College, and had an intensive trial practice as an attorney. He graduated from the Boston University School of Law and Johns Hopkins University, and has a new shelter dog from Texas, Keko."
  },
  {
    "DisplayName": "Crystal Lyons",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/crystal-lyons.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/crystal-lyons/_jcr_content/profileImage.img.png",
    "SortName": "Lyons, Crystal",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Crystal Lyons is currently a mediator at MWI's Court Program. Previously, she served as the supervising assistant district attorney and captain of the Mental Health Team of the Appeals and Training Bureau within the Middlesex District Attorney's Office. As captain, Lyons advised on questions of competency and criminal responsibility, reviewed forensic mental health evaluations and psychosocial assessments, established policy and review procedures, and determined civil commitment decisions. Prior to joining BC Law, Lyons taught at New England Law in Boston where she specialized in mental health law."
  },
  {
    "DisplayName": "Daniel A. Lyons",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Administrative & Government Law",
    "area3": "Clinical & Experiential Education; Constitutional Law; Business Law; Real Estate Law; Environmental Law",
    "acfacAreas": "Administrative & Government Law; Business Law; Constitutional Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniel-lyons.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/daniel-lyons/_jcr_content/profileImage.img.png",
    "SortName": "Lyons, Daniel A.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Lyons is an associate professor at Boston College Law School. He specializes in the areas of property, telecommunications and administrative law. Before joining the faculty, Professor Lyons practiced energy, telecommunications, and administrative law at the firm of Munger, Tolles and Olson in Los Angeles. He also clerked for the Judge Cynthia Holcomb Hall of the Ninth Circuit Court of Appeals. Professor Lyons has participated in rulemaking proceedings before both the Federal Communications Commission and the California Public Utilities Commission and has represented clients in federal and state litigation involving numerous regulatory issues. He has also spoken at workshops nationwide on the effects of technology convergence on telecommunications regulation."
  },
  {
    "DisplayName": "Erin Macgowan",
    "area1": "Clinical & Experiential Education",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/erin-macgowan.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/erin-macgowan/_jcr_content/profileImage.img.png",
    "SortName": "Macgowan, Erin",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Erin Macgowan is an Associate in the Litigation Department of Ropes & Gray, LLP.She received her Bachelor of Science and Masters in Elementary Education degrees from the University of New Hampshire. After several years as an elementary school teacher, she attended law school.She received her J.D. summa cum laude from Boston College Law School in 2012.While at Boston College Law School, she was Editor-in-Chief of the Boston College Law Review. Following law school, she clerked for the Hon. Judge Selya of the United States Court of Appeals for the First Circuit."
  },
  {
    "DisplayName": "Jamy Madeja",
    "area1": "Environmental Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jamy-madeja.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/jamy-madeja/_jcr_content/profileImage.img.png",
    "SortName": "Madeja, Jamy",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Jamy Buchanan Madeja is an environmental lawyer and government relations counsel at Buchanan & Associates, a Beacon Hill-Boston law office she established 25 years ago, after serving as General Counsel for Environmental Affairs for Massachusetts' Governor William Weld.Ms. Madeja specializes in Massachusetts environmental and land use law, with a special expertise in Public Trust Rights to access waterways. She represents many waterfront interests statewide, as well as homeowner associations, advocacy groups, developers, municipalities and others. She serves as Government Relations and Legal Counsel to the Massachusetts Marine Trades Association and represents marine industrial clients, as well. She testifies at the Massachusetts legislature frequently on environmental issues and serves as an Adjunct Professor at Boston College Law School where she teaches land use law.Ms. Madeja also serves as President of the Educational Foundation for Rockport Public Schools and serves on other not-for-profit boards with interests in land use and waterfront matters. Before working in government, Ms. Madeja was an attorney at MintzLevin.Before becoming an attorney, she worked in public finance.She is a lifelong believer in the power of open water to rejuvenate the soul, hence her choice of practice area.She graduated from Yale College in 1983 and Boalt Hall School of Law in Berkeley, California in 1988.She is married, has two children and lives in Rockport, Massachusetts."
  },
  {
    "DisplayName": "Ray D. Madoff",
    "area1": "Tax Law",
    "area2": "Property",
    "area3": "Family & Estate Law; Business Law;",
    "acfacAreas": "Business Law; Tax Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ray-madoff.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/ray-madoff/_jcr_content/profileImage.img.png",
    "SortName": "Madoff, Ray D.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Ray Madoff is a Professor at Boston College Law School where she teaches and writes in the areas of philanthropy policy, taxes, property and estate planning. Professor Madoff is the Co-founder and Director of the Boston College Law School Forum on Philanthropy and the Public Good, a non-partisan think tank that convenes scholars and practitioners to explore questions regarding whether the rules governing the charitable sector best serve the public good. Professor Madoff is the author of: Immortality and the Law: The Rising Power of the American Dead (Yale), which looks at how American law treats the interests of the dead and what this tells us about our values for the living. The Financial Times called it 'a sparkling polemic. 'Professor Madoff is also the lead author on one of the top treatises on estate planning: Practical Guide to Estate Planning (CCH) (published annually from 2001-2014) and has written numerous articles and chapters in a wide variety of areas involving property and death. Professor Madoff's areas of expertise include philanthropy policy, the rights of the dead (including the ability of the dead to control their bodies, reputation, and property),estate taxes, comparative inheritance law, and wealth inequality and taxes. A regular commentator on a number of these topics, Professor Madoff has appeared on dozens of national radio shows including On Point, Talk of the Nation, All Things Considered, Here and Now, and Marketplace, among others. Professor Madoff is a frequent contributor to the opinion pages of the New York Times, and has also published Op-Eds in the Washington Post, the LA Times, the Boston Globe and the Chronicle of Philanthropy. Professor Madoff is an experienced mediator and leading authority on the use of mediation to resolve will and trust disputes. Prior to teaching, she was a practicing attorney for nine years in New York and Boston. Professor Madoff is a member of the American Law Institute, an Academic Fellow of the American College of Trusts and Estate Counsel and past president of the American Association of Law School's Trusts and Estates Section. She was named a 2014 Top Women of the Law by Mass Lawyer's Weekly."
  },
  {
    "DisplayName": "Michael Mahoney",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/michael-mahoney.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/michael-mahoney/_jcr_content/profileImage.img.png",
    "SortName": "Mahoney, Michael",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "A graduate of Boston College Law School ('96), Attorney Mahoney is the principal of the Law Offices of Michael F. Mahoney, P.C., a multi-faceted Plaintiff-oriented personal injury practice with full staff, associates, and attorney of counsel. Areas of practice include motor vehicle accidents, spinal cord/brain injuries, product liability, premises liability, dram shop liability, slip and fall, medical malpractice, nursing home negligence and sexual abuse litigation. Since opening his practice, Attorney Mahoney has tried cases in state and federal court, argued before the Massachusetts Supreme Judicial Court and has obtained numerous multi-million dollar settlements, arbitration awards and judgments in numerous complex personal injury cases. Attorney Mahoney has been featured and profiled by The Boston Globe, Fox News, WBZ Radio, Lawyer's Weekly, and New Mobility Magazine, amongst others."
  },
  {
    "DisplayName": "Ross Martin",
    "area1": "Business Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ross-martin.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/ross-martin/_jcr_content/profileImage.img.png",
    "SortName": "Martin, Ross",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Ross's recent engagements include representing the creditors' committee of a major SIV commercial paper program, an equity holders committee of SeraCare, Inc., which successfully took control of a Chapter 11 debtor via a rights hearing initially contested by management, and representing an auto-parts supplier. Ross has represented first/second lien lenders in the restructuring of High Voltage and Atkins Nutritionals, and has acted as lead bondholder committee counsel in the York Research case in the Southern District of New York, the cross-border case of Archibald Candy (US/Canada) and the successful restructuring of Fitzgeralds Gaming Corporation in Nevada. In 2003, Ross was a senior member of the Ropes Gray team that served as debtor's counsel for the major telecommunications company Genuity, in the Southern District of New York. Ross has also been involved in several significant bankruptcy acquisitions, including Golden Books (Delaware), NordicTrack (Massachusetts) and Busy Body (Texas). Ross has litigated several reported cases, including a successful federal-court appeal in a leading securities-fraud case on behalf of a debt investor. On a pro bono basis, Ross has been involved in prisoner-rights litigation, construction litigation for an inner-city nonprofit institution, and most recently as part of the Ropes Gray team that obtained a multi-million dollar settlement for the victims of Chilean President Augusto Pinochet."
  },
  {
    "DisplayName": "Patricia McCoy",
    "area1": "Business Law",
    "area2": "Corporate & Securities Law",
    "area3": "Administrative & Government Law",
    "acfacAreas": "Administrative & Government Law; Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/patricia-mccoy.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/patricia-mccoy/_jcr_content/profileImage.img.png",
    "SortName": "McCoy, Patricia",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Patricia A. McCoy, a nationally prominent scholar in financial services regulation, is the inaugural Liberty Mutual Insurance Professor of Law. In 2010 and 2011, she joined the U.S. Department of the Treasury, where she helped form the new Consumer Financial Protection Bureau (CFPB), and, as the CFPB's first assistant director for mortgage markets, oversaw the Bureau's mortgage policy initiatives. She teaches insurance law as well as banking regulation and a full array of other financial services regulatory courses. After receiving her law degree from U.C. Berkeley, Professor McCoy clerked for the late Hon. Robert S. Vance on the U. S. Court of Appeals for the Eleventh Circuit and was a partner at Mayer Brown in Washington, D.C., specializing in complex securities, banking and constitutional litigation. More recently, she was the Director of the Insurance Law Center at the University of Connecticut School of Law before joining the Boston College faculty. Professor McCoy's research interests focus on the nexus between financial products, consumer welfare, and systemic risk, analyzed through the lens of law, economics, and empirical methods. In A Tale of Three Markets: The Law and Economics of Predatory Lending in the Texas Law Review in 2002, Professor McCoy was among the first to raise alarms about the dangers of subprime loans. She has three books to her credit, the most recent being The Subprime Virus with Kathleen Engel, published by Oxford University Press in 2011. The author of numerous book chapters and articles, she has testified before Congress and been quoted in the New York Times, Wall Street Journal, and The Washington Post and on National Public Radio. Previously, Professor McCoy was a Visiting Scholar at the MIT Economics Department and served on the Federal Reserve's Consumer Advisory Council and on the board of the Insurance Marketplace Standards Association. In 2012, the American Law Institute named her as an Adviser to the Third Restatement on Consumer Contracts. She currently sits on the Advisory Committee on Economic Inclusion of the Federal Deposit Insurance Corporation."
  },
  {
    "DisplayName": "Judith A. McMorrow",
    "area1": "Civil Litigation & Procedure",
    "area2": "Ethics & Professional Responsibility",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/judith-mcmorrow.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/judith-mcmorrow/_jcr_content/profileImage.img.png",
    "SortName": "McMorrow, Judith A.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Judith A. McMorrow teaches torts, professional responsibility and in the law school's Semester-in-Practice externship program. Her scholarship is primarily in the area of professional responsibility and legal ethics. Professor McMorrow is active in pro bono and service activities, including over 20 years on the board of Community Legal Services and Counseling Center, 10 years on the Massachusetts SJC Committee on Judicial Ethics, work with the ABA Center for Professional Responsibility and earlier work in representing women in Massachusetts seeking commutation based on Battered Woman Syndrome. After graduating from University of Notre Dame Law School in 1980, Prof. McMorrow clerked for the Hon. Gilbert S. Merritt (United States Court of Appeals for the Sixth Circuit) and Chief Justice Warren E. Burger (United States Supreme Court.) She practiced with the Washington D.C. law firm of Steptoe and Johnson before entering teaching in 1985. In Spring 2013, Prof. McMorrow ran the Boston College Law School London program. For the 2008-09 academic year Prof. McMorrow taught at Renmin University in Beijing, China on a Fulbright grant."
  },
  {
    "DisplayName": "Cara McNamara",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/cara-mcnamara.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/cara-mcnamara/_jcr_content/profileImage.img.png",
    "SortName": "McNamara, Cara",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Cara McNamara is an Adjunct Professor and co-teaches Restorative Justice & the Criminal Justice System. She dedicated her legal career to serving indigent defendants in state and federal courts as a public defender for the past 20 years. For the past eight years, she has served as an Assistant Federal Public Defender in the Boston Federal Defender Office, where she litigates complex felony criminal cases. In addition, she serves as the Boston Federal Defender liaison to the District of Massachusetts' Reentry (R.E.S.T.A.R.T.) program and diversion (R.I.S.E.) program committees. She is also a coordinator of the District of Massachusetts Restorative Justice Program, where she co-facilitates restorative justice circles and preparation for individual restorative conferences. Prior to her work at the Boston Federal Defender, she worked in the same capacity at the Alaska Federal Public Defender, and with a state public defender agency in Alaska (Office of Public Advocacy) where she was awarded the Litigator of the Year in 2009. Her caseload and trial practice included serious felony assaults, sexual assaults, homicides, firearm violations, drug distribution, and financial fraud. She also served as the representative to the Wellness Court in the Alaska Trial Court, a therapeutic court model serving clients with mental health diagnosis and treatment needs. She was a co-founding member and Vice President of the Alaska Innocence Project and served for many years as a board member of Alaskans Against the Death Penalty. McNamara graduated Phi Beta Kappa from the Johns Hopkins University with a B.A. in Anthropology and received her J.D. from Northeastern University School of Law."
  },
  {
    "DisplayName": "Elisabeth Medvedow",
    "area1": "Public Policy",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/elisabeth-medvedow.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/elisabeth-medvedow/_jcr_content/profileImage.img.png",
    "SortName": "Medvedow, Elisabeth",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Elisabeth J. Medvedow serves as the Inaugural Executive Director of the Rappaport Center for Law and Public Policy having joined Boston College Law School in 2015. Medvedow continues in her distinguished career in nonprofit management. For many years before coming to BC Law School, she was Executive Director of Discovering Justice, a civic education nonprofit housed in the Moakley U.S. Courthouse that teaches elementary and middle school students about democracy, justice, social studies, and law. Prior to Discovering Justice, Medvedow championed women lawyers as Executive Director of the Women's Bar Association and Women's Bar Foundation, the charitable affiliate which brought pro bono legal services to victims of domestic violence, elderly women and men, homeless women, and women prisoners. For a decade before entering the nonprofit arena, Medvedow was an appellate prosecutor at the Massachusetts Attorney General's Office. She has briefed and argued numerous cases before the First Circuit Court of Appeals, Massachusetts Supreme Judicial Court, and Massachusetts Appeals Court. Among her many professional and civic activities, Medvedow has been a member of the ABA Advisory Commission to the Standing Committee on Public Education; Governor's Special Commission on Civic Engagement and Learning; Governor's Commission on Sexual and Domestic Violence; Supreme Judicial Court Standing Committee on Substance Abuse; and the Massachusetts Law Review Board of Editors; she was also awarded a Wasserstein In-Residence Fellowship at Harvard Law School. She was honored with a 2017 Massachusetts Lawyers Weekly 'Top Women of Law Circle of Excellence' award, was inducted into the YWCA's Academy of Women Achievers, is a member of the Women's Bar Foundation Emeritus Board, and currently serves as President of Congregation Dorshei Tzedek. Medvedow received her B.A. degree, cum laude, and a M.S. in Education, from the University of Pennsylvania, and her J.D. degree from Northeastern University School of Law. Following law school, she taught for three years at Suffolk University Law School, and then served as a law clerk in the Massachusetts Appeals Court for the Honorable Raya Dreben and in the U.S. District Court for the Honorable John McNaught."
  },
  {
    "DisplayName": "Alan Minuskin",
    "area1": "Clinical & Experiential Education",
    "area2": "Civil Litigation & Procedure",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/alan-minuskin.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/alan-minuskin/_jcr_content/profileImage.img.png",
    "SortName": "Minuskin, Alan",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Alan Minuskin is an Associate Clinical Professor of Law at Boston College Law School. He teaches and supervises student attorneys in the Law School's Civil Litigation Clinic, and Housing Law Clinic, which he directs. He also serves as Director the Boston College Legal Assistance Bureau's Elder Legal Services Project. Prior to beginning his career as a clinical legal educator in 1979, Professor Minuskin was a legal services attorney at Central Middlesex Legal Services and, through a small community practice he founded, a co-grantee of federal legal services funding for the provision of free legal services to the poor. From 1977 to 1984, he was a part time, volunteer staff attorney at the Community Legal Services and Counseling Center (formerly Cambridgeport Problem Center) where he collaborated with mental health professionals in an interdisciplinary approach to solving the legal problems of indigent clients. At Boston College Law School, Professor Minuskin has developed, written elaborate case materials for, and taught innovative litigation practice courses. In his Pretrial Litigation course, students litigate a complex civil case in a semester-long simulated employment discrimination law suit. The roles of parties and witnesses are played by accomplished, local actors; students work in teams comprising firms and are supervised and critiqued by Boston area litigators and judges. After teaching in the Law School's first-year lawyering program for many years, Professor Minuskin developed his own first-year practice course, Introduction to Civil Litigation Practice, in which students engage in litigation skills training, again with seasoned actors playing the roles of parties, and grapple with real ethics dilemmas presented in class by guest practitioners. Professor Minuskin also periodically serves as on-site externship director for Boston College Law School's London Program, an international collaboration with King's College London School of Law in which Boston College law students spend a full semester abroad interning with international finance, human rights, or environmental law placements while taking law classes at King's. In addition to writing materials for his courses, Professor Minuskin produced and directed an advocacy ethics training video, Shalleck v. Winchester-Park, in collaboration between the Law School and the University of California Hasting College of Law. Professor Minuskin has also engaged in litigation training for practicing lawyers. He frequently presents to and trains community organizations on Massachusetts housing law. He has been active in a variety of professional organizations whose purpose is the expansion and reformation of programs designed to provide wider access to legal services and justice for economically disadvantaged people. He is a member of the Massachusetts bar."
  },
  {
    "DisplayName": "Thomas Mitchell",
    "area1": "Real Estate Law",
    "area2": "Property",
    "area3": "Civil & Human Rights Law",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/thomas-mitchell.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/thomas-mitchell/_jcr_content/profileImage.img.png",
    "SortName": "Mitchell, Thomas",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Thomas Mitchell is the second holder of the Robert F. Drinan, SJ, Chair. In 2020, he was named a MacArthur Fellow (commonly known as the 'Genius Grant') in recognition of his work 'reforming long-standing legal doctrines that deprive Black and other disadvantaged American families of their property and real estate wealth.' His areas of expertise include property law, land use, minority property ownership, and legal reform. Mitchell received his BA from Amherst College, JD from Howard University, and LLM from the University of Wisconsin Law School, where he later served on the faculty. He is a prolific writer with two books and dozens of articles, book chapters, essays, and policy briefs to his credit. His presentations at various conferences and symposia number more than 100. Mitchell was a principal drafter of the Uniform Partition of Heirs Property Act (UPHPA) of 2010."
  },
  {
    "DisplayName": "Joseph J. Mueller",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/joseph-mueller.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/joseph-mueller/_jcr_content/profileImage.img.png",
    "SortName": "Mueller, Joseph J.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Joe Mueller is the Co-Chair of the Trial Practice in the Litigation Department at WilmerHale, an international law firm. Mr. Mueller has worked on dozens of trials, including first-chairing important trials for top technology companies. Mr. Mueller also has considerable appellate experience: he has argued before federal and state appeals courts including the United States Courts of Appeals for the Federal Circuit, Fourth Circuit, and Ninth Circuit. He clerked for Judge Patti Saris of the United States District Court for the District of Massachusetts and Judge Paul Michel of the United States Court of Appeals for the Federal Circuit. He is a graduate of Harvard College and Boston College Law School (summa cum laude)."
  },
  {
    "DisplayName": "Kathleen Murphy",
    "area1": "Civil Litigation & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/kathleen-murphy.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/kathleen-murphy/_jcr_content/profileImage.img.png",
    "SortName": "Murphy, Kathleen",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Kathleen Murphy is an accomplished divorce and family law attorney who specializes in divorce, custody, modification, contempt, pre/post-nuptial agreement, and restraining order matters. She has considerable experience resolving and litigating family law cases, including those which are financially complex and high-conflict. She also has acted as a family law mediator and Guardian ad Litem. While her focus is litigation, she brings to her practice the knowledge and expertise she has gained through prior experience as a mediator.In addition to being a divorce and family law litigator, Attorney Murphy has experience as a court-appointed Guardian ad Litem (“GAL”) in family law matters. Murphy has acquired unique insight into how judges make best-interest-of-the-child determinations through her role as a GAL. This perspective informs her work as a litigator, enabling her to comprehensively evaluate cases involving children and develop an individualized strategy for each one.  Murphy began teaching the Dispute Negotiation course at her alma mater, Boston College Law School, in the Fall of 2022. In this hands-on, experiential course, students negotiate cases weekly. As a professor, Murphy draws upon her expertise to introduce students to the art of negotiating, which includes reading body language, client interviewing, and the ability to persuade. This professorship is a testament to Murphy's professional abilities as a litigator and negotiator. It is also a rewarding experience that enables her to give back to the legal community."
  },
  {
    "DisplayName": "Hon. Christopher J. Muse",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/christopher-muse.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/christopher-muse/_jcr_content/profileImage.img.png",
    "SortName": "Muse, Christopher J.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "The Hon. Christopher J. Muse is a graduate of Georgetown University and Suffolk Law School. Before his appointment to the Massachusetts Superior Court in 2001, he was a trial attorney for more than twenty years, practicing in the Massachusetts State and Federal Courts. He was involved in the criminal defense of charges from misdomeanors up to and including first degree murder indictments. He also represented several labor unions, and litigated many labor and employment issues. Judge Muse will teach Trial Practice in the spring."
  },
  {
    "DisplayName": "Alice Noble",
    "area1": "Health Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/alice-noble.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/alice-noble/_jcr_content/profileImage.img.png",
    "SortName": "Noble, Alice",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "As both a practicing attorney and as a legal educator, Alice Noble's career has been focused on issues of health law and policy. She is an expert on the Affordable Care Act and co-author of the recently published Health Care Reform: Law and Practice (M. Chirba, A. Noble, M. Maddigan; Lexis/Matthew Bender 2013), which provides a section by section analysis of statutory and regulatory compliance obligations under the Affordable Care Act. Alice is a Senior Lecturer in the Legal Studies Program at Brandeis University and Adjunct Lecturer at Brandeis University's The Heller School and Boston College Law School. She holds a law degree from Villanova University School of Law and a Master of Public Health degree from Harvard School of Public Health. In addition to teaching at Brandeis University and Boston College Law School, she has taught numerous courses at Harvard School of Public Health and Tufts Medical School. Courses taught include Genetics, Law, and Social Policy, Health Law and Ethics, Health Law and Policy, Advanced Legal Writing, Law and Public Health, Managed Care Law and Regulation, among others. Alice was a fellow in medical ethics at Harvard Medical School and a Senior Researcher at The American Society of Law, Medicine & Ethics. She has a number of peer-reviewed publications on topics such as genetic technology, law and ethics; medical malpractice; managed care; and hospital law. She is a contributor to the Health Affairs Blog and Health Law Professors Blog. Alice has been an invited speaker on various matters, including national health care reform."
  },
  {
    "DisplayName": "Elianna Nuzum",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/elianna-nuzum.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/elianna-nuzum/_jcr_content/profileImage.img.png",
    "SortName": "Nuzum, Elianna",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Elianna Marziani Nuzum is an Adjunct Professor and co-teaches Restorative Justice & the Criminal Justice System. She is an Assistant United States Attorney in the U.S. Attorney's Office in Boston, where she has litigated cases in both the criminal and civil divisions for over seven years. In the Major Crimes Unit, she has prosecuted crimes including kidnapping resulting in death, gun and drug trafficking, robbery, sexual exploitation of children, wire fraud, and identity theft, among others, from pretrial investigation through charging, trial or guilty plea, and sentencing. In her previous role in the Affirmative Civil Enforcement unit, Nuzum received the prestigious Director's Award from the Executive Office of U.S. Attorneys, in recognition of her work on a team of attorneys that achieved a record $4.9 billion settlement with the Royal Bank of Scotland in connection with a residential mortgage-backed securities investigation. At the U.S. Attorney's Office, Nuzum also serves as a co-coordinator for the District of Massachusetts Restorative Justice Program. In that capacity, she co-facilitates restorative justice circles that include criminal defendants, victims of crime, community members, and members of the criminal justice system; facilitates trauma reading and discussion groups for criminal defendants in the program; and facilitates individual restorative conferences between criminal defendants and those who have been harmed by their actions. She has received training in restorative conferencing and circles through the International Institute for Restorative Practices. Before joining the U.S. Attorney's Office, Nuzum was an Assistant District Attorney at the Suffolk County District Attorney's Office, where she prosecuted a broad range of felonies and misdemeanors through trial and sentencing. Later, in the Appeals Division, she briefed and argued cases before the Massachusetts Supreme Judicial Court and Appeals Courts.Nuzum also worked for seven years in private practice at a large law firm in Boston, where she represented both individuals and corporations in government investigations as well as in complex commercial litigation. She also conducted significant pro bono work, including successfully briefing and arguing to the Massachusetts Supreme Judicial Court a first degree murder defendant's appeal of the denial of his motion for new trial; representing an indigent man charged with a drug conspiracy in federal district court; and obtaining asylum for a woman facing removal proceedings before the United States Immigration Court in Boston. Nuzum graduated summa cum laude from Washington and Lee University with a B.A., and received her J.D. from the University of Chicago Law School."
  },
  {
    "DisplayName": "Sharon H. O'Connor",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/sharon-oconnor.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sharon-oconnor/_jcr_content/profileImage.img.png",
    "SortName": "O'Connor, Sharon H.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Sharon Hamby O'Connor is a Professor Emerita at Boston College Law School. During her tenure at the Law School she served as Associate Dean for Library and Computing Services for 23 years. In that capacity she was responsible, with the rest of the library staff, for providing academic, curricular and technology support to the Law School. She completed her service at the Law School as Associate Dean for Academic Affairs. In this position, she worked with the Dean and faculty in areas of curriculum review, program development, and research and oversaw the delivery of academic services to students. Professor O'Connor is a graduate of Southern Methodist University, holds masters degrees from Columbia University and Yale University in library science and environmental studies respectively, and a JD degree from Harvard Law School. She is the co-author of A Guide to the Early Reports of the Supreme Court of the United States which was awarded the Joseph L. Andrews Bibliographical Award for outstanding contribution to legal bibliography. She is a member of the Massachusetts Historical Society, the Colonial Society of Massachusetts, the American Association of Law Libraries, and the American Society for Legal History."
  },
  {
    "DisplayName": "Andrea Olson",
    "area1": "Civil Litigation & Procedure",
    "area2": "Constitutional Law",
    "area3": "Legal History & Jurisprudence",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/andrea-olson.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/andrea-olson/_jcr_content/profileImage.img.png",
    "SortName": "Olson, Andrea",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Andrea Olson teaches and writes in the areas of civil procedure, remedies, and structural constitutional law. She studies jurisdictional architecture, including the extent to which Congress can affect federal and state procedural, remedial, and substantive law through its exercise of control over federal court jurisdiction. Olson's research is motivated by a belief that analyzing structural and remedial logic in the law is critical for promoting systemic integrity and fundamental fairness.Prior to joining BC Law, Olson was a Climenko Fellow at Harvard Law School where she taught legal research and writing as well as an upper-level elective on remedies and procedure. She received her B.A., cum laude, in Political Science from the University of California Berkeley.After several years working in California state government and health care regulatory consulting, she returned to U.C. Berkeley, where she received her J.D. with distinction.Olson clerked for the Honorable Andrew D. Hurwitz on the U.S. Court of Appeals for the Ninth Circuit and the Honorable Jon S. Tigar of the U.S. District Court for the District of Northern California. She practiced with Latham & Watkins in San Francisco and is an admitted member of the California State Bar."
  },
  {
    "DisplayName": "David Olson",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Administrative & Government Law",
    "area3": "Business Law",
    "acfacAreas": "Administrative & Government Law; Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-olson.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/david-olson/_jcr_content/profileImage.img.png",
    "SortName": "Olson, David",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Olson is an associate professor at Boston College Law School. He teaches patents, intellectual property, and antitrust law. Professor Olson researches and writes primarily in the areas of patent law and copyright. Professor Olson came to Boston College from Stanford Law School's Center for Internet and Society, where he researched in patent law and litigated copyright fair use impact cases. Before entering academia, Professor Olson practiced as a patent litigator at the law firm of Kirkland & Ellis LLP. Professor Olson clerked for Judge Jerry Smith of the U.S. Court of Appeals for the Fifth Circuit."
  },
  {
    "DisplayName": "Reena Parikh",
    "area1": "Experiential",
    "area2": "Civil & Human Rights Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/reena-parikh.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/reena-parikh/_jcr_content/profileImage.img.png",
    "SortName": "Parikh, Reena",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Reena Parikh is an Assistant Clinical Professor and will be developing and directing a Civil Rights Clinic at Boston College Law School.Prior to joining the BC Law faculty, Professor Parikh was a Robert M. Cover Clinical Teaching Fellow at Yale Law School, where she co-taught in the Worker and Immigrant Rights Advocacy Clinic. The matters she co-supervised included civil rights and habeas corpus litigation in U.S. District Courts, and the representation of grassroots community organizations on legislative advocacy campaigns. She also taught an Introduction to Legal Analysis and Writing course.Professor Parikh began her legal career as Associate Counsel in the Office of the Chief Counsel for United States Citizenship and Immigration Services. During her tenure in the federal government, she also completed a detail as a Special Assistant U.S. Attorney in the Eastern District of New York. Professor Parikh clerked for the Honorable Margaret B. Seymour of the U.S. District Court, District of South Carolina.Professor Parikh earned her J.D. from American University Washington College of Law, where she graduated summa cum laude and was a Public Interest/Public Service Scholar. She received her B.A. cum laude from Boston College, where she was a Gabelli Presidential Scholar."
  },
  {
    "DisplayName": "Janelle Peiczarka",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/janelle-peiczarka.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/janelle-peiczarka/_jcr_content/profileImage.img.png",
    "SortName": "Peiczarka, Janelle",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Janelle Peiczarka is an associate corporate counsel at iRobot. She advises global marketing teams on asset creation and implementation, including development and substantiation for product claims, proper trademark and copyright use in media, and retail assets. Previously, she served as an associate at Gennari Aronson and a law clerk at Gilmore, Rees & Carlson, P.C."
  },
  {
    "DisplayName": "Vlad Perju",
    "area1": "Constitutional Law",
    "area2": "International & Comparative Law",
    "area3": "Legal History & Jurisprudence; Ethics & Professional Responsibility",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/vlad-perju.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/vlad-perju/_jcr_content/profileImage.img.png",
    "SortName": "Perju, Vlad",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Perju is the Director of the Clough Center for the Study of Constitutional Democracy at Boston College and a tenured Associate Professor at Boston College Law School. His primary research and teaching interests include the law of the European Union, comparative constitutional law and theory, international and comparative law and jurisprudence. Before joining the Boston College faculty in 2007, Perju was awarded a doctorate from Harvard Law School under the supervision of Professor Frank Michelman with a dissertation entitled 'The Province of Cosmopolitan Jurisprudence: Constitutional Foundations'. He earned two law degrees from the University of Bucharest and the University of Paris 1 Panthéon-Sorbonne, an LLM degree summa cum laude from the European Academy of Legal Theory in Brussels, Belgium and graduated from the LL.M. program at Harvard (degree waived). While at Harvard, he served as a Byse Fellow, a Safra Fellow at the Edmond J. Safra Foundation Center for Ethics and a Research Fellow in Amartya Sen's Project on Justice, Welfare and Economics. Perju was a Visiting Associate Professor at Harvard Law School in the Fall Term 2011 and a Visiting Professor of the Theory of the State at the European Academy of Legal Theory in Brussels, Belgium. Perju was awarded the 2009 Ius Commune Prize for his article entitled 'Reason and Authority in the European Court of Justice' (49 Virginia Journal of International Law 307). His paper 'Cosmopolitanism and Constitutional Self-Government' was selected for presentation at the 2010 Yale/Stanford Junior Faculty Forum. In the Fall 2009, Professor Perju was a research fellow at NYU Law School. He has been an affiliate of the Minda de Gunzburg Center for European Studies at Harvard University since the Spring 2010. In 2008 Professor Perju was appointed by the President of Romania to a seven-member Commission on Constitution Reform. He remains actively involved in the process of constitutional reform both in Romania as well as in the European Union. Some of his commentary can be found here (in English) and here (in Romanian). At Boston College, he teaches courses in the Law of the European Union, American and Comparative Constitutional Law, The Past and Future of the State, as well as advanced seminars on European Integration and Modern Legal Theory."
  },
  {
    "DisplayName": "Kevin R. Powers",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Business Law",
    "area3": "",
    "acfacAreas": "Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/kevin-powers.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/kevin-powers/_jcr_content/profileImage.img.png",
    "SortName": "Powers, Kevin R.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Kevin is the founding Director for the MS in Cybersecurity Policy and Governance Program at Boston College, and an Assistant Professor of the Practice at Boston College Law School and in Boston College's Carroll School of Management's Business Law and Society Department. With a combined 20 years of law enforcement, military, national security, business, higher education, and teaching experience, he has worked as an analyst and an attorney for the U.S. Department of Justice, U.S. Navy, U.S. Department of Defense, law firms in Boston and Washington, D.C., and as the General Counsel for an international software company based in Seattle, Washington. Along with his teaching at Boston College, Kevin is a Research Affiliate at the MIT Sloan School of Management and he has taught courses at the U.S. Naval Justice School and the U.S. Naval Academy, where he was also the Deputy General Counsel to the Superintendent. From 2016-2017, he was the Panel Lead for the Collegiate Working Group for the U.S. Department of Homeland Security's National Initiative for Cybersecurity Education (NICE). Kevin also serves as a Board Member for the Boston College Law School Business Advisory Council, a Regional Bank, and an International Software Company. Kevin regularly provides expert commentary regarding cybersecurity and national security issues for varying local, national, and international media outlets."
  },
  {
    "DisplayName": "Machenzie Queenin",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Corporate & Securities Law",
    "area3": "",
    "acfacAreas": "Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mackenzie-queenin.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mackenzie-queenin/_jcr_content/profileImage.img.png",
    "SortName": "Queenin, Mackenzie",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Mackenzie Queenin is an Adjunct Professor and co-teaches Cybercrime. She is an Assistant U.S. Attorney in the U.S. Attorney's Office in Boston, where she has worked since 2018. Queenin prosecutes white-collar crimes and specializes in complex financial and cybercrimes. She has investigated and prosecuted a variety of crimes including computer intrusions, securities fraud, insider trading, trafficking in counterfeit goods, and sex trafficking offenses. She has tried many cases to jury verdict, including on charges of wire fraud, mail fraud, federal programs bribery, money laundering, and cocaine distribution. Queenin is a co-chair of the White-Collar section at the Boston Bar Association and is a frequent speaker on various issues related to white-collar crimes and complex investigations. Before joining the U.S. Attorney's Office, Queenin worked for five years in private practice in Boston, where she represented individuals and corporations in government investigations and in complex commercial litigation. Queenin graduated magna cum laude from Providence College with B.A.s in Political Science and Sociology. She received her J.D. from Boston College Law School, where she was on the board of the Public Interest Law Foundation and participated in the Middlesex DA's Office Prosecution Clinic."
  },
  {
    "DisplayName": "Brian Quinn",
    "area1": "Corporate & Securities Law",
    "area2": "Business Law",
    "area3": "Clinical & Experiential Education",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/brian-quinn.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/brian-quinn/_jcr_content/profileImage.img.png",
    "SortName": "Quinn, Brian",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Brian JM Quinn joined Boston College Law School in 2008. He teaches Corporations, Corporations Lab, Mergers & Acquisitions, Mergers & Acquisitions Lab, as well as Deals: The Economic Structure of Transactions. Prof. Quinn's research focuses on corporate law, the structuring of transactions, transactional law, and private ordering. Prof. Quinn joined the law school from Stanford Law School where he was the Teaching Fellow for Corporate Governance & Practice. Prior to his position at Stanford, Prof. Quinn was in private practice with Cooley Godward in Palo Alto, where he represented public and private technology clients in merger and acquisitions transactions. Prof. Quinn also previously served as country coordinator for the Harvard University's Institute for International Development, managing Harvard's Vietnam-based teaching and research activities. Prof. Quinn got his start as a legislative aide to Senator Edward M. Kennedy working on health and education issues. Prof. Quinn writes on corporate law, transaction structures and private ordering. His work has appeared in numerous journals including the UC Davis Law Review, University of Cincinnati Law Review, the Journal of Corporation Law, and the Delaware Journal of Corporate Law among others. Prof. Quinn is a regularly cited in the media for his legal analysis and commentary on current merger transaction deal developments. Prof. Quinn also blogs on legal developments in corporate governance and mergers & acquisitions at the M&A Law Prof Blog. In addition, Prof. Quinn has written extensively on issues of legal reform in post-Socialist Asia, particularly Vietnam. Prof. Quinn is a member of the board of the Trust for University Innovation in Vietnam (TUIV). The TUIV is a 501(c)(3) organization with a mission to improve institutional innovation in Vietnam's system of higher education. Prof. Quinn is a non-resident fellow George Washington University Law School's Center for Law, Economics, and Finance, as well as an International Fellow at the Fulbright Economics Teaching Program at the University of Economics of Ho Chi Minh City, Vietnam. Prof. Quinn received the 2011 Professor Emil Slizewski Award for Faculty Excellence and the Provost's 2012 TWIN Award for the use of new technology in teaching."
  },
  {
    "DisplayName": "Aziz Rana",
    "area1": "Constitutional Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/aziz-rana.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/aziz-rana/_jcr_content/profileImage.img.png",
    "SortName": "Rana, Aziz",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Aziz Rana is a Professor and Provost's Distinguished Fellow at Boston College Law School and the incoming J. Donald Monan, S.J., University Professor of Law and Government (beginning 2024). He joins Boston College from Cornell Law School, where he was the Richard and Lois Cole Professor of Law. His research and teaching center on American constitutional law and political development. In particular, Rana's work focuses on how shifting notions of race, citizenship, and empire have shaped legal and political identity since the founding. His first book, The Two Faces of American Freedom (Harvard University Press) situates the American experience within the global history of colonialism, examining the intertwined relationship in American constitutional practice between internal accounts of freedom and external projects of power and expansion. His forthcoming book, The Constitutional Bind: How Americans Came to Idolize a Document that Fails Them (University of Chicago Press, 2024), explores the modern emergence of constitutional veneration in the twentieth century -- especially against the backdrop of growing American global authority -- and how veneration has influenced the boundaries of popular politics. Rana has written essays and op-eds for such venues as n+1, Dissent, The Boston Review, The Washington Post, The New York Times, New Labor Forum, Jacobin, The Guardian, The Chronicle of Higher Education, The Nation, Jadaliyya, Salon, and The Law and Political Economy Blog. He has articles and chapter contributions published or forthcoming with Yale and Oxford University Presses, The University of Chicago Law Review, California Law Review, UCLA Law Review, Texas Law Review, and the Yale Law Journal Forum, among others. Rana is an editorial board member of Dissent, The Law and Political Economy Blog, and Just Security. He is also a Life Member of the Council of Foreign Relations and a Non-Resident Fellow at the Quincy Institute for Responsible Statecraft.  ​He received his A.B. from Harvard College summa cum laude and his J.D. from Yale Law School. He earned a Ph.D. in political science at Harvard University, where his dissertation was awarded the University's Charles Sumner Prize."
  },
  {
    "DisplayName": "James R. Repetti",
    "area1": "Tax Law",
    "area2": "Business Law",
    "area3": "Family & Estate Law; International & Comparative Law;",
    "acfacAreas": "Business Law; Tax Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/james-repetti.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/james-repetti/_jcr_content/profileImage.img.png",
    "SortName": "Repetti, James R.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "The inaugural holder of the William J. Kenealy, S.J. Chair, Professor Repetti is co-author of the texts, Partnership Income Taxation, Introduction to United States International Taxation, Federal Wealth Transfer Taxation, Problems in Federal Wealth Transfer Taxation, and Tax Aspects of Organizing and Operating a Business. He is also a contributing author to the treatises, Comparative Income Taxation: A Structural Analysis and to The International Guide to Partnerships. Professor Repetti's numerous influential articles on taxation include 'Democracy and Opportunity: A New Paradigm in Tax Equity' in the Vanderbilt Law Review, 'Textualism and Tax Shelters' in the Virginia Tax Review and 'Democracy, Taxes and Wealth' in the NYU Law Review. He has acted as a consultant to the Internal Revenue Service and Justice Department, and has appeared as a commentator in publications such as the Christian Science Monitor, Forbes Magazine, the Wall Street Journal and Massachusetts Lawyers Weekly. Professor Repetti recently cofounded the Boston College Law School Tax Policy Workshop and organized and moderated a symposium at Boston College Law School entitled, 'The State of the Federal Income Tax: Rates, Progressivity, and Budget Processes,' articles from which were published in the Boston College Law Review. Professor Repetti has also served the University in a number of capacities. These include serving as the Associate Dean of Academics for the Law School, chairing the Law School Appointments Committee for several years, and serving on the University Provost Search Committee and the Law School Dean Search Committee. Professor Repetti is the former Chair of the Executive Committee of the Tax Section of the American Association of Law Schools and is an a Academic Fellow of the American College of Trusts and Estates Counsel. He practiced at Ropes & Gray until joining the Law School faculty and subsequently served as of counsel to Hill & Barlow. He holds a peer review 'AV Preeminent' rating from Martindale-Hubbell, which is the highest rating available to lawyers. In 1999, Law School students from all three classes voted Professor Repetti to be the first recipient of an award for excellence in teaching. Courses currently taught by Professor Repetti are individual income tax, corporate tax, estate and gift tax, partnership tax and international tax. He has also previously taught corporations, business planning, charitable organizations and accounting for lawyers."
  },
  {
    "DisplayName": "Diane M. Ring",
    "area1": "Tax Law",
    "area2": "International & Comparative Law",
    "area3": "",
    "acfacAreas": "Tax Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/diane-ring.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/diane-ring/_jcr_content/profileImage.img.png",
    "SortName": "Ring, Diane M.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Diane M. Ring is a Professor of Law and the Dr. Thomas F. Carney Distinguished Scholar at Boston College Law School, where she researches and writes primarily in the field of international taxation, corporate taxation, and ethical issues in tax practice. Her recent work addresses issues including information exchange, international tax relations, sharing and human equity transactions, and ethics in international tax. Ms. Ring was a consultant for the United Nation's 2014 project on tax base protection for developing countries, and the U.N.'s 2013 project on treaty administration for developing countries. She was the U.S. National Reporter for the 2012 IFA Conference on the Debt Equity Conundrum, and the U.S. National Reporter for the 2004 IFA Conference on Double Nontaxation. She was the Assistant General Reporter for the 1995 IFA Conference on Financial Instruments and was a consultant to the IFA research project on the impact of technological and financial innovation on the taxation of income and activities. She is the section chair for the Tax Section of the American Association of Law Schools, and is the Vice Chair for the Tax Section Committee of Teaching Taxation of the American Bar Association. Ms. Ring is also co-author of three case books in taxation– one on corporate taxation, one on international taxation, and one on ethical problems in federal tax practice. Prior to joining Boston College Law School, Ms. Ring was an associate professor of law at the University of Florida Levin College of Law, and an assistant professor at Harvard Law School. Before entering academia, Ms. Ring practiced at the firm of Caplin & Drysdale in Washington, D.C., specializing in the area of international tax and the taxation of financial instruments. Ms. Ring also clerked for Judge Jon O. Newman of the Second Circuit Court of Appeals."
  },
  {
    "DisplayName": "James S. Rogers",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/james-rogers.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/james-rogers/_jcr_content/profileImage.img.png",
    "SortName": "Rogers, James S.",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "James Steven Rogers, Emeritus Professor of Law, taught and writes in the areas of contracts, modern commercial law, particularly payment systems, the law of restitution, and the history of Anglo-American commercial law.Professor Rogers has played a major role in the development of modern commercial law. He served as Reporter (principal drafter) for the Drafting Committee to Revise UCC Article 8, which established a new legal framework for the modern system of electronic, book-entry securities holdings through central depositories and other intermediaries. One observer characterized that project as 'the most challenging and ambitious uniform or model law project since the creation of the UCC' and remarked on the 'outstanding work of the tireless and imaginative reporter, Professor James Steven Rogers.' Prof. Rogers has spoken on that project at numerous symposia and conferences both in the United States and abroad. He was also involved in the projects on negotiable instruments (UCC Articles 3 and 4) and secured transactions (UCC Article 9).He is widely published in law reviews on subjects of modern commercial law and bankruptcy, particularly in the fields of investment securities, negotiable instruments, and the history of Anglo-American commercial law. His 1995 book The Early History of the Law of Bills and Notes was published by Cambridge University Press. One reviewer of that book called it 'brilliant, daring, even iconoclastic in its scope,' noting that 'Rogers' book can only be called path-breaking.' Another remarked that while 'few technical subjects remain so nearly inaccessible to those engaged in interdisciplinary studies as the evolution of exchange mechanisms,' Rogers 'writes with great technical proficiency and precision' so that 'this is a book that most general historians will find accessible.' Yet another reviewer observed that 'this is a thoroughly absorbing and consistently illuminating book.'Professor Rogers' The End of Negotiable Instruments: Bringing Payment Systems Law Out of the Past, published by Oxford University Press, covers the modern law of payment systems and the role of history in the development of that law. Unlike most discussions of reform of payment systems law—which assume that the existing law works well for traditional paper-based systems—Rogers' book argues that the law of checks and notes, as set out in Articles 3 and 4 of the Uniform Commercial Code, is itself anachronistic and all but incoherent. The book shows much of the current law of checks and notes is the product of nothing more than that historical fluke, such as odd details of the eighteenth century Stamps Acts. It shows that there is no need for a statute governing promissory notes and that the law of checks would be far simpler if it treated checks simply as instructions to the financial system, akin to debit or credit cards.Rogers' work is well-known abroad as well as in the United States. He has participated in symposia on comparative aspects of the history of commercial law in Italy and Spain. He has spoken on the commercial law foundation of the securities clearance and settlement system at programs in England, Australia, China, Japan, Mexico, and the Netherlands. He served as one of the United States delegates to the Hague Conference on Private International Law project to negotiate and draft a Convention on Choice of Law for Securities Holding Through Securities Intermediaries and as a member of Drafting Group for that Convention.Prior to joining the Boston College Law School faculty, Rogers practiced with the firm of Sullivan & Worcester in Boston, Massachusetts and clerked for Judge Bailey Aldrich of the United States Court of Appeals for the First Circuit. He received a J.D. magna cum laude from Harvard Law School in 1976, where he served on the Harvard Law Review and was awarded the Fay Diploma for graduating first in his class in cumulative G.P.A. He received his A.B. summa cum laude from the University of Pennsylvania, 1973, where he studied philosophy and history."
  },
  {
    "DisplayName": "Evangeline Sarda",
    "area1": "Clinical & Experiential Education",
    "area2": "Ethics & Professional Responsibility",
    "area3": "Criminal Law & Procedure",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/evangeline-sarda.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/evangeline-sarda/_jcr_content/profileImage.img.png",
    "SortName": "Sarda, Evangeline",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Evangeline Sarda is an Associate Clinical Professor of Law at Boston College Law School. She has been teaching in the Criminal Justice Clinic and directing the Prosecution Program since 1995. She also has taught Introduction to Lawyering and Professional Responsibility and Authority, Identity and the Psychodynamics of Legal Systems. In 2001, Professor Sarda received a Boston College Teaching Advising and Mentoring Grant to pursue work in the field of group relations. As a result, she created and continues to teach Authority and Leadership in Professional Life which draws from group relations theory and methodology to explore the conscious and unconscious dynamics of legal systems and lawyering. In spring 2006, she received a Boston College Teaching Advising and Mentoring Expense Grant to host the first group relations workshop 'Negotiating Meaning of Authority and Justice' (director, Anat Ziff) for BCLS students. The workshop took place at the law school in April, 2006. She coordinated a second group relations learning event under the auspices of the Center for the Study of Groups and Social Systems called 'Flying the Plane While Reading the Manual: The Challenge of Getting the Task Done While Learning to Do It' (director, Earl Braxton) which took place in spring 2007 at the Boston College Connors Family Retreat and Conference Center. Professor Sarda received her B.A. from Yale University and her J.D. from Columbia Law School, where she was a founding member of the Columbia Journal of Gender and Law and the Executive Editor of the Columbia Human Rights Law Review. After law school, she was an assistant district attorney in Massachusetts with the Middlesex County District Attorney's Office, working primarily in the Domestic Violence Unit. Professor Sarda is married and is the mother of three wonderful children."
  },
  {
    "DisplayName": "Lumina Sato",
    "area1": "Clinical & Experiential Education",
    "area2": "Criminal Law & Procedure",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Lumina-Sato.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Lumina-Sato/_jcr_content/profileImage.img.png",
    "SortName": "Sato, Lumina",
    "facultyStatus": "Visiting Faculty",
    "priority": 3,
    "biography": "Lumina Sato works as a Public Defender at Committee for Public Counsel Services. She graduated cum laude from Boston College Law School, where she was a Public Service Scholar and a recipient of the Lewis S. Gurwitz Award for commitment to indigent defense. During law school she represented clients as a student attorney in the BC Defenders Clinic and BC Immigration & Asylum Project, and worked at Prisoners' Legal Services. Prior to law school she worked as an immigration paralegal at Masferrer & Associates, working primarily with clients facing deportation for their criminal records. Lumina holds a B.A. in Development Studies from Brown University. She is fluent in Spanish."
  },
  {
    "DisplayName": "Leslie Shaff",
    "area1": "Health Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/Leslie-Shaff.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Leslie-Shaff/_jcr_content/profileImage.img.png",
    "SortName": "Shaff, Leslie",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Leslie Shaff has led a wide-ranging career in the areas of law, medicine, business, and education. After earning her master's degree in teaching from Harvard University, she taught high school and junior college science for several years. During this time, she developed an interest in medicine and decided to earn an M.D. at UMass Medical School. After graduating, Shaff served as an associate anesthetist and assistant professor in anesthesia at Massachusetts General Hospital and Harvard Medical School. After working as a doctor for many years, she obtained her M.B.A. from the Wharton School and became a chief surgical services officer at Lahey Clinic. Most recently, Shaff earned a J.D. from Boston College Law School to complement her medical and business backgrounds. She has served as an adjunct professor at BC Law since 2019 and teaches in the areas of healthcare law and compliance."
  },
  {
    "DisplayName": "Bijal Shah",
    "area1": "Administrative & Government Law",
    "area2": "Constitutional Law",
    "area3": "Immigration Law",
    "acfacAreas": "Administrative & Government Law; Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/bijal-shah.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/bijal-shah/_jcr_content/profileImage.img.png",
    "SortName": "Shah, Bijal",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Bijal Shah is an Associate Professor of Law and Provost Faculty Fellow at the Boston College Law School. Before joining BC Law, she was an Associate Professor of Law at the Arizona State University, Sandra Day O'Connor College of Law and an Acting Assistant Professor of Law at the NYU School of Law. In Spring 2022, she was a Visiting Professor of Law at the UC Berkeley School of Law.Professor Shah's research lies at the intersection of administrative law and structural constitutionalism, and is grounded in the specifics of agency dynamics (particularly in matters of immigration and interagency coordination). She is also developing critical theories in these areas of law. Her work appears in publications including the Harvard Law Review, Stanford Law Review, Yale Journal on Regulation, and the Minnesota Law Review, among others. In addition, Professor Shah is the Chair Emeritus of the Association of American Law Schools Section on Legislation & Law of the Political Process. Before entering the academy, Professor Shah was Associate General Counsel for the Department of Justice / Executive Office for Immigration Review. In this position, she wrote immigration regulations, legislation and national policies on behalf of the Attorney General, White House and Congress. Earlier in her career, Professor Shah served as a Presidential Management Fellow in the Department of Homeland Security / U.S. Citizenship and Immigration Services, and served details in the Department of Justice, Homeland Security headquarters and the State Department. Professor Shah is a graduate of the Yale Law School, where she was a senior editor on the Yale Law Journal and a Yale University Kirby Human Rights Fellow. Professor Shah is also a graduate of the Harvard University, Kennedy School of Government and a Harvard University Sinclair Kennedy Fellow. Before entering law school, Professor Shah was an investment banker at UBS PaineWebber."
  },
  {
    "DisplayName": "Stephen Shay",
    "area1": "Tax Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "Tax Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/stephen-shay.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/stephen-shay/_jcr_content/profileImage.img.png",
    "SortName": "Shay, Stephen",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Before joining the Harvard Law School faculty as a Professor of Practice in 2011, Mr. Shay was Deputy Assistant Secretary for International Tax Affairs in the United States Department of the Treasury. Prior to re-joining the Treasury Department in 2009, Mr. Shay was a tax partner for 22 years with Ropes & Gray, LLP. Mr. Shay served in the Office of International Tax Counsel at the Department of the Treasury, including as International Tax Counsel, from 1982 to 1987, during which Mr. Shay actively participated in the development and enactment of international provisions in the Tax Reform Act of 1986. Mr. Shay is President of the American Tax Policy Institute Board of Trustees and is the IBFD Professor in Residence for 2015. Mr. Shay serves on the Executive Committee of the New York State Bar Association Tax Section and has been active in the American Bar Association Tax Section as a Council Director and Chair of the Committee on Foreign Activities of U.S. Taxpayers, in the American Law Institute as an Associate Reporter and in the Taxes Committee of the International Bar Association. Mr. Shay is a 1972 graduate of Wesleyan University, and he earned his J.D. and his M.B.A. from Columbia University in 1976."
  },
  {
    "DisplayName": "Francine Sherman",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/francine-sherman.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/francine-sherman/_jcr_content/profileImage.img.png",
    "SortName": "Sherman, Francine",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Francine Sherman is a Clinical Associate Professor at Boston College Law School where she has been teaching Juvenile Justice and Children's Rights & Public Policy for the past twenty years and where she founded and directs the Juvenile Rights Advocacy Program. She speaks and writes widely about the juvenile justice system and, in particular, about girls in the justice system. She has testified before Congress, served on the U.S. Department of Justice National Advisory Committee on Violence Against Women focusing on children and teens victimized by domestic violence and sexual assault, and as consultant to OJJDP's National Girls Initiative. Her most recent report, Gender Injustice: System-Level Juvenile Justice Reforms for Girls, provides a comprehensive overview of the needs and pathways of girls into and through the justice system and details a developmental approach to current juvenile justice reforms. She is also the author of Detention Reform and Girls, a volume of the Pathways to Detention Reform series published by the Annie E. Casey Foundation (2005), and Making Detention Reform Work for Girls: Practice Guide #5 (Annie E. Casey Foundation). She is also the author of the book, Juvenile Justice: Advancing Research, Policy and Practice (Wiley & Sons), and 'Justice for Girls: Are we Making Progress?' (UCLA Law Review). She is an ongoing consultant to the Annie E. Casey Foundation's Juvenile Detention Alternatives Initiative on strategies to reduce the detention of girls nationally, and regularly consults with national and local foundations and systems on issues related to girls in the justice system. Her current research continues to explore a developmental approach to juvenile justice for girls and young women and includes oral histories of young women with justice system histories, qualitative research focusing on pregnant and parenting young women in the juvenile justice system, and law and social science research with Impact Justice on LBQ/GNCT girls detained for prostitution."
  },
  {
    "DisplayName": "Natalya Shnitser",
    "area1": "Business Law",
    "area2": "Labor & Employment Law",
    "area3": "Administrative & Government Law; Tax Law; Corporate & Securities Law;",
    "acfacAreas": "Administrative & Government Law; Business Law; Tax Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/natalya-shnitser.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/natalya-shnitser/_jcr_content/profileImage.img.png",
    "SortName": "Shnitser, Natalya",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Natalya Shnitser is the inaugural David and Pamela Donohue Assistant Professor in business law. Her current research focuses on retirement security in the United States, including the provision of retirement benefits by private and public employers and the regulation of financial intermediaries. Before joining the faculty in 2014, she was an Associate Research Scholar in Law and the John R. Raben/Sullivan & Cromwell Executive Director of the Yale Law School Center for the Study of Corporate Law. Prior to her time at the Center for the Study of Corporate Law, she was an associate in the New York office of Cleary Gottlieb Steen & Hamilton. Shnitser received her J.D. degree from Yale Law School, where she was a Coker Fellow, editor of the Yale Law Journal, and editor-in-chief of the Yale Journal on Regulation. She is a Phi Beta Kappa graduate of Stanford University, where she received an M.A. in International Policy Studies and a B.A. in Economics. She currently teaches Corporations and Employee Benefits Law."
  },
  {
    "DisplayName": "Shelly Simana",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Ethics & Professional Responsibility",
    "area3": "Health Law",
    "acfacAreas": "Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/shelly-simana.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/shelly-simana/_jcr_content/profileImage.img.png",
    "SortName": "Simana, Shelly",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Shelly Simana's research lies at the intersection of bioethics and law, addressing ethical and legal challenges that arise as a consequence of scientific advancements in genetics, reproductive technologies, and biotechnology. Central to her research are two intertwined questions: what impact do advances in genetics, reproduction, and biotechnology have on individuals and society; and, how does the law shape this impact? These advances hold the potential to revolutionize health and well-being—but only if the law is set on a path that allows them to do so. Simana's work has been published in UC Irvine Law Review, Yale Journal of Law & Technology, Journal of Law, Medicine & Ethics, Journal of Law and the Biosciences, Journal of Medical Ethics, Bioethics, and Current Stem Cell Reports, and has been cited by the New York State Supreme Court. Prior to joining BC Law, Simana was a postdoctoral fellow at the Center for Law and the Biosciences at Stanford Law School, as well as a doctoral candidate at Harvard Law School. While pursuing her doctoral degree, Simana served as a teaching fellow at Harvard Law School, Harvard Medical School, and the Harvard T.H. Chan School of Public Health. She was also a research associate in the Program on Science, Technology, and Society (STS) at the Harvard Kennedy School of Government. Prior to her doctoral studies, Shelly was a visiting scholar in the Department of Bioethics at the National Institutes of Health (NIH), a clerk in Israel's High Court of Justice Department at the State Attorney's Office, and an associate attorney at S. Horowitz & Co., focusing on health law regulation."
  },
  {
    "DisplayName": "Mark Spiegel",
    "area1": "",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mark-spiegel.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mark-spiegel/_jcr_content/profileImage.img.png",
    "SortName": "Spiegel, Mark",
    "facultyStatus": "Emeritus Faculty",
    "priority": 2,
    "biography": "Mark Spiegel is a professor at Boston College Law School and has served as the faculty director of the Boston College Legal Assistance Bureau. His research interests focus on problems of professional ethics, particularly lawyer-client relations, and legal education. He teaches courses in civil procedure, federal courts, civil rights litigation, complex litigation, and professional responsibility. A former Reginald Heber Smith Fellow, Spiegel was assigned to work in legal services in Chicago. He previously taught at the University of Pennsylvania Law School, where he directed its clinical program. During the Fall of 1991, he visited at Harvard Law School and taught civil procedure. Spiegel has served on the board of directors of the Society of American Law Teachers and on the AALS Accreditation Committee. He received his B.A. from the University of Michigan and his J.D. from the University of Chicago."
  },
  {
    "DisplayName": "James Sweeney",
    "area1": "Clinical & Experiential Education",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/james-sweeney.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/james-sweeney/_jcr_content/profileImage.img.png",
    "SortName": "Sweeney, James",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Mr. Sweeney is State Trial Counsel with the Massachusetts Office of the Attorney General.He has been with the Attorney General's Office for over 25 years, previously serving as Deputy Chief of the Trial Division, Chief of the Southeastern Massachusetts Regional Office and as an Assistant Attorney General in the Trial Division.He has handled a wide range of civil litigation cases, through all phases of pleadings, discovery, motion practice, trials and appeals. Mr. Sweeney has been Co-Director of the Boston College Law School Attorney General Clinical Program and Seminar with Prof. Thomas Barnico since 2011.He is also a faculty member for the National Attorneys General Training and Research Institute (NAGTRI), teaching litigation skills at various Attorneys General Offices around the country.Prior to joining the Massachusetts Attorney General's Office, Mr. Sweeney was an Assistant Attorney General and General Counsel to the House of Representatives in New Hampshire. Mr. Sweeney is a 1983 graduate of Boston College Law School, cum laude, and a 1979 graduate of Providence College, magna cum laude."
  },
  {
    "DisplayName": "Sandy Tarrant",
    "area1": "Corporate & Securities Law",
    "area2": "Business Law",
    "area3": "Clinical & Experiential Education; Intellectual Property & Technology Law",
    "acfacAreas": "Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sandy-tarrant.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/sandy-tarrant/_jcr_content/profileImage.img.png",
    "SortName": "Tarrant, Sandy",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Sandy Tarrant is Associate Clinical Professor and Director of the Entrepreneurship & Innovation Clinic at Boston College Law School. In addition she teaches Introduction to Transactional Law, an experiential 1L elective course. Prof. Tarrant is also Of Counsel at Casner & Edwards, LLP in Boston, where she has represented tax exempt organizations, businesses and individuals working on nonprofit issues since 2004. Prior to joining Casner & Edwards, Prof. Tarrant was an Associate in both the Corporate and Public Finance practices at the Boston office of Mintz Levin where she worked with private and public companies on mergers and acquisitions, financings, public offerings, securities compliance, and governance. At Mintz, she developed a robust pro bono corporate practice and served on the firm's Pro Bono Committee. Before attending Boston College Law School, she worked in varying capacities for nonprofit and political organizations around New England, focusing on women's issues advocacy and progressive coalition building.In 2009 and 2016, Prof. Tarrant was Visiting Assistant Clinical Professor and Director of the BC Law Community Enterprise Clinic.She has served as a Board member and officer on many nonprofit organizations and community groups in Boston."
  },
  {
    "DisplayName": "Carlos M. Teuscher",
    "area1": "Business Law",
    "area2": "Corporate & Securities Law",
    "area3": "Clinical & Experiential Education; Intellectual Property & Technology Law",
    "acfacAreas": "Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/carlos-teuscher.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/carlos-teuscher/_jcr_content/profileImage.img.png",
    "SortName": "Teucher, Carlos M.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Carlos Masashi Teuscher is an associate clinical professor at Boston College Law School and director of BC Law's Community Enterprise Clinic. In the clinic, Teuscher trains and supervises student attorneys representing cooperative and other democratically-owned enterprises, grassroots organizations, nonprofits, and small businesses throughout Massachusetts on various transactional matters. Before joining BC Law, Teuscher was an assistant clinical professor at Suffolk University Law School where he founded and directed its Transactional Clinic and taught courses on transactional practice, community economic development, and secured transactions. Teuscher also worked as a lecturer in law and clinical instructor at Harvard Law School where he directed the Community Enterprise Project of the Transactional Law Clinics and taught courses on transactional public interest law.Prior to teaching, Teuscher practiced law at the international firms Linklaters and Dechert. He currently serves as a member of the Supreme Judicial Court Standing Committee on Pro Bono Legal Services. He received his J.D. from Georgetown University Law Center and his B.S. in biological sciences from the University of Southern California."
  },
  {
    "DisplayName": "Paul R. Tremblay",
    "area1": "Clinical & Experiential Education",
    "area2": "Ethics & Professional Responsibility",
    "area3": "Corporate & Securities Law; Business Law;",
    "acfacAreas": "Business Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paul-tremblay.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/paul-tremblay/_jcr_content/profileImage.img.png",
    "SortName": "Tremblay, Paul R.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Paul R. Tremblay is a Clinical Professor of Law at Boston College Law School. A member of the faculty since 1982, he teaches clinical courses at BC Legal Services LAB within the Center for Experiential Learning. He served as the Associate Dean for Experiential Learning until 2015. Professor Tremblay also teaches a professional responsibility course each year. Prior to his appointment at Boston College Law School, Professor Tremblay was a Senior Attorney at the Legal Aid Foundation of Los Angeles and an instructor at UCLA School of Law. Professor Tremblay directs the Community Enterprise Clinic, Boston College Law School's transactional clinical course. In the Community Enterprise Clinic, students represent low- and moderate-income entrepreneurs, small businesses, and nonprofit organizations. The mission of the Community Enterprise Clinic is to support economic progress in under-resourced neighborhoods, and to offer a vibrant educational experience to students interested in business law, transactional work, and community economic development. Before developing the transactional clinic, Professor Tremblay taught civil litigation and housing law clinics at LAB. Professor Tremblay is actively involved in matters of professional ethics, transactional practice, interdisciplinary collaboration, and legal services for the poor. He has been a member of the Boston Bar Association Ethics Committee since 1993, and a board member of Lawyers Clearinghouse since 2010. He has also served on the Executive Committee of the AALS Section on Professional Responsibility. He is the co-author of two textbooks used in law school clinics around the country, and more than 25 law review articles. Professor Tremblay was the recipient of the 2004 Outstanding Advocate for Clinical Teachers Award from the Clinical Legal Education Association and was awarded the Emil Slizewski Excellence in Teaching Award in 2008."
  },
  {
    "DisplayName": "Hon. Robert L. Ullmann",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/robert-ullmann.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/robert-ullmann/_jcr_content/profileImage.img.png",
    "SortName": "Ullmann, Robert L.",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "The Honorable Robert L. (Bob) Ullmann is a trial judge on the Massachusetts Superior Court, where he handles criminal and civil cases. Before becoming a judge in 2013, Judge Ullmann was a trial lawyer for 30 years, litigating criminal and civil cases in federal and state courts.He served more than 10 years with the U.S. Justice Department, including stints as the First Assistant U.S. Attorney and Chief of the Criminal Division in the U.S. Attorney's Office in Boston. In 1994, Attorney General Janet Reno appointed him as a Senior Litigation Counsel, the senior trial attorney position in the Department of Justice. As a criminal defense attorney, Judge Ullmann's courtroom successes included acquittals in healthcare and securities fraud cases of national import.He also handled a wide range of other criminal and civil cases in federal and state court, including extensive pro bono work. Judge Ullmann is a Fellow of the American College of Trial Lawyers, the Boston Bar Foundation and the Massachusetts Bar Foundation."
  },
  {
    "DisplayName": "Daniela Urosa",
    "area1": "International & Comparative Law",
    "area2": "Clinical & Experiential Education",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/daniela-urosa.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/daniela-urosa/_jcr_content/profileImage.img.png",
    "SortName": "Urosa, Daniela",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Dr. Daniela Urosa received her PhD cum laude in Law from Universidad Complutense de Madrid in 2002, and her LL.B summa cum laude, from Universidad Católica Andrés Bello in 1997. Dr. Urosa has been the Professor and Director of the Master in Constitutional Law and the Master in Administrative Law at the Universidad Católica Andrés Bello Caracas, Venezuela since January 2007 and a Professor of Administrative Law and Constitution Law since 2003. She is the vice president of the Venezuelan Association of Administrative Law. Dr. Urosa is researching the comparative development of rule of law and democratic principles as applied in the power of judicial review in the US Supreme Court and Venezuelan Tribunal Supremo de Justicia."
  },
  {
    "DisplayName": "Steven Van Dyke",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/steven-van-dyke.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/steven-van-dyke/_jcr_content/profileImage.img.png",
    "SortName": "Van Dyke, Steven",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Steven Van Dyke has worked for over fifteen years as a public defender with the Committee for Public Counsel Services (CPCS). Throughout that time, he has represented indigent clients accused of crimes in Suffolk, Essex and Middlesex counties. He has also served in the CPCS training unit. He is a graduate of Boston College Law School ('08) and Cornell University ('05).While at BC Law, he took part in the BC Defenders program and received the Susan Grant award for public service achievement and leadership. A fellow student in the clinic was so impressed that she agreed to marry him. He was also a member of the BC Law Mock Trial team. He is one of the 2023 recipients of CPCS' Willie J. Davis and Edward J. Duggan award for outstanding criminal defense advocacy."
  },
  {
    "DisplayName": "Maureen Van Neste",
    "area1": "Legal Research",
    "area2": "Clinical & Experiential Education",
    "area3": "",
    "acfacAreas": "",
    "URL": "http://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/maureen-van-neste.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/maureen-van-neste/_jcr_content/profileImage.img.png",
    "SortName": "Van Neste, Maureen",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Professor Van Neste joined the BC Law faculty in 2017. From 2014-2017, she served on the faculty at Chicago-Kent College of Law at Illinois Institute of Technology, where she served as the Director of Experiential Learning and supervised the upper-level legal research and writing program. Prior to joining academia full time, Professor Van Neste worked in the Chicago office of Grant Thornton LLP, a national public accounting firm. As a senior counsel at Grant Thornton, she managed complex securities and accounting litigation, oversaw the firm's response to regulatory investigations and subpoenas, negotiated professional service and vendor agreements, and counseled firm professionals on risk management issues. During this time, she also served as an adjunct professor of legal writing at Loyola University Chicago School of Law. Prior to joining Grant Thornton, she was an associate in the litigation department at Winston & Strawn LLP. Professor Van Neste received her J.D. from Georgetown University Law Center. During law school, she served as a law fellow in the first-year legal writing program and a senior writing fellow in the law school's Writing Center. She has had additional education experience as a high school classroom teacher and in the nonprofit sector. Professor Van Neste earned a BA in Policy Studies from Syracuse University and a Master of Public Administration from Syracuse's Maxwell School of Citizenship and Public Affairs."
  },
  {
    "DisplayName": "John Ward",
    "area1": "Civil & Human Rights Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/john-ward.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/john-ward/_jcr_content/profileImage.img.png",
    "SortName": "Ward, John",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "John Ward received his J.D. degree from Boston University. Law School in 1976. After clerking for Judge Raymond Pettine in the U.S. District Court for the District of Rhode Island, he went into private practice in Boston in 1977. In 1978, in response to a pattern of police harrassment of gay men, he gathered a group of community activists and founded GLAD, Gay and Lesbian Advocates and Defenders (now GLBTQ Legal Advocates and Defenders). He has handled a number of noteworthy cases involving LGBTQ clients, including the Rhode Island prom case, vindicating the right of a high school senior to bring another young man to the prom as his date, and the Boston St. Patrick's Day Parade case. In that case, he was the first openly gay man to appear before the U.S. Supreme Court. Recently, he was co-counsel in a case involving the first transgender woman in Massachusetts to be housed in a gender-appropriate prison – MCI Framingham, defending her against what the defense alleged was a retaliatory criminal prosecution. Ward also represented death row inmates in post-conviction proceedings in California. Ward was recently selected by the History Project to receive the 2021 Historymaker Award. He is still in private practice in Boston and lives in Providence with his husband, Alain Balseiro."
  },
  {
    "DisplayName": "Ryan Williams",
    "area1": "Constitutional Law",
    "area2": "Civil Litigation & Procedure",
    "area3": "",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/ryan-williams.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/ryan-williams/_jcr_content/profileImage.img.png",
    "SortName": "Williams, Ryan",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Hon. Neil K. Sherring is the Presiding First Justice of the Metro-South Division of the Massachusetts Housing Court. He was appointed to the bench by Governor Charlie Baker in 2018. Judge Sherring is Co-Chair of the Housing Court's Educational Committee. Prior to joining the bench, Sherring was a partner at Dakoyannis & Sherring, LLC, where he was managing partner of the firm's litigation department.He also was a litigation associate at the Boston firm of Mintz Levin, a Massachusetts Assistant Attorney General, an Assistant District Attorney for the Northwestern District and a Massachusetts Superior Court Law Clerk. Sherring has served as Program Chair and faculty member of the Massachusetts Continuing Legal Education “Trying your First Civil Case in the Superior Court” and “Deposition Workshop.”He is a Advisory Board Member of the South Asian Bar Association, co-founder of the South Asian Domestic Violence Task Force and former member of the Middlesex County District Attorney's External Diversity Committee."
  },
  {
    "DisplayName": "Paul Wilson",
    "area1": "Civil Litigation & Procedure",
    "area2": "Real Estate Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/paul-wilson.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/paul-wilson/_jcr_content/profileImage.img.png",
    "SortName": "Wilson, Paul",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Hon. Paul D. Wilson is an associate justice of the Middlesex Superior Court in Massachusetts. He was appointed to the bench by former Governor Deval Patrick in 2012. Wilson filled the vacancy created by the retirement of Wendie I. Gershengorn (Ret). Prior to joining the bench, Wilson was a senior partner at Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, P.C., where he was a member of the firm's litigation section. As such, he specialized in civil litigation pertaining to the real estate industry. He joined the firm in 1982 after completing a clerkship for the Hon. Orinda Evans with the United States District Court for the Northeastern District of Georgia. Wilson also served as a member of the governing body of the American Bar Association's Section of State and Local Government Law."
  },
  {
    "DisplayName": "David A. Wirth",
    "area1": "Environmental Law",
    "area2": "International & Comparative Law",
    "area3": "Administrative & Government Law; Civil & Human Rights Law;",
    "acfacAreas": "Administrative & Government Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/david-wirth.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/david-wirth/_jcr_content/profileImage.img.png",
    "SortName": "Wirth, David A.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "David A. Wirth is Professor of Law at Boston College Law School in Newton, Massachusetts, where he has served as Director of International Programs. Professor Wirth teaches primarily in the field of public international law. He has a particularly strong research interest in international environmental law, an area in which he has worked and practiced for more than two decades. In addition to Boston College, he has taught at Harvard, M.I.T., Oxford, the Fletcher School of Law and Diplomacy, and the University of Virginia. Prior to moving to academia, Professor Wirth was Senior Attorney and Co-Director of the International Program at the Washington, D.C. office of the Natural Resources Defense Council (NRDC), a nonprofit public interest law firm specializing in environmental issues. While there, he worked on a variety of international environmental issues, including environmental reform of World Bank and regional development banks, the 'greenhouse' effect, Soviet and eastern European environmental issues, stratospheric ozone depletion, and exports of hazardous substances. Professor Wirth has also been Attorney-Adviser for Oceans and International Environmental and Scientific Affairs in the Office of the Legal Adviser of the U.S. Department of State in Washington, D.C., where he had principal responsibility for all international environmental issues, including exports of hazardous substances and technologies, acid rain, and stratospheric ozone depletion. In his positions at the Department of State and NRDC, Professor Wirth has had extensive experience in multilateral negotiations under the auspices of the United Nations Environment Program, the Organization for Economic Cooperation and Development, the UN Economic Commission for Europe, and other international organizations. Professor Wirth is a 1981 graduate of the Yale Law School and served as law clerk to Judge William H. Timbers of U.S. Court of Appeals for the Second Circuit in New York for a year thereafter. He holds undergraduate and graduate degrees in chemistry from, respectively, Princeton University and Harvard University, at which he held a National Science Foundation Fellowship. During the summer of 1997, he was a Fulbright Scholar through the Organization for Security and Cooperation in Europe (OSCE) Regional Research Program. A life member of the Council on Foreign Relations, Professor Wirth has served on advisory boards to a number of institutions of higher learning, domestic agencies, and international organizations, including Vermont Law School, the Environmental Protection Agency and the European Bank for Reconstruction and Development. He has been a consultant to the United Nations Development Program, the United Nations Environment Program, the North American Commission for Environmental Cooperation, the C.S. Mott Foundation, the German Marshall Fund of the United States, and the Belgian State Secretary for Energy and Sustainable Development. A prolific writer, Professor Wirth is the author of more than fifty articles and reports on international environmental law and policy for legal, academic, professional, and popular audiences. He is co-author of major new editions of legal texts on international organizations and environmental law. Professor Wirth is currently at work on a scholarly treatise on the role of science in international trade law. His published work has appeared in numerous highly respected journals, including the Yale Law Journal, the Columbia Law Review, the Virginia Law Review, Foreign Policy, and the American Journal of International Law."
  },
  {
    "DisplayName": "Alfred Chueh-Chin Yen",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Clinical & Experiential Education",
    "area3": "Business Law",
    "acfacAreas": "Business Law; Intellectual Property & Technology Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/alfred-chueh-chin-yen.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/alfred-chueh-chin-yen/_jcr_content/profileImage.img.png",
    "SortName": "Yen, Alfred Chueh-Chin",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Alfred C. Yen is the Associate Dean of Faculty and a Professor of Law at Boston College Law School, Law School Fund Scholar, and Director of the Emerging Enterprises and Business Law Program. He is a nationally known scholar who has published numerous articles about copyright law, the Internet, Asian-American legal issues, and law teaching. His recent works include 'Third Party Liability After Grokster,' which appeared in the Minnesota Law Review and a new casebook on copyright (co-authored with Professor Joseph Liu) entitled 'Copyright: Essential Cases and Materials,' which was published by West Publishing in 2008. Professor Yen has also held many positions of leadership within legal education and the broader practicing bar. He recently served as Chair of the AALS Professional Development Committee and completed a term on the Board of Editors for the Journal of Legal Education and the Board of Governors for the Society of American Law Teachers. In 2001, the American Law Institute elected him to membership in the Institute. Additionally, Professor Yen has served as chair of the Association of American Law Schools Section on Art Law and its Section on Minority Groups. He organized the first, fifth, and tenth Conference of Asian Pacific American Law Faculty, all of which were held at Boston College Law School. In 1992, Professor Yen wrote and filed an amicus brief with the United States Supreme Court on behalf of 12 copyright scholars in the case of Campbell v. Acuff-Rose Music Publishing Co. He also joined another group of copyright scholars to file an amicus brief in the case of A&M Records. Inc. v. Napster, Inc. during the summer of 2000. Professor Yen is a graduate of Stanford University and Harvard Law School. Before joining the faculty in 1987, he practiced law in Los Angeles for four years at the firm of Sheppard, Mullin, Richter and Hampton."
  },
  {
    "DisplayName": "Katharine G. Young",
    "area1": "Constitutional Law",
    "area2": "International & Comparative Law",
    "area3": "Civil & Human Rights Law; Legal History & Jurisprudence",
    "acfacAreas": "Constitutional Law;",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/katharine-young.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/katharine-young/_jcr_content/profileImage.img.png",
    "SortName": "Young, Katharine G.",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Katharine Young joined the faculty as Associate Professor in July 2013. Before coming to Boston College, she was an Associate Professor at the Australian National University, and has been a Visiting Assistant Professor at Boston University and a Byse Teaching Fellow at Harvard Law School. Her fields of expertise are economic and social rights, comparative constitutional law and international human rights law. Professor Young's recent book, Constituting Economic and Social Rights (OUP, 2012), is published in the Oxford Constitutional Theory series. Other recent publications have appeared in the Harvard Human Rights Journal, the Harvard Law Review Forum, the International Journal of Constitutional Law, the Australian Year Book of International Law, and the Yale Journal of International Law. Professor Young completed doctoral and masters studies in law (the S.J.D. and LL.M.) at Harvard Law School and legal studies at Melbourne University and at the University of Heidelberg. She has been a Fellow at Harvard University's Project on Justice, Welfare and Economics, the Edmond J. Safra Center for Ethics and the Weatherhead Center for International Affairs. Professor Young has professional legal experience in Melbourne, New York, in the United Nations and in an NGO in Accra, Ghana. She served as Clerk for The Hon Michael Kirby AC CMG at the High Court of Australia. At Boston College, she teaches Contracts and Human Rights and Global Poverty."
  },
  {
    "DisplayName": "Adnan Zulfiqar",
    "area1": "Criminal Law & Procedure",
    "area2": "Legal History & Jurisprudence",
    "area3": "Civil & Human Rights Law;International & Comparative Law",
    "acfacAreas": "Criminal Law & Procedure;",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/adnan-zulfiqar.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/adnan-zulfiqar/_jcr_content/profileImage.img.png",
    "SortName": "Zulfiqar, Adnan",
    "facultyStatus": "Full-Time Faculty",
    "priority": 1,
    "biography": "Adnan A. Zulfiqar, an interdisciplinary scholar in the fields of law, history, and religion whose research focuses on critically examining frameworks underlying legal discourses in both domestic and global contexts, is an associate professor at BC Law and a courtesy appointment in Boston College's Theology Department.His primary fields of inquiry have been into criminal law and procedure, Islamic law, and the rule of law in the Global South. Zulfiqar's most recent scholarship studies how Muslim jurists conceive of and utilize collective duties, particularly in the context of war and revolution. He has spent over a decade working in the Middle East, South Asia, and sub-Saharan Africa.Zulfiqar has held numerous fellowships, including at the University of Pennsylvania, Stanford, and Damascus University in Syria, and was a Harry F. Guggenheim Fellow. A number of journals have published his work, among them the Yale Journal of International Law and Harvard's Journal of Islamic Law.Prior to joining BC Law, Zulfiqar taught at Rutgers Law School. He is a former international legal consultant for the United Nations Development Programme, where he assisted with the drafting and implementation of new criminal codes and commentaries for the Republic of the Maldives. He also helped draft a new criminal code for Somalia under the auspices of the International Development Law Organization.Zulfiqar's past experiences extend to private practice at Hogan Lovells in Washington, DC; to Congress as a legislative staffer to US Senator Max Cleland; and to the Philadelphia Human Relations Commission as a commissioner. From the University of Pennsylvania, he earned three degrees: his J.D. and his M.A./Ph.D. in near eastern languages and civilization. He received his M.L.S. in international affairs from Georgetown University, and his B.A. from Emory University."
  },
  {
    "DisplayName": "Scott Cann",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/scott-cann.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/scott-cann/_jcr_content/profileImage.img.png",
    "SortName": "Cann, Scott",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Scott Cann is an Information Technology executive with over 25 years of progressive leadership experience in dynamic environments, from the private sector to government, and higher education. He possesses a deep understanding of the higher education environment, its culture, challenges, opportunities, and trends. Cann has a successful track record building and maintaining partnerships with students, faculty, and staff in order to meet the various technology needs of the university community. He is a leader with demonstrated strategic planning orientation, with the ability to develop and execute strategic plans, and successfully manage change. He is also a highly collaborative leader, with proven mentoring and relationship management skills, leading others to become their best, in order to amplify our collective contributions to a larger strategy, ensuring we provide the best service possible."
  },
  {
    "DisplayName": "Mary Beth Chopas",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/bc-web/schools/law/academics-faculty/faculty-directory/mary-beth-chopas.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/mary-beth-chopas/_jcr_content/profileImage.img.png",
    "SortName": "Chopas, Mary Beth",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Mary Beth Chopas is a judicial law clerk for the United States District Court of Massachusetts. Previously, she served as a lecturer at Harvard law School, an adjunct professor at the University of North Carolina School of Law, and a senior lecturing fellow at Duke University School of Law. Prior to that, Chopas served as the Climenko-Thayer Lecturer at Harvard Law School, where she taught the First-Year Lawyering Program. Chopas is a BC Law graduate. After law school, she clerked for Justice William R. Johnson of the New Hampshire Supreme Court and worked as a litigation associate before becoming the assistant attorney general in Government Bureau/Trial Division of the Massachusetts Office of the Attorney General."
  },
  {
    "DisplayName": "Michael Crowley",
    "area1": "Criminal Law & Procedure",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/michael-crowley.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/michael-crowley/_jcr_content/profileImage.img.png",
    "SortName": "Crowley, Michael",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Michael Crowley is presently serving as an Assistant United States Attorney in Boston and has been serving in Massachusetts since 2009. He is presently a member of the Organized Crime and Gang Unit of the Office after serving in the Major Crimes Unit. Prior to his tenure in Boston, he served as an Assistant United States Attorney in the Southern District of California in the San Diego Office beginning in 2003. At the Southern District, he was initially a member of the General Crimes Unit followed by an assignment in the Narcotics Unit in which he prosecuted not only large, international drug trafficking organizations but also organized crime and streetgang cases. He began his career in private practice as a litigator involved in labor and employment law at two large firms. He is an undergraduate of Harvard College and has a law degree from the Duke University School of Law where he was a member of the Duke Law Review."
  },
  {
    "DisplayName": "Doug Domin",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Criminal Law & Procedure",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/doug-domin.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/doug-domin/_jcr_content/profileImage.img.png",
    "SortName": "Domin, Doug",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Doug Domin is a Supervisory Special Agent at the FBI Boston Cyber Task Force. Prior to beginning his career at the FBI, Domin was an incident responder at Sun Microsystems and supported Sun's Enterprise server line and Solaris Operating System. In his 20-year career with the FBI, Domin has primarily worked on cyber investigations both domestically and with law enforcement partners around the world. In addition to his work in the field, Domin has worked at the FBI Cyber Division as a program manager and team lead for the FBI Cyber Action Team. Since 2016, he has worked exclusively on computer intrusion matters in the Boston area, focused exclusively on ransomware and criminal cyber threats. He received his M.S. in Cybersecurity, Policy & Governance from Boston College and holds the CISSP and GRCA industry certifications."
  },
  {
    "DisplayName": "Adam Glick",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/adam-glick.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/adam-glick/_jcr_content/profileImage.img.png",
    "SortName": "Glick, Adam",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Adam Glick is currently the Chief Information Security Officer for PSG Equity in Boston, MA. Previously, he was the CISO for SimpliSafe, CISO for Rocket Software, and Vice President of Cyber Risk for Brown Brothers Harriman where he focused on program, policy, controls, and all facets of information security. Prior to this role, he was the Vice President of Information Technology and Information Security Officer for Century Bank for 5 years. His responsibilities included operationally managing all IT systems and all matters pertaining to information security, risk, policy and procedure. Glick is currently an adjunct professor at Boston College in the cybersecurity policy & governance program, and previously taught in the MBA program at the School of Business at Providence College. Prior to these roles he worked as a Security Engineer at Brown University and a Security Analyst at Providence College. He received both his undergraduate degree in education and his MBA from Providence College. Outside of the office, he is a car and technology enthusiast along with an avid reader, hiker, and cyclist."
  },
  {
    "DisplayName": "Elbert Hardeman",
    "area1": "Intellectual Property & Technology Law",
    "area2": "Corporate & Securities Law",
    "area3": "Business Law",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/elbert-hardeman.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/elbert-hardeman/_jcr_content/profileImage.img.png",
    "SortName": "Hardeman, Elbert",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Elbert Hardeman is an Assistant Vice President and the Operational Risk & Cybersecurity Compliance Officer for the Federal Reserve System – National IT. Hardeman has had a 15-year career at the Federal Reserve, working for the Boston Fed, Cleveland Fed as well as the Richmond Fed. Prior to his current role, Hardeman served as an Assistant Vice President of Information Technology and Resilience and was the Business Continuity Officer for the Federal Reserve Bank of Cleveland,  prior to that role, he served as the Deputy Information Security Officer (ISO) in the Federal Reserve National IT Information Security Office. Hardeman also served as the Information System Security Officer (ISSO) for two U.S. Treasury payment applications at the Federal Reserve Bank of Boston. Prior to joining the Federal Reserve, Hardeman worked as an IT consultant with Deloitte in New York City. Hardeman also served as a Peace Corp Volunteer in Morocco. Hardeman currently serves on the board of the Boston Debate League, an after-school debate program in Boston. \n\nHardeman has earned a bachelor’s degree in business – Management Information Systems from California Polytechnic State University, a Master's in Business Administration (M.B.A.), and a Master's in Cybersecurity, Risk and Governance from Boston College. He is a Certified Information Systems Auditor (CISA),  a member of the Association of Certified Fraud Examiners (ACFE), and a proud Eagle Scout."
  },
  {
    "DisplayName": "Hillary Hoffman",
    "area1": "Environmental Law",
    "area2": "Civil & Human Rights L aw",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Hillary-Hoffman.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Hillary-Hoffman/_jcr_content/profileImage.img.png",
    "SortName": "Hoffman, Hillary",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Professor Hoffmann's areas of expertise include environmental law, federal Indian law, and natural resources law.  Her recent scholarship analyzes the systems governing natural resource uses on federal and tribal lands and explores the conflicts that arise from Constitutional and other legal challenges facing indigenous nations and indigenous peoples in the United States.  She has also lectured and published extensively on the topics of energy development, mining, livestock grazing, and other extractive uses of public lands and tribal lands.   Her recent book—A Third Way: Decolonizing the Laws of Indigenous Cultural Protection (Cambridge U. Press 2020)—examines the federal and state legal structures inhibiting the protection of indigenous cultural values and resources, including modern environmental laws, and explores the various legal mechanisms that tribes and other indigenous communities are using, challenging and changing to better protect their lands, cultures, and citizens.\n\nProfessor Hoffmann was in private practice at a large law firm in Salt Lake City, Utah. Her work included general commercial litigation, administrative appeals, and state and federal natural resource cases. She represented a wide variety of clients in state and federal court, and before the Department of Interior’s Office of Hearings and Appeals.  Professor Hoffmann received her BA in Spanish literature with high honors from Middlebury College and her JD from the S. J. Quinney College of Law at the University of Utah. In law school, she was a William H. Leary Scholar, the Richard L. Dewsnup Fellow in Natural Resource Law, and a member of the Utah Law Review.  Professor Hoffmann is licensed in Utah and Vermont and is admitted to the Vermont Supreme Court, the Utah Supreme Court, the federal district courts for the districts of Utah and Vermont, and the Ninth Circuit Court of Appeals.  She is a member of the Vermont Commission on Native American Affairs and the American Law Institute."
  },
  {
    "DisplayName": "Hon. Jeffrey Locke",
    "area1": "Civil Litigation & Procedure",
    "area2": "Criminal Law & Procedure",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Jeffrey-locke.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Jeffrey-locke/_jcr_content/profileImage.img.png",
    "SortName": "Locke, Jeffrey",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "The Hon. Jeffrey Locke has been the Associate Justice of the Massachusetts Superior Court since 2001. He received his B.A. at Georgetown University and J.D. at Boston University School of Law. He went on to work in the Middlesex County District Attorney’s Office and United States Attorney’s Office as an Assistant Attorney and was also a District Attorney for the Norfolk County District Attorney’s Office. In 2000, he was commissioner of the Massachusetts Department of Social Services before being appointed to the Superior Court a year later.\n\nHon. Jeffrey Locke has earned multiple awards including the Public Advocacy Award from the Child Welfare League of America in 2000, a Commissioner’s Citation from the U.S. Customs Service in 1993, a Superior Performance Award from the Department of Justice in 1991, and a pair of Letters of Commendation from the F.B.I. in 1990 and 1998. He also has extensive teaching experience over the years including work at Northeastern University School of Law Boston, the Attorney General’s Advocacy Institute Washington, D.C., Massachusetts Continuing Legal Education, the Federal Bureau of Investigation Undercover Training Program, and the National College of District Attorneys."
  },
  {
    "DisplayName": "Etay Maor",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/etay-maor.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/etay-maor/_jcr_content/profileImage.img.png",
    "SortName": "Maor, Etay",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Etay Maor is the Sr. Director of Security Strategy at Cato Networks and an industry recognized cyber security researcher and keynote speaker. Previously, Maor was the Chief Security Officer for IntSights, where he led strategic cybersecurity research and security services. Before that, Maor held numerous leadership and research positions as an Executive Security Advisor at IBM, where he created and led breach response training and security research, and as Head of RSA Security’s Cyber Threats Research Labs, where he managed malware research and intelligence teams and was part of cutting edge security research and operations.\n\nMaor holds a B.A. in Computer Science and an M.A. in Counter Terrorism and Cyber Terrorism. Maor is a frequent featured speaker at major industry conferences and is part of the RSA Conference and QuBits conference committees. He is often tapped by major news outlets for his astute commentary on and insights into the cybersecurity news of the day."
  },
  {
    "DisplayName": "John Moskal",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/john-moskal.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/john-moskal/_jcr_content/profileImage.img.png",
    "SortName": "Moskal, John",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Mr. Moskal has a 25-plus year track record in the energy and environmental industries as a regulator, investor, consultant, entrepreneur, and teacher with a focus on clean energy technologies and energy efficiency. He currently works at the New England regional office of the EPA where he specializes in environmental impacts associated with restructured energy markets, energy efficiency and renewable energy technologies. He is a frequent speaker at professional forums on these topics, and a frequent guest lecturer at several New England Universities. He is an engineer by training."
  },
  {
    "DisplayName": "Gregory P. Noone",
    "area1": "International & Comparative Law",
    "area2": "Civil & Human Rights Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/gregory-p-noone.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/gregory-p-noone/_jcr_content/profileImage.img.png",
    "SortName": "Noone, Gregory",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Gregory Noone is the Executive Director and a Senior Peace Fellow for the Public International Law and Policy Group (PILPG). In addition to managing several transitional justice and human rights documentation initiatives at PILPG, Noone has worked as a Senior Program Officer for the United States Institute of Peace (USIP). While at USIP, Noone received a Special Act Award for his work in Afghanistan.\n\nNoone is a retired Captain (O-6) in the United States Navy with over 30 years of service as a judge advocate, multiple deployments, and held command three times. Noone has trained senior military, governmental, and non-governmental civilian personnel in the Law of Armed Conflict, Human Rights, and other international law topics in over sixty countries (and has been to 96 countries).\n\nNoone has also worked as a government prosecutor and a criminal defense counsel and appears regularly as a commentator on international and national TV and radio.\n\nIn 2012, Noone was appointed by the United Nations to an Independent Experts Panel tasked to review the UN’s Office of Internal Oversight.\n\nNoone was recognized as the 2012 West Virginia Professor of the Year."
  },
  {
    "DisplayName": "Christopher Porter",
    "area1": "Intellectual Property & Technology Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/christopher-porter.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/christopher-porter/_jcr_content/profileImage.img.png",
    "SortName": "Porter, Christopher",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Christopher Porter is the Head of International Security Cooperation at Google Cloud, where he leads a variety of programs to exchange intelligence with public sector partners worldwide and facilitate substantive discussions between Google’s security leaders and top outside experts.\n\nFrom 2019 to June 2022 he was the National Intelligence Officer for Cyber, leading the US Intelligence Community’s analysis of foreign cyber threats and threats to US elections. As a member of the National Intelligence Council, Porter oversaw production of National Intelligence Estimates, was the primary cyber intelligence advisor to the Director of National Intelligence, developed the analytic portion of the Unified Intelligence Strategy, and lead the IC Cyber Analysis Leadership Council made up of the other cyber leaders of CIA, FBI, NSA, DOD, and other agencies.\n\nServing under both the Trump and Biden Administrations, he frequently briefed and wrote for the President of the United States, senior Cabinet officials, the Gang of Eight and other legislative leaders in the US House of Representatives and Senate, and civilian and military cyber leaders throughout the executive branch.\n\nFrom 2016 to 2019, Porter was the Chief Technology Officer for Global Cybersecurity Policy and the Chief Intelligence Strategist at cybersecurity company FireEye.\n\nAs a Senior Fellow at the Atlantic Council, Porter has contributed to the Cyber Statecraft Initiative within the Scowcroft Center for Strategy and Security. His research focused on cyber diplomacy broadly, practical methods of reaching and enforcing cyber arms control agreements, and artificial intelligence as a security issue.\n\nPorter has testified before the U.S. Congress and Canadian Parliament. He has offered commentary on cybersecurity and threat intelligence in the New York Times, USA Today, NBC News, the Council on Foreign Relations, BBC, Lawfare, Foreign Policy, Defense One, Christian Science Monitor, Bloomberg News, Cipher Brief, War on the Rocks, Politico, Axios, Cyberscoop, Dark Reading, Roll Call and many other TV, radio, and print outlets worldwide."
  },
  {
    "DisplayName": "Thomas Shola",
    "area1": "Corporate & Securities Law",
    "area2": "Business Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/thomas-shola.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/thomas-shola/_jcr_content/profileImage.img.png",
    "SortName": "Shola, Thomas",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Thom Shola is responsible for Enterprise Risk Management across Northern Bank, second line of defense risk and compliance oversight of Enterprise Risk Management with a concentrated focus on Risk Management, Regulatory Relations, Safety, and Soundness; End-to-End Risk Consumer and Commercial portfolios.\n\nShola has more than 31 years of experience in the financial services industry. He holds certifications in Lean Six Sigma, Third Party Risk and Certified Information Systems Security Professional.\n\nShola graduated from Boston College, Woods College with a Master of Science Cybersecurity Policy & Governance in 2019 and had previously taught at Brown University and currently at Boston College.\n\nIn addition to working at Northern Bank and teaching at Boston College, Shola is a member of the President’s Advisory Council at Mentor Rhode Island and Boston College Law School Advisory Board Member."
  },
  {
    "DisplayName": "B. Stephanie Siegmann",
    "area1": "Civil Litigation & Procedure",
    "area2": "Intellectual Property & Technology Law",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/stephanie-siegmann.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/stephanie-siegmann/_jcr_content/profileImage.img.png",
    "SortName": "Siegmann, B. Stephanie",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "B. Stephanie Siegmann is a litigation partner and serves as Co-Chair of the Cybersecurity, Privacy & Data Protection group at Hinckley Allen & Snyder LLP. Siegmann has been a trial lawyer for more than 25 years overseeing hundreds of complex investigations and trying countless trials. Prior to joining Hinckley Allen in March 2022, Siegmann handled and supervised some of the highest profile national security matters in the country during her 18-year tenure as a former prosecutor and National Security Chief in the United States Attorney’s Office for the District of Massachusetts. Siegmann began her career as a prosecutor in the Navy Judge Advocate General’s Corps where she prosecuted violent crimes (i.e., murder, rape, and child abuse) as well as cases involving fraud and computer offenses.\n\nSiegmann uses her experience as a former prosecutor to defend companies and individuals in complex government investigations and advises clients on a full range of issues involving cybersecurity, privacy, international trade, national security laws, and financial crimes.  She conducts internal investigations, provides assistance with compliance related matters, interfaces with law enforcement agencies, responds to government inquiries and subpoenas, seeks to favorably resolve government enforcement matters, and provides aggressive representation in civil and criminal matters.\n\nSiegmann is a Former National Security Prosecutor and Litigation Partner at Hinckley Allen & Snyder LLP."
  },
  {
    "DisplayName": "Kerriann Stout",
    "area1": "Immigration Law",
    "area2": "",
    "area3": "",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Kerriann-Stout.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/Kerriann-Stout/_jcr_content/profileImage.img.png",
    "SortName": "Stout, Kerriann",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Kerriann Stout is a founding partner of Darian Stout, LLP. She specializes in immigration law and is licensed to practice in New York and New Jersey. Kerriann graduated cum laude from Pace Law School in 2013.  While a student at Pace, she received the Josephine and Anthony DiFiore Memorial Scholarship, was a member of the St. John’s Peter James Johnson National Civil Rights Competition and the Young Texas Lawyers Association National Trial Competition teams, served as the president of the Italian American Law Students Organization and the secretary of the Student Bar Association and worked as a Dean's Scholar. \n\nKerriann was also awarded the Extraordinary Pro Bono Justice Award for completing over 250 hours of pro bono service as a law student. After graduation Kerriann spent one year as a fellow at the Pace Community Law Practice prior to founding her law firm with fellow Pace grad Pouyan Darian in August 2014.\n\nFrom 2014-2016 Kerriann was a founding partner at the immigration defense law firm Darian Stout, LLP. From 2015-2016 Kerriann was the Acting Assistant Director of Academic Success at Pace Law School. From 2016-2018 Kerriann was the Associate Director of Academic Support at Vermont Law School. Additionally, since 2014 Kerriann has been running a bar exam coaching company where she helps students pass the bar exam with less stress and more confidence. Kerriann has been teaching in the Online Learning Program since 2017."
  },
  {
    "DisplayName": "David Wilkinson",
    "area1": "International & Comparative Law",
    "area2": "Real Estate Law",
    "area3": "Business Law",
    "acfacAreas": "",
    "URL": "https://www.bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/david-wilkinson.html",
    "Image": "//bc.edu/content/bc-web/schools/law/academics-faculty/faculty-directory/david-wilkinson/_jcr_content/profileImage.img.png",
    "SortName": "Wilkinson, David",
    "facultyStatus": "Adjunct Faculty",
    "priority": 4,
    "biography": "Wilkinson has over 30 years of experience in cybersecurity, risk management, strategy development and operations. He is currently Senior Managing Partner at the Bellwether Group, Inc., an advisory firm that develops and implements security, risk management and resiliency strategies. Recently, Wilkinson was Senior Director at Gartner, Inc. heading up Security and Risk Management for the Financial Services Industry in North America. He is an adjunct Professor in the Cybersecurity master’s degree program at Boston College and also a member of its Advisory Board. His professional experience ranges from corporate strategy development and private equity to direct profit and loss responsibility as chief executive.\n\nAt Bellwether, Wilkinson advises clients on their security and preparedness strategies, policies, internal organization and reporting relationships. Operational resiliency includes: risk and vulnerability assessments; physical, information and network/cyber security; brand protection; incident response and business continuity. David has worked with over 85 major corporations in more than 17 industries in these contexts. He wrote a digital short on Security Operating Centers published by the Financial Times Press.\n\nAt Gartner, Wilkinson was a Senior Director in its Security and Risk Management practice. In this capacity, David has developed cybersecurity strategies and implementation plans for several leading banks and financial institutions. He founded Gartner Consulting’s practices in Data Loss Prevention (DLP), Information Technology Risk Management (ITRM) and their Insider Threat Management program. He regularly helped companies identify and analyze cybersecurity metrics and design executive dashboards.\n\nAt Boston College, Wilkinson helped found the Master’s Degree program for CyberSecurity, is a member of its Advisory Board and teaches in the graduate and certification programs. The graduate program has grown from launch to around 135 students and is a key source of qualified staff to the local cybersecurity industry.\n\nAs Senior Vice President of Capricorn Investors LP, a private equity fund, Wilkinson was responsible for new investments. David spent eight years as a senior executive with City Investing Company and its subsidiaries and successor companies. City Investing was a $6 billion international company listed on the NYSE with operations in manufacturing, printing, lodging, food services, real estate, insurance, and financial services. He was appointed chief executive at three of its operating businesses.\n\nAfter receiving his postgraduate degree, Wilkinson joined The Boston Consulting Group (BCG), a leading international strategy consulting firm. Prior to business school, he worked as a production manager for Unilever, Ltd. in the United Kingdom where he supervised 400 unionized employees and was selected for Unilever’s Company Management Development Scheme (UCMDS).\n\nThroughout his career, Wilkinson has acquired extensive international work experience in more than 25 countries including brief periods of residence in Central Europe, South Africa and Australia.\n\nWilkinson earned his MSc in Business Administration from the London Business School, attended the University of Chicago’s Graduate (now the Booth) School of Business under the International Management Program and holds a BSc (with Honors) from the University of East Anglia."
  }
]